AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
/*******************************************************************************
 * ADC Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t ADDATA;                                                       ///< Data Register                                offset: 0x00
    __IO uint32_t ADCFG;                                                        ///< Configuration Register                       offset: 0x04
    __IO uint32_t ADCR;                                                         ///< Control Register                             offset: 0x08
    __IO uint32_t ADCHS;                                                        ///< Channel Selection Register                   offset: 0x0C
    __IO uint32_t ADCMPR;                                                       ///< Analog Watchdog Compare Register             offset: 0x10
    __IO uint32_t ADSTA;                                                        ///< Status Register                              offset: 0x14
    __IO uint32_t ADDR[16];                                                     ///< Channel Data Register                        offset: 0x18
    __IO uint32_t ADSTAEXT;                                                     ///< Extended State Register                      offset: 0x58
    __IO uint32_t CHANY0;                                                       ///< Any Channel Selection Register 0             offset: 0x5C
    __IO uint32_t CHANY1;                                                       ///< Any Channel Selection Register 1             offset: 0x60
    __IO uint32_t ANYCFG;                                                       ///< Any Channel Configuration Register           offset: 0x64
    __IO uint32_t ANYCR;                                                        ///< Any Channel Control Register                 offset: 0x68
    __IO uint32_t ADCFG2;                                                       ///< Configuration Register 2                     offset: 0x6C
    __IO uint32_t SMPR1;                                                        ///< Sample Configuration Register 1              offset: 0x70
    __IO uint32_t SMPR2;                                                        ///< Sample Configuration Register 2              offset: 0x74
    __IO uint32_t SMPR3;                                                        ///< Sample Configuration Register 3              offset: 0x78
    __IO uint32_t JOFR[4];                                                      ///< Injected Channel Data Offset Register        offset: 0x7C
    __IO uint32_t JSQR;                                                         ///< Injected Sequence Register                   offset: 0x8C
    __IO uint32_t JADDATA;                                                      ///< Injected Data Register                       offset: 0x90
    __IO uint32_t Reserved1[7];                                                 ///< Reserved
    __IO uint32_t JDR[4];                                                       ///< Injected Channel Data Register               offset: 0xB0
} ADC_Type;

/*******************************************************************************
 * ADC Type
 ******************************************************************************/

/*!
 * @addtogroup ADC_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief ADC_ADDATA Register Bit Definition
 */

#define ADC_ADDATA_CHANNELSELH_SHIFT            (22)
#define ADC_ADDATA_CHANNELSELH_MASK             (0x1U << ADC_ADDATA_CHANNELSELH_SHIFT)
#define ADC_ADDATA_CHANNELSELH(x)               (((uint32_t)(((uint32_t)(x)) << ADC_ADDATA_CHANNELSELH_SHIFT)) & ADC_ADDATA_CHANNELSELH_MASK)

#define ADC_ADDATA_VALID_SHIFT                  (21)
#define ADC_ADDATA_VALID_MASK                   (0x1U << ADC_ADDATA_VALID_SHIFT)
#define ADC_ADDATA_VALID(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_ADDATA_VALID_SHIFT)) & ADC_ADDATA_VALID_MASK)

#define ADC_ADDATA_OVERRUN_SHIFT                (20)
#define ADC_ADDATA_OVERRUN_MASK                 (0x1U << ADC_ADDATA_OVERRUN_SHIFT)
#define ADC_ADDATA_OVERRUN(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_ADDATA_OVERRUN_SHIFT)) & ADC_ADDATA_OVERRUN_MASK)

#define ADC_ADDATA_CHANNELSEL_SHIFT             (16)
#define ADC_ADDATA_CHANNELSEL_MASK              (0xFU << ADC_ADDATA_CHANNELSEL_SHIFT)
#define ADC_ADDATA_CHANNELSEL(x)                (((uint32_t)(((uint32_t)(x)) << ADC_ADDATA_CHANNELSEL_SHIFT)) & ADC_ADDATA_CHANNELSEL_MASK)

#define ADC_ADDATA_DATA_SHIFT                   (0)
#define ADC_ADDATA_DATA_MASK                    (0xFFFFU << ADC_ADDATA_DATA_SHIFT)
#define ADC_ADDATA_DATA(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_ADDATA_DATA_SHIFT)) & ADC_ADDATA_DATA_MASK)

/*!
 * @brief ADC_ADCFG Register Bit Definition
 */

#define ADC_ADCFG_JAWDEN_SHIFT                  (16)
#define ADC_ADCFG_JAWDEN_MASK                   (0x1U << ADC_ADCFG_JAWDEN_SHIFT)
#define ADC_ADCFG_JAWDEN(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG_JAWDEN_SHIFT)) & ADC_ADCFG_JAWDEN_MASK)

#define ADC_ADCFG_RSLTCTL_SHIFT                 (7)
#define ADC_ADCFG_RSLTCTL_MASK                  (0x7U << ADC_ADCFG_RSLTCTL_SHIFT)
#define ADC_ADCFG_RSLTCTL(x)                    (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG_RSLTCTL_SHIFT)) & ADC_ADCFG_RSLTCTL_MASK)

#define ADC_ADCFG_VSEN_SHIFT                    (3)
#define ADC_ADCFG_VSEN_MASK                     (0x1U << ADC_ADCFG_VSEN_SHIFT)
#define ADC_ADCFG_VSEN(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG_VSEN_SHIFT)) & ADC_ADCFG_VSEN_MASK)

#define ADC_ADCFG_TSEN_SHIFT                    (2)
#define ADC_ADCFG_TSEN_MASK                     (0x1U << ADC_ADCFG_TSEN_SHIFT)
#define ADC_ADCFG_TSEN(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG_TSEN_SHIFT)) & ADC_ADCFG_TSEN_MASK)

#define ADC_ADCFG_AWDEN_SHIFT                   (1)
#define ADC_ADCFG_AWDEN_MASK                    (0x1U << ADC_ADCFG_AWDEN_SHIFT)
#define ADC_ADCFG_AWDEN(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG_AWDEN_SHIFT)) & ADC_ADCFG_AWDEN_MASK)

#define ADC_ADCFG_ADEN_SHIFT                    (0)
#define ADC_ADCFG_ADEN_MASK                     (0x1U << ADC_ADCFG_ADEN_SHIFT)
#define ADC_ADCFG_ADEN(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG_ADEN_SHIFT)) & ADC_ADCFG_ADEN_MASK)

/*!
 * @brief ADC_ADCR Register Bit Definition
 */

#define ADC_ADCR_CMPCHH_SHIFT                   (28)
#define ADC_ADCR_CMPCHH_MASK                    (0x1U << ADC_ADCR_CMPCHH_SHIFT)
#define ADC_ADCR_CMPCHH(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_ADCR_CMPCHH_SHIFT)) & ADC_ADCR_CMPCHH_MASK)

#define ADC_ADCR_EOCIE_SHIFT                    (27)
#define ADC_ADCR_EOCIE_MASK                     (0x1U << ADC_ADCR_EOCIE_SHIFT)
#define ADC_ADCR_EOCIE(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_ADCR_EOCIE_SHIFT)) & ADC_ADCR_EOCIE_MASK)

#define ADC_ADCR_EOSMPIE_SHIFT                  (26)
#define ADC_ADCR_EOSMPIE_MASK                   (0x1U << ADC_ADCR_EOSMPIE_SHIFT)
#define ADC_ADCR_EOSMPIE(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_ADCR_EOSMPIE_SHIFT)) & ADC_ADCR_EOSMPIE_MASK)

