AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define ADC_ADSTAEXT_OVERRUN_SHIFT              (4)
#define ADC_ADSTAEXT_OVERRUN_MASK               (0xFU << ADC_ADSTAEXT_OVERRUN_SHIFT)
#define ADC_ADSTAEXT_OVERRUN(x)                 (((uint32_t)(((uint32_t)(x)) << ADC_ADSTAEXT_OVERRUN_SHIFT)) & ADC_ADSTAEXT_OVERRUN_MASK)

#define ADC_ADSTAEXT_VALID_SHIFT                (0)
#define ADC_ADSTAEXT_VALID_MASK                 (0xFU << ADC_ADSTAEXT_VALID_SHIFT)
#define ADC_ADSTAEXT_VALID(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_ADSTAEXT_VALID_SHIFT)) & ADC_ADSTAEXT_VALID_MASK)

/*!
 * @brief ADC_CHANY0 Register Bit Definition
 */

#define ADC_CHANY0_CHANYSELL7_SHIFT             (28)
#define ADC_CHANY0_CHANYSELL7_MASK              (0xFU << ADC_CHANY0_CHANYSELL7_SHIFT)
#define ADC_CHANY0_CHANYSELL7(x)                (((uint32_t)(((uint32_t)(x)) << ADC_CHANY0_CHANYSELL7_SHIFT)) & ADC_CHANY0_CHANYSELL7_MASK)

#define ADC_CHANY0_CHANYSELL6_SHIFT             (24)
#define ADC_CHANY0_CHANYSELL6_MASK              (0xFU << ADC_CHANY0_CHANYSELL6_SHIFT)
#define ADC_CHANY0_CHANYSELL6(x)                (((uint32_t)(((uint32_t)(x)) << ADC_CHANY0_CHANYSELL6_SHIFT)) & ADC_CHANY0_CHANYSELL6_MASK)

#define ADC_CHANY0_CHANYSELL5_SHIFT             (20)
#define ADC_CHANY0_CHANYSELL5_MASK              (0xFU << ADC_CHANY0_CHANYSELL5_SHIFT)
#define ADC_CHANY0_CHANYSELL5(x)                (((uint32_t)(((uint32_t)(x)) << ADC_CHANY0_CHANYSELL5_SHIFT)) & ADC_CHANY0_CHANYSELL5_MASK)

#define ADC_CHANY0_CHANYSELL4_SHIFT             (16)
#define ADC_CHANY0_CHANYSELL4_MASK              (0xFU << ADC_CHANY0_CHANYSELL4_SHIFT)
#define ADC_CHANY0_CHANYSELL4(x)                (((uint32_t)(((uint32_t)(x)) << ADC_CHANY0_CHANYSELL4_SHIFT)) & ADC_CHANY0_CHANYSELL4_MASK)

#define ADC_CHANY0_CHANYSELL3_SHIFT             (12)
#define ADC_CHANY0_CHANYSELL3_MASK              (0xFU << ADC_CHANY0_CHANYSELL3_SHIFT)
#define ADC_CHANY0_CHANYSELL3(x)                (((uint32_t)(((uint32_t)(x)) << ADC_CHANY0_CHANYSELL3_SHIFT)) & ADC_CHANY0_CHANYSELL3_MASK)

#define ADC_CHANY0_CHANYSELL2_SHIFT             (8)
#define ADC_CHANY0_CHANYSELL2_MASK              (0xFU << ADC_CHANY0_CHANYSELL2_SHIFT)
#define ADC_CHANY0_CHANYSELL2(x)                (((uint32_t)(((uint32_t)(x)) << ADC_CHANY0_CHANYSELL2_SHIFT)) & ADC_CHANY0_CHANYSELL2_MASK)

#define ADC_CHANY0_CHANYSELL1_SHIFT             (4)
#define ADC_CHANY0_CHANYSELL1_MASK              (0xFU << ADC_CHANY0_CHANYSELL1_SHIFT)
#define ADC_CHANY0_CHANYSELL1(x)                (((uint32_t)(((uint32_t)(x)) << ADC_CHANY0_CHANYSELL1_SHIFT)) & ADC_CHANY0_CHANYSELL1_MASK)

#define ADC_CHANY0_CHANYSELL0_SHIFT             (0)
#define ADC_CHANY0_CHANYSELL0_MASK              (0xFU << ADC_CHANY0_CHANYSELL0_SHIFT)
#define ADC_CHANY0_CHANYSELL0(x)                (((uint32_t)(((uint32_t)(x)) << ADC_CHANY0_CHANYSELL0_SHIFT)) & ADC_CHANY0_CHANYSELL0_MASK)

/*!
 * @brief ADC_CHANY1 Register Bit Definition
 */

#define ADC_CHANY1_CHANYSEL15_SHIFT             (28)
#define ADC_CHANY1_CHANYSEL15_MASK              (0xFU << ADC_CHANY1_CHANYSEL15_SHIFT)
#define ADC_CHANY1_CHANYSEL15(x)                (((uint32_t)(((uint32_t)(x)) << ADC_CHANY1_CHANYSEL15_SHIFT)) & ADC_CHANY1_CHANYSEL15_MASK)

#define ADC_CHANY1_CHANYSEL14_SHIFT             (24)
#define ADC_CHANY1_CHANYSEL14_MASK              (0xFU << ADC_CHANY1_CHANYSEL14_SHIFT)
#define ADC_CHANY1_CHANYSEL14(x)                (((uint32_t)(((uint32_t)(x)) << ADC_CHANY1_CHANYSEL14_SHIFT)) & ADC_CHANY1_CHANYSEL14_MASK)

#define ADC_CHANY1_CHANYSELL13_SHIFT            (20)
#define ADC_CHANY1_CHANYSELL13_MASK             (0xFU << ADC_CHANY1_CHANYSELL13_SHIFT)
#define ADC_CHANY1_CHANYSELL13(x)               (((uint32_t)(((uint32_t)(x)) << ADC_CHANY1_CHANYSELL13_SHIFT)) & ADC_CHANY1_CHANYSELL13_MASK)

#define ADC_CHANY1_CHANYSEL12_SHIFT             (16)
#define ADC_CHANY1_CHANYSEL12_MASK              (0xFU << ADC_CHANY1_CHANYSEL12_SHIFT)
#define ADC_CHANY1_CHANYSEL12(x)                (((uint32_t)(((uint32_t)(x)) << ADC_CHANY1_CHANYSEL12_SHIFT)) & ADC_CHANY1_CHANYSEL12_MASK)

#define ADC_CHANY1_CHANYSEL11_SHIFT             (12)
#define ADC_CHANY1_CHANYSEL11_MASK              (0xFU << ADC_CHANY1_CHANYSEL11_SHIFT)
#define ADC_CHANY1_CHANYSEL11(x)                (((uint32_t)(((uint32_t)(x)) << ADC_CHANY1_CHANYSEL11_SHIFT)) & ADC_CHANY1_CHANYSEL11_MASK)

#define ADC_CHANY1_CHANYSEL10_SHIFT             (8)
#define ADC_CHANY1_CHANYSEL10_MASK              (0xFU << ADC_CHANY1_CHANYSEL10_SHIFT)
#define ADC_CHANY1_CHANYSEL10(x)                (((uint32_t)(((uint32_t)(x)) << ADC_CHANY1_CHANYSEL10_SHIFT)) & ADC_CHANY1_CHANYSEL10_MASK)

#define ADC_CHANY1_CHANYSEL9_SHIFT              (4)
#define ADC_CHANY1_CHANYSEL9_MASK               (0xFU << ADC_CHANY1_CHANYSEL9_SHIFT)
#define ADC_CHANY1_CHANYSEL9(x)                 (((uint32_t)(((uint32_t)(x)) << ADC_CHANY1_CHANYSEL9_SHIFT)) & ADC_CHANY1_CHANYSEL9_MASK)

#define ADC_CHANY1_CHANYSEL8_SHIFT              (0)
#define ADC_CHANY1_CHANYSEL8_MASK               (0xFU << ADC_CHANY1_CHANYSEL8_SHIFT)
#define ADC_CHANY1_CHANYSEL8(x)                 (((uint32_t)(((uint32_t)(x)) << ADC_CHANY1_CHANYSEL8_SHIFT)) & ADC_CHANY1_CHANYSEL8_MASK)

/*!
 * @brief ADC_ANY_CFG Register Bit Definition
 */

#define ADC_ANYCFG_CHANYSELH15_SHIFT            (24)
#define ADC_ANYCFG_CHANYSELH15_MASK             (0x1U << ADC_ANYCFG_CHANYSELH15_SHIFT)
#define ADC_ANYCFG_CHANYSELH15(x)               (((uint32_t)(((uint32_t)(x)) << ADC_ANYCFG_CHANYSELH15_SHIFT)) & ADC_ANYCFG_CHANYSELH15_MASK)

#define ADC_ANYCFG_CHANYSELH14_SHIFT            (23)
#define ADC_ANYCFG_CHANYSELH14_MASK             (0x1U << ADC_ANYCFG_CHANYSELH14_SHIFT)
#define ADC_ANYCFG_CHANYSELH14(x)               (((uint32_t)(((uint32_t)(x)) << ADC_ANYCFG_CHANYSELH14_SHIFT)) & ADC_ANYCFG_CHANYSELH14_MASK)

#define ADC_ANYCFG_CHANYSELH13_SHIFT            (22)
#define ADC_ANYCFG_CHANYSELH13_MASK             (0x1U << ADC_ANYCFG_CHANYSELH13_SHIFT)
#define ADC_ANYCFG_CHANYSELH13(x)               (((uint32_t)(((uint32_t)(x)) << ADC_ANYCFG_CHANYSELH13_SHIFT)) & ADC_ANYCFG_CHANYSELH13_MASK)

#define ADC_ANYCFG_CHANYSELH12_SHIFT            (21)
#define ADC_ANYCFG_CHANYSELH12_MASK             (0x1U << ADC_ANYCFG_CHANYSELH12_SHIFT)
#define ADC_ANYCFG_CHANYSELH12(x)               (((uint32_t)(((uint32_t)(x)) << ADC_ANYCFG_CHANYSELH12_SHIFT)) & ADC_ANYCFG_CHANYSELH12_MASK)

#define ADC_ANYCFG_CHANYSELH11_SHIFT            (20)
#define ADC_ANYCFG_CHANYSELH11_MASK             (0x1U << ADC_ANYCFG_CHANYSELH11_SHIFT)
#define ADC_ANYCFG_CHANYSELH11(x)               (((uint32_t)(((uint32_t)(x)) << ADC_ANYCFG_CHANYSELH11_SHIFT)) & ADC_ANYCFG_CHANYSELH11_MASK)

#define ADC_ANYCFG_CHANYSELH10_SHIFT            (19)
#define ADC_ANYCFG_CHANYSELH10_MASK             (0x1U << ADC_ANYCFG_CHANYSELH10_SHIFT)
#define ADC_ANYCFG_CHANYSELH10(x)               (((uint32_t)(((uint32_t)(x)) << ADC_ANYCFG_CHANYSELH10_SHIFT)) & ADC_ANYCFG_CHANYSELH10_MASK)

