AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define ADC_ADCFG2_TROVS_SHIFT                  (25)
#define ADC_ADCFG2_TROVS_MASK                   (0x1U << ADC_ADCFG2_TROVS_SHIFT)
#define ADC_ADCFG2_TROVS(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG2_TROVS_SHIFT)) & ADC_ADCFG2_TROVS_MASK)

#define ADC_ADCFG2_OVSS_SHIFT                   (21)
#define ADC_ADCFG2_OVSS_MASK                    (0xFU << ADC_ADCFG2_OVSS_SHIFT)
#define ADC_ADCFG2_OVSS(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG2_OVSS_SHIFT)) & ADC_ADCFG2_OVSS_MASK)

#define ADC_ADCFG2_OVSR_SHIFT                   (18)
#define ADC_ADCFG2_OVSR_MASK                    (0x7U << ADC_ADCFG2_OVSR_SHIFT)
#define ADC_ADCFG2_OVSR(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG2_OVSR_SHIFT)) & ADC_ADCFG2_OVSR_MASK)

#define ADC_ADCFG2_JOVSE_SHIFT                  (17)
#define ADC_ADCFG2_JOVSE_MASK                   (0x1U << ADC_ADCFG2_JOVSE_SHIFT)
#define ADC_ADCFG2_JOVSE(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG2_JOVSE_SHIFT)) & ADC_ADCFG2_JOVSE_MASK)

#define ADC_ADCFG2_ROVSE_SHIFT                  (16)
#define ADC_ADCFG2_ROVSE_MASK                   (0x1U << ADC_ADCFG2_ROVSE_SHIFT)
#define ADC_ADCFG2_ROVSE(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG2_ROVSE_SHIFT)) & ADC_ADCFG2_ROVSE_MASK)

#define ADC_ADCFG2_PSDC_SHIFT                   (10)
#define ADC_ADCFG2_PSDC_MASK                    (0x1FU << ADC_ADCFG2_PSDC_SHIFT)
#define ADC_ADCFG2_PSDC(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG2_PSDC_SHIFT)) & ADC_ADCFG2_PSDC_MASK)

#define ADC_ADCFG2_DC_SHIFT                     (5)
#define ADC_ADCFG2_DC_MASK                      (0xFU << ADC_ADCFG2_DC_SHIFT)
#define ADC_ADCFG2_DC(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG2_DC_SHIFT)) & ADC_ADCFG2_DC_MASK)

#define ADC_ADCFG2_ADCSREF_SHIFT                (2)
#define ADC_ADCFG2_ADCSREF_MASK                 (0x1U << ADC_ADCFG2_ADCSREF_SHIFT)
#define ADC_ADCFG2_ADCSREF(x)                   (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG2_ADCSREF_SHIFT)) & ADC_ADCFG2_ADCSREF_MASK)

#define ADC_ADCFG2_ADCCR_SHIFT                  (1)
#define ADC_ADCFG2_ADCCR_MASK                   (0x1U << ADC_ADCFG2_ADCCR_SHIFT)
#define ADC_ADCFG2_ADCCR(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_ADCFG2_ADCCR_SHIFT)) & ADC_ADCFG2_ADCCR_MASK)

/*!
 * @brief ADC_SMPR1 Register Bit Definition
 */

#define ADC_SMPR1_SAMP7_SHIFT                   (28)
#define ADC_SMPR1_SAMP7_MASK                    (0xFU << ADC_SMPR1_SAMP7_SHIFT)
#define ADC_SMPR1_SAMP7(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_SMPR1_SAMP7_SHIFT)) & ADC_SMPR1_SAMP7_MASK)

#define ADC_SMPR1_SAMP6_SHIFT                   (24)
#define ADC_SMPR1_SAMP6_MASK                    (0xFU << ADC_SMPR1_SAMP6_SHIFT)
#define ADC_SMPR1_SAMP6(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_SMPR1_SAMP6_SHIFT)) & ADC_SMPR1_SAMP6_MASK)

#define ADC_SMPR1_SAMP5_SHIFT                   (20)
#define ADC_SMPR1_SAMP5_MASK                    (0xFU << ADC_SMPR1_SAMP5_SHIFT)
#define ADC_SMPR1_SAMP5(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_SMPR1_SAMP5_SHIFT)) & ADC_SMPR1_SAMP5_MASK)

#define ADC_SMPR1_SAMP4_SHIFT                   (16)
#define ADC_SMPR1_SAMP4_MASK                    (0xFU << ADC_SMPR1_SAMP4_SHIFT)
#define ADC_SMPR1_SAMP4(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_SMPR1_SAMP4_SHIFT)) & ADC_SMPR1_SAMP4_MASK)

#define ADC_SMPR1_SAMP3_SHIFT                   (12)
#define ADC_SMPR1_SAMP3_MASK                    (0xFU << ADC_SMPR1_SAMP3_SHIFT)
#define ADC_SMPR1_SAMP3(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_SMPR1_SAMP3_SHIFT)) & ADC_SMPR1_SAMP3_MASK)

#define ADC_SMPR1_SAMP2_SHIFT                   (8)
#define ADC_SMPR1_SAMP2_MASK                    (0xFU << ADC_SMPR1_SAMP2_SHIFT)
#define ADC_SMPR1_SAMP2(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_SMPR1_SAMP2_SHIFT)) & ADC_SMPR1_SAMP2_MASK)

#define ADC_SMPR1_SAMP1_SHIFT                   (4)
#define ADC_SMPR1_SAMP1_MASK                    (0xFU << ADC_SMPR1_SAMP1_SHIFT)
#define ADC_SMPR1_SAMP1(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_SMPR1_SAMP1_SHIFT)) & ADC_SMPR1_SAMP1_MASK)

#define ADC_SMPR1_SAMP0_SHIFT                   (0)
#define ADC_SMPR1_SAMP0_MASK                    (0xFU << ADC_SMPR1_SAMP0_SHIFT)
#define ADC_SMPR1_SAMP0(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_SMPR1_SAMP0_SHIFT)) & ADC_SMPR1_SAMP0_MASK)

/*!
 * @brief ADC_SMPR2 Register Bit Definition
 */

#define ADC_SMPR2_SAMP15_SHIFT                  (28)
#define ADC_SMPR2_SAMP15_MASK                   (0xFU << ADC_SMPR2_SAMP15_SHIFT)
#define ADC_SMPR2_SAMP15(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_SMPR2_SAMP15_SHIFT)) & ADC_SMPR2_SAMP15_MASK)

#define ADC_SMPR2_SAMP14_SHIFT                  (24)
#define ADC_SMPR2_SAMP14_MASK                   (0xFU << ADC_SMPR2_SAMP14_SHIFT)
#define ADC_SMPR2_SAMP14(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_SMPR2_SAMP14_SHIFT)) & ADC_SMPR2_SAMP14_MASK)

#define ADC_SMPR2_SAMP13_SHIFT                  (20)
#define ADC_SMPR2_SAMP13_MASK                   (0xFU << ADC_SMPR2_SAMP13_SHIFT)
#define ADC_SMPR2_SAMP13(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_SMPR2_SAMP13_SHIFT)) & ADC_SMPR2_SAMP13_MASK)

#define ADC_SMPR2_SAMP12_SHIFT                  (16)
#define ADC_SMPR2_SAMP12_MASK                   (0xFU << ADC_SMPR2_SAMP12_SHIFT)
#define ADC_SMPR2_SAMP12(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_SMPR2_SAMP12_SHIFT)) & ADC_SMPR2_SAMP12_MASK)

#define ADC_SMPR2_SAMP11_SHIFT                  (12)
#define ADC_SMPR2_SAMP11_MASK                   (0xFU << ADC_SMPR2_SAMP11_SHIFT)
#define ADC_SMPR2_SAMP11(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_SMPR2_SAMP11_SHIFT)) & ADC_SMPR2_SAMP11_MASK)

#define ADC_SMPR2_SAMP10_SHIFT                  (8)
#define ADC_SMPR2_SAMP10_MASK                   (0xFU << ADC_SMPR2_SAMP10_SHIFT)
#define ADC_SMPR2_SAMP10(x)                     (((uint32_t)(((uint32_t)(x)) << ADC_SMPR2_SAMP10_SHIFT)) & ADC_SMPR2_SAMP10_MASK)

#define ADC_SMPR2_SAMP9_SHIFT                   (4)
#define ADC_SMPR2_SAMP9_MASK                    (0xFU << ADC_SMPR2_SAMP9_SHIFT)
#define ADC_SMPR2_SAMP9(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_SMPR2_SAMP9_SHIFT)) & ADC_SMPR2_SAMP9_MASK)

#define ADC_SMPR2_SAMP8_SHIFT                   (0)
#define ADC_SMPR2_SAMP8_MASK                    (0xFU << ADC_SMPR2_SAMP8_SHIFT)
#define ADC_SMPR2_SAMP8(x)                      (((uint32_t)(((uint32_t)(x)) << ADC_SMPR2_SAMP8_SHIFT)) & ADC_SMPR2_SAMP8_MASK)

/*!
 * @brief ADC_SMPR3 Register Bit Definition
 */

