AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define COMP_POLL_POUT_SHIFT                    (8)
#define COMP_POLL_POUT_MASK                     (0x7U << COMP_POLL_POUT_SHIFT)
#define COMP_POLL_POUT(x)                       (((uint32_t)(((uint32_t)(x)) << COMP_POLL_POUT_SHIFT)) & COMP_POLL_POUT_MASK)

#define COMP_POLL_PERIOD_SHIFT                  (4)
#define COMP_POLL_PERIOD_MASK                   (0x7U << COMP_POLL_PERIOD_SHIFT)
#define COMP_POLL_PERIOD(x)                     (((uint32_t)(((uint32_t)(x)) << COMP_POLL_PERIOD_SHIFT)) & COMP_POLL_PERIOD_MASK)

#define COMP_POLL_FIXN_SHIFT                    (2)
#define COMP_POLL_FIXN_MASK                     (0x1U << COMP_POLL_FIXN_SHIFT)
#define COMP_POLL_FIXN(x)                       (((uint32_t)(((uint32_t)(x)) << COMP_POLL_FIXN_SHIFT)) & COMP_POLL_FIXN_MASK)

#define COMP_POLL_POLLCH_SHIFT                  (1)
#define COMP_POLL_POLLCH_MASK                   (0x1U << COMP_POLL_POLLCH_SHIFT)
#define COMP_POLL_POLLCH(x)                     (((uint32_t)(((uint32_t)(x)) << COMP_POLL_POLLCH_SHIFT)) & COMP_POLL_POLLCH_MASK)

#define COMP_POLL_POLLEN_SHIFT                  (0)
#define COMP_POLL_POLLEN_MASK                   (0x1U << COMP_POLL_POLLEN_SHIFT)
#define COMP_POLL_POLLEN(x)                     (((uint32_t)(((uint32_t)(x)) << COMP_POLL_POLLEN_SHIFT)) & COMP_POLL_POLLEN_MASK)

/*!
 * @}
 */ /* end of group COMP_Register_Masks */
/******************************************************************************
 *COMP Instance
*******************************************************************************/

#define COMP                 ((COMP_Type*)COMP_BASE)

/*!
 * @}
 */ /* end of group COMP_Peripheral_Access_Layer */



/*!
 * @addtogroup CORDIC_Peripheral_Access_Layer CORDIC Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * CORDIC Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t DXR;                                                          ///< CORDIC X Data Register                       offset: 0x00
    __IO uint32_t DYR;                                                          ///< CORDIC Y Data Register                       offset: 0x04
    __IO uint32_t DZR;                                                          ///< CORDIC Z Data Register                       offset: 0x08
    __IO uint32_t RXR;                                                          ///< CORDIC X Result Register                     offset: 0x0C
    __IO uint32_t RYR;                                                          ///< CORDIC Y Result Register                     offset: 0x10
    __IO uint32_t RZR;                                                          ///< CORDIC Z Result Register                     offset: 0x14
    __IO uint32_t CR;                                                           ///< CORDIC Control Register                      offset: 0x18
    __IO uint32_t SR;                                                           ///< CORDIC Status Register                       offset: 0x1C
} CORDIC_Type;

/*******************************************************************************
 * CORDIC Type
 ******************************************************************************/

/*!
 * @addtogroup CORDIC_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief CORDIC_DXR Register Bit Definition
 */

#define CORDIC_DXR_DX_SHIFT                     (0)
#define CORDIC_DXR_DX_MASK                      (0xFFFFFFU << CORDIC_DXR_DX_SHIFT)
#define CORDIC_DXR_DX(x)                        (((uint32_t)(((uint32_t)(x)) << CORDIC_DXR_DX_SHIFT)) & CORDIC_DXR_DX_MASK)

/*!
 * @brief CORDIC_DYR Register Bit Definition
 */

#define CORDIC_DYR_DY_SHIFT                     (0)
#define CORDIC_DYR_DY_MASK                      (0xFFFFFFU << CORDIC_DYR_DY_SHIFT)
#define CORDIC_DYR_DY(x)                        (((uint32_t)(((uint32_t)(x)) << CORDIC_DYR_DY_SHIFT)) & CORDIC_DYR_DY_MASK)

/*!
 * @brief CORDIC_DZR Register Bit Definition
 */

#define CORDIC_DZR_DZ_SHIFT                     (0)
#define CORDIC_DZR_DZ_MASK                      (0xFFFFFFU << CORDIC_DZR_DZ_SHIFT)
#define CORDIC_DZR_DZ(x)                        (((uint32_t)(((uint32_t)(x)) << CORDIC_DZR_DZ_SHIFT)) & CORDIC_DZR_DZ_MASK)

/*!
 * @brief CORDIC_RXR Register Bit Definition
 */

#define CORDIC_RXR_RX_SHIFT                     (0)
#define CORDIC_RXR_RX_MASK                      (0x1FFFFFFU << CORDIC_RXR_RX_SHIFT)
#define CORDIC_RXR_RX(x)                        (((uint32_t)(((uint32_t)(x)) << CORDIC_RXR_RX_SHIFT)) & CORDIC_RXR_RX_MASK)

/*!
 * @brief CORDIC_RYR Register Bit Definition
 */

#define CORDIC_RYR_RY_SHIFT                     (0)
#define CORDIC_RYR_RY_MASK                      (0x1FFFFFFU << CORDIC_RYR_RY_SHIFT)
#define CORDIC_RYR_RY(x)                        (((uint32_t)(((uint32_t)(x)) << CORDIC_RYR_RY_SHIFT)) & CORDIC_RYR_RY_MASK)

/*!
 * @brief CORDIC_RZR Register Bit Definition
 */

#define CORDIC_RZR_RZ_SHIFT                     (0)
#define CORDIC_RZR_RZ_MASK                      (0xFFFFFFU << CORDIC_RZR_RZ_SHIFT)
#define CORDIC_RZR_RZ(x)                        (((uint32_t)(((uint32_t)(x)) << CORDIC_RZR_RZ_SHIFT)) & CORDIC_RZR_RZ_MASK)

/*!
 * @brief CORDIC_CR Register Bit Definition
 */

#define CORDIC_CR_ENABLE_SHIFT                  (3)
#define CORDIC_CR_ENABLE_MASK                   (0x1U << CORDIC_CR_ENABLE_SHIFT)
#define CORDIC_CR_ENABLE(x)                     (((uint32_t)(((uint32_t)(x)) << CORDIC_CR_ENABLE_SHIFT)) & CORDIC_CR_ENABLE_MASK)

#define CORDIC_CR_STARTMODE_SHIFT               (2)
#define CORDIC_CR_STARTMODE_MASK                (0x1U << CORDIC_CR_STARTMODE_SHIFT)
#define CORDIC_CR_STARTMODE(x)                  (((uint32_t)(((uint32_t)(x)) << CORDIC_CR_STARTMODE_SHIFT)) & CORDIC_CR_STARTMODE_MASK)

#define CORDIC_CR_WORKMODE_SHIFT                (1)
#define CORDIC_CR_WORKMODE_MASK                 (0x1U << CORDIC_CR_WORKMODE_SHIFT)
#define CORDIC_CR_WORKMODE(x)                   (((uint32_t)(((uint32_t)(x)) << CORDIC_CR_WORKMODE_SHIFT)) & CORDIC_CR_WORKMODE_MASK)

#define CORDIC_CR_START_SHIFT                   (0)
#define CORDIC_CR_START_MASK                    (0x1U << CORDIC_CR_START_SHIFT)
#define CORDIC_CR_START(x)                      (((uint32_t)(((uint32_t)(x)) << CORDIC_CR_START_SHIFT)) & CORDIC_CR_START_MASK)

/*!
 * @brief CORDIC_SR Register Bit Definition
 */

#define CORDIC_SR_BSY_SHIFT                     (0)
#define CORDIC_SR_BSY_MASK                      (0x1U << CORDIC_SR_BSY_SHIFT)
#define CORDIC_SR_BSY(x)                        (((uint32_t)(((uint32_t)(x)) << CORDIC_SR_BSY_SHIFT)) & CORDIC_SR_BSY_MASK)

/*!
 * @}
 */ /* end of group CORDIC_Register_Masks */
/******************************************************************************
 *CORDIC Instance
*******************************************************************************/

#define CORDIC               ((CORDIC_Type*)CORDIC_BASE)

/*!
 * @}
 */ /* end of group CORDIC_Peripheral_Access_Layer */



/*!
 * @addtogroup CRC_Peripheral_Access_Layer CRC Peripheral Access Layer
 *  @{
 */

