AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
/*******************************************************************************
 * CRC Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t DR;                                                           ///< CRC data register                            offset: 0x00
    __IO uint32_t IDR;                                                          ///< CRC independent data register                offset: 0x04
    __IO uint32_t CR;                                                           ///< CRC control register                         offset: 0x08
    __IO uint32_t IVR;                                                          ///< CRC initial value register                   offset: 0x0C
    __IO uint32_t PR;                                                           ///< CRC polynomial register                      offset: 0x10
} CRC_Type;

/*******************************************************************************
 * CRC Type
 ******************************************************************************/

/*!
 * @addtogroup CRC_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief CRC_DR Register Bit Definition
 */

#define CRC_DR_DR_SHIFT                         (0)
#define CRC_DR_DR_MASK                          (0xFFFFFFFFU << CRC_DR_DR_SHIFT)
#define CRC_DR_DR(x)                            (((uint32_t)(((uint32_t)(x)) << CRC_DR_DR_SHIFT)) & CRC_DR_DR_MASK)

/*!
 * @brief CRC_IDR Register Bit Definition
 */

#define CRC_IDR_IDR_SHIFT                       (0)
#define CRC_IDR_IDR_MASK                        (0xFFFFFFFFU << CRC_IDR_IDR_SHIFT)
#define CRC_IDR_IDR(x)                          (((uint32_t)(((uint32_t)(x)) << CRC_IDR_IDR_SHIFT)) & CRC_IDR_IDR_MASK)

/*!
 * @brief CRC_CR Register Bit Definition
 */

#define CRC_CR_PWIDTH_SHIFT                     (14)
#define CRC_CR_PWIDTH_MASK                      (0x3U << CRC_CR_PWIDTH_SHIFT)
#define CRC_CR_PWIDTH(x)                        (((uint32_t)(((uint32_t)(x)) << CRC_CR_PWIDTH_SHIFT)) & CRC_CR_PWIDTH_MASK)

#define CRC_CR_RO_SHIFT                         (6)
#define CRC_CR_RO_MASK                          (0x1U << CRC_CR_RO_SHIFT)
#define CRC_CR_RO(x)                            (((uint32_t)(((uint32_t)(x)) << CRC_CR_RO_SHIFT)) & CRC_CR_RO_MASK)

#define CRC_CR_BEO_SHIFT                        (5)
#define CRC_CR_BEO_MASK                         (0x1U << CRC_CR_BEO_SHIFT)
#define CRC_CR_BEO(x)                           (((uint32_t)(((uint32_t)(x)) << CRC_CR_BEO_SHIFT)) & CRC_CR_BEO_MASK)

#define CRC_CR_BEI_SHIFT                        (4)
#define CRC_CR_BEI_MASK                         (0x1U << CRC_CR_BEI_SHIFT)
#define CRC_CR_BEI(x)                           (((uint32_t)(((uint32_t)(x)) << CRC_CR_BEI_SHIFT)) & CRC_CR_BEI_MASK)

#define CRC_CR_RI_SHIFT                         (1)
#define CRC_CR_RI_MASK                          (0x1U << CRC_CR_RI_SHIFT)
#define CRC_CR_RI(x)                            (((uint32_t)(((uint32_t)(x)) << CRC_CR_RI_SHIFT)) & CRC_CR_RI_MASK)

#define CRC_CR_RST_SHIFT                        (0)
#define CRC_CR_RST_MASK                         (0x1U << CRC_CR_RST_SHIFT)
#define CRC_CR_RST(x)                           (((uint32_t)(((uint32_t)(x)) << CRC_CR_RST_SHIFT)) & CRC_CR_RST_MASK)

/*!
 * @brief CRC_IVR Register Bit Definition
 */

#define CRC_IVR_IVR_SHIFT                       (0)
#define CRC_IVR_IVR_MASK                        (0xFFFFFFFFU << CRC_IVR_IVR_SHIFT)
#define CRC_IVR_IVR(x)                          (((uint32_t)(((uint32_t)(x)) << CRC_IVR_IVR_SHIFT)) & CRC_IVR_IVR_MASK)

/*!
 * @brief CRC_PR Register Bit Definition
 */

#define CRC_PR_PR_SHIFT                         (0)
#define CRC_PR_PR_MASK                          (0xFFFFFFFFU << CRC_PR_PR_SHIFT)
#define CRC_PR_PR(x)                            (((uint32_t)(((uint32_t)(x)) << CRC_PR_PR_SHIFT)) & CRC_PR_PR_MASK)

/*!
 * @}
 */ /* end of group CRC_Register_Masks */
/******************************************************************************
 *CRC Instance
*******************************************************************************/

#define CRC                  ((CRC_Type*)CRC_BASE)

/*!
 * @}
 */ /* end of group CRC_Peripheral_Access_Layer */



/*!
 * @addtogroup CRS_Peripheral_Access_Layer CRS Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * CRS Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CR;                                                           ///< CRS control register                         offset: 0x00
    __IO uint32_t CFGR;                                                         ///< CRS configuration register                   offset: 0x04
    __IO uint32_t ISR;                                                          ///< CRS interrupt status register                offset: 0x08
    __IO uint32_t ICR;                                                          ///< CRS interrupt flag clear register            offset: 0x0C
} CRS_Type;

/*******************************************************************************
 * CRS Type
 ******************************************************************************/

/*!
 * @addtogroup CRS_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief CRS_CR Register Bit Definition
 */

#define CRS_CR_TRIM_SHIFT                       (8)
#define CRS_CR_TRIM_MASK                        (0x3FFU << CRS_CR_TRIM_SHIFT)
#define CRS_CR_TRIM(x)                          (((uint32_t)(((uint32_t)(x)) << CRS_CR_TRIM_SHIFT)) & CRS_CR_TRIM_MASK)

#define CRS_CR_SWSYNC_SHIFT                     (7)
#define CRS_CR_SWSYNC_MASK                      (0x1U << CRS_CR_SWSYNC_SHIFT)
#define CRS_CR_SWSYNC(x)                        (((uint32_t)(((uint32_t)(x)) << CRS_CR_SWSYNC_SHIFT)) & CRS_CR_SWSYNC_MASK)

#define CRS_CR_AUTOTRIMEN_SHIFT                 (6)
#define CRS_CR_AUTOTRIMEN_MASK                  (0x1U << CRS_CR_AUTOTRIMEN_SHIFT)
#define CRS_CR_AUTOTRIMEN(x)                    (((uint32_t)(((uint32_t)(x)) << CRS_CR_AUTOTRIMEN_SHIFT)) & CRS_CR_AUTOTRIMEN_MASK)

