AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define DBGMCU_CR_DBGTIM6STOP_SHIFT             (19)
#define DBGMCU_CR_DBGTIM6STOP_MASK              (0x1U << DBGMCU_CR_DBGTIM6STOP_SHIFT)
#define DBGMCU_CR_DBGTIM6STOP(x)                (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGTIM6STOP_SHIFT)) & DBGMCU_CR_DBGTIM6STOP_MASK)

#define DBGMCU_CR_DBGTIM5STOP_SHIFT             (18)
#define DBGMCU_CR_DBGTIM5STOP_MASK              (0x1U << DBGMCU_CR_DBGTIM5STOP_SHIFT)
#define DBGMCU_CR_DBGTIM5STOP(x)                (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGTIM5STOP_SHIFT)) & DBGMCU_CR_DBGTIM5STOP_MASK)

#define DBGMCU_CR_DBGTIM8STOP_SHIFT             (17)
#define DBGMCU_CR_DBGTIM8STOP_MASK              (0x1U << DBGMCU_CR_DBGTIM8STOP_SHIFT)
#define DBGMCU_CR_DBGTIM8STOP(x)                (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGTIM8STOP_SHIFT)) & DBGMCU_CR_DBGTIM8STOP_MASK)

#define DBGMCU_CR_DBGTIM4STOP_SHIFT             (13)
#define DBGMCU_CR_DBGTIM4STOP_MASK              (0x1U << DBGMCU_CR_DBGTIM4STOP_SHIFT)
#define DBGMCU_CR_DBGTIM4STOP(x)                (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGTIM4STOP_SHIFT)) & DBGMCU_CR_DBGTIM4STOP_MASK)

#define DBGMCU_CR_DBGTIM3STOP_SHIFT             (12)
#define DBGMCU_CR_DBGTIM3STOP_MASK              (0x1U << DBGMCU_CR_DBGTIM3STOP_SHIFT)
#define DBGMCU_CR_DBGTIM3STOP(x)                (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGTIM3STOP_SHIFT)) & DBGMCU_CR_DBGTIM3STOP_MASK)

#define DBGMCU_CR_DBGTIM2STOP_SHIFT             (11)
#define DBGMCU_CR_DBGTIM2STOP_MASK              (0x1U << DBGMCU_CR_DBGTIM2STOP_SHIFT)
#define DBGMCU_CR_DBGTIM2STOP(x)                (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGTIM2STOP_SHIFT)) & DBGMCU_CR_DBGTIM2STOP_MASK)

#define DBGMCU_CR_DBGTIM1STOP_SHIFT             (10)
#define DBGMCU_CR_DBGTIM1STOP_MASK              (0x1U << DBGMCU_CR_DBGTIM1STOP_SHIFT)
#define DBGMCU_CR_DBGTIM1STOP(x)                (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGTIM1STOP_SHIFT)) & DBGMCU_CR_DBGTIM1STOP_MASK)

#define DBGMCU_CR_DBGWWDGSTOP_SHIFT             (9)
#define DBGMCU_CR_DBGWWDGSTOP_MASK              (0x1U << DBGMCU_CR_DBGWWDGSTOP_SHIFT)
#define DBGMCU_CR_DBGWWDGSTOP(x)                (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGWWDGSTOP_SHIFT)) & DBGMCU_CR_DBGWWDGSTOP_MASK)

#define DBGMCU_CR_DBGIWDGSTOP_SHIFT             (8)
#define DBGMCU_CR_DBGIWDGSTOP_MASK              (0x1U << DBGMCU_CR_DBGIWDGSTOP_SHIFT)
#define DBGMCU_CR_DBGIWDGSTOP(x)                (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGIWDGSTOP_SHIFT)) & DBGMCU_CR_DBGIWDGSTOP_MASK)

#define DBGMCU_CR_TRACEIOE_SHIFT                (5)
#define DBGMCU_CR_TRACEIOE_MASK                 (0x1U << DBGMCU_CR_TRACEIOE_SHIFT)
#define DBGMCU_CR_TRACEIOE(x)                   (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_TRACEIOE_SHIFT)) & DBGMCU_CR_TRACEIOE_MASK)

#define DBGMCU_CR_DBGSTOPFORLDO_SHIFT           (3)
#define DBGMCU_CR_DBGSTOPFORLDO_MASK            (0x1U << DBGMCU_CR_DBGSTOPFORLDO_SHIFT)
#define DBGMCU_CR_DBGSTOPFORLDO(x)              (((uint32_t)(((uint32_t)(x)) << DBGMCU_CR_DBGSTOPFORLDO_SHIFT)) & DBGMCU_CR_DBGSTOPFORLDO_MASK)

/*!
 * @}
 */ /* end of group DBGMCU_Register_Masks */
/******************************************************************************
 *DBGMCU Instance
*******************************************************************************/

#define DBGMCU               ((DBGMCU_Type*)DBGMCU_BASE)

/*!
 * @}
 */ /* end of group DBGMCU_Peripheral_Access_Layer */



/*!
 * @addtogroup DMA_Peripheral_Access_Layer DMA Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * DMA Type
 ******************************************************************************/
#define DMA_CHANNEL_COUNT  8u

typedef struct {
    __IO uint32_t ISR;                                                            ///< DMA Interrupt Status Register                offset: 0x00
    __IO uint32_t IFCR;                                                           ///< DMA Interrupt Flag Clear Register            offset: 0x04
    struct {
            __IO uint32_t CCR;                                                    ///< DMAchannelxconfigurationregister             offset: 0x08
            __IO uint32_t CNDTR;                                                  ///< DMAchannelxtransferquantityregister          offset: 0x0C
            __IO uint32_t CPAR;                                                   ///< DMAchannelxperipheraladdressregister         offset: 0x10
            __IO uint32_t CMAR;                                                   ///< DMAchannelxmemoryaddressregister             offset: 0x14
            __IO uint32_t Reserved0;
    } CH[DMA_CHANNEL_COUNT];
} DMA_Type;

/*******************************************************************************
 * DMA Type
 ******************************************************************************/

/*!
 * @addtogroup DMA_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief DMA_ISR Register Bit Definition
 */

#define DMA_ISR_TEIF8_SHIFT                     (31)
#define DMA_ISR_TEIF8_MASK                      (0x1U << DMA_ISR_TEIF8_SHIFT)
#define DMA_ISR_TEIF8(x)                        (((uint32_t)(((uint32_t)(x)) << DMA_ISR_TEIF8_SHIFT)) & DMA_ISR_TEIF8_MASK)

#define DMA_ISR_HTIF8_SHIFT                     (30)
#define DMA_ISR_HTIF8_MASK                      (0x1U << DMA_ISR_HTIF8_SHIFT)
#define DMA_ISR_HTIF8(x)                        (((uint32_t)(((uint32_t)(x)) << DMA_ISR_HTIF8_SHIFT)) & DMA_ISR_HTIF8_MASK)

#define DMA_ISR_TCIF8_SHIFT                     (29)
#define DMA_ISR_TCIF8_MASK                      (0x1U << DMA_ISR_TCIF8_SHIFT)
#define DMA_ISR_TCIF8(x)                        (((uint32_t)(((uint32_t)(x)) << DMA_ISR_TCIF8_SHIFT)) & DMA_ISR_TCIF8_MASK)

#define DMA_ISR_GIF8_SHIFT                      (28)
#define DMA_ISR_GIF8_MASK                       (0x1U << DMA_ISR_GIF8_SHIFT)
#define DMA_ISR_GIF8(x)                         (((uint32_t)(((uint32_t)(x)) << DMA_ISR_GIF8_SHIFT)) & DMA_ISR_GIF8_MASK)

#define DMA_ISR_TEIF7_SHIFT                     (27)
#define DMA_ISR_TEIF7_MASK                      (0x1U << DMA_ISR_TEIF7_SHIFT)
#define DMA_ISR_TEIF7(x)                        (((uint32_t)(((uint32_t)(x)) << DMA_ISR_TEIF7_SHIFT)) & DMA_ISR_TEIF7_MASK)

