AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define DMA1                 ((DMA_Type*)DMA1_BASE)

#define DMA2                 ((DMA_Type*)DMA2_BASE)

/*!
 * @}
 */ /* end of group DMA_Peripheral_Access_Layer */



/*!
 * @addtogroup EXTI_Peripheral_Access_Layer EXTI Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * EXTI Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t IMR;                                                          ///< Interrupt mask register                      offset: 0x00
    __IO uint32_t EMR;                                                          ///< Event mask register                          offset: 0x04
    __IO uint32_t RTSR;                                                         ///< Rising edge trigger selection register       offset: 0x08
    __IO uint32_t FTSR;                                                         ///< Falling edge trigger selection register      offset: 0x0C
    __IO uint32_t SWIER;                                                        ///< Software interrupt event register            offset: 0x10
    __IO uint32_t PR;                                                           ///< Pending register                             offset: 0x14
} EXTI_Type;

/*******************************************************************************
 * EXTI Type
 ******************************************************************************/

/*!
 * @addtogroup EXTI_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief EXTI_IMR Register Bit Definition
 */

#define EXTI_IMR_IMR_SHIFT                      (0)
#define EXTI_IMR_IMR_MASK                       (0xFFFFFFFFU << EXTI_IMR_IMR_SHIFT)
#define EXTI_IMR_IMR(x)                         (((uint32_t)(((uint32_t)(x)) << EXTI_IMR_IMR_SHIFT)) & EXTI_IMR_IMR_MASK)

/*!
 * @brief EXTI_EMR Register Bit Definition
 */

#define EXTI_EMR_IMR_SHIFT                      (0)
#define EXTI_EMR_IMR_MASK                       (0xFFFFFFFFU << EXTI_EMR_IMR_SHIFT)
#define EXTI_EMR_IMR(x)                         (((uint32_t)(((uint32_t)(x)) << EXTI_EMR_IMR_SHIFT)) & EXTI_EMR_IMR_MASK)

/*!
 * @brief EXTI_RTSR Register Bit Definition
 */

#define EXTI_RTSR_TR_SHIFT                      (0)
#define EXTI_RTSR_TR_MASK                       (0xFFFFFFFFU << EXTI_RTSR_TR_SHIFT)
#define EXTI_RTSR_TR(x)                         (((uint32_t)(((uint32_t)(x)) << EXTI_RTSR_TR_SHIFT)) & EXTI_RTSR_TR_MASK)

/*!
 * @brief EXTI_FTSR Register Bit Definition
 */

#define EXTI_FTSR_TR_SHIFT                      (0)
#define EXTI_FTSR_TR_MASK                       (0xFFFFFFFFU << EXTI_FTSR_TR_SHIFT)
#define EXTI_FTSR_TR(x)                         (((uint32_t)(((uint32_t)(x)) << EXTI_FTSR_TR_SHIFT)) & EXTI_FTSR_TR_MASK)

/*!
 * @brief EXTI_SWIER Register Bit Definition
 */

#define EXTI_SWIER_SWIERX_SHIFT                 (0)
#define EXTI_SWIER_SWIERX_MASK                  (0xFFFFFFFFU << EXTI_SWIER_SWIERX_SHIFT)
#define EXTI_SWIER_SWIERX(x)                    (((uint32_t)(((uint32_t)(x)) << EXTI_SWIER_SWIERX_SHIFT)) & EXTI_SWIER_SWIERX_MASK)

/*!
 * @brief EXTI_PR Register Bit Definition
 */

#define EXTI_PR_PRX_SHIFT                       (0)
#define EXTI_PR_PRX_MASK                        (0xFFFFFFFFU << EXTI_PR_PRX_SHIFT)
#define EXTI_PR_PRX(x)                          (((uint32_t)(((uint32_t)(x)) << EXTI_PR_PRX_SHIFT)) & EXTI_PR_PRX_MASK)

/*!
 * @}
 */ /* end of group EXTI_Register_Masks */
/******************************************************************************
 *EXTI Instance
*******************************************************************************/

#define EXTI                 ((EXTI_Type*)EXTI_BASE)

/*!
 * @}
 */ /* end of group EXTI_Peripheral_Access_Layer */



/*!
 * @addtogroup FLASH_Peripheral_Access_Layer FLASH Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * FLASH Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t ACR;                                                          ///< Flash access control register                offset: 0x00
    __IO uint32_t KEYR;                                                         ///< FPEC key register                            offset: 0x04
    __IO uint32_t OPTKEYR;                                                      ///< Flash OPTKEY register                        offset: 0x08
    __IO uint32_t SR;                                                           ///< Flash status register                        offset: 0x0C
    __IO uint32_t CR;                                                           ///< Flash control register                       offset: 0x10
    __IO uint32_t AR;                                                           ///< Flash address register                       offset: 0x14
    __IO uint32_t Reserved0[1];                                                 ///< Reserved
    __IO uint32_t OBR;                                                          ///< Option byte register                         offset: 0x1C
    __IO uint32_t WRPR;                                                         ///< Write protection register                    offset: 0x20
    __IO uint32_t Reserved1[71];                                                ///< Reserved
    __IO uint32_t ECCCR;                                                        ///< ECC control register                         offset: 0x140
    __IO uint32_t ECCPR;                                                        ///< ECC protection register                      offset: 0x144
    __IO uint32_t ECCEER;                                                       ///< ECC event enable register                    offset: 0x148
    __IO uint32_t ECCSR;                                                        ///< ECC status register                          offset: 0x14C
    __IO uint32_t ECCADDRR;                                                     ///< ECC error address register                   offset: 0x150
    __IO uint32_t ECCSYNR;                                                      ///< ECC error check subregister                  offset: 0x154
    __IO uint32_t ECCDLR;                                                       ///< ECC error data low bit register              offset: 0x158
    __IO uint32_t ECCDHR;                                                       ///< ECC error data high bit register             offset: 0x15C
} FLASH_Type;

