AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define FLASH_OBR_NRSTSTDBY_SHIFT               (4)
#define FLASH_OBR_NRSTSTDBY_MASK                (0x1U << FLASH_OBR_NRSTSTDBY_SHIFT)
#define FLASH_OBR_NRSTSTDBY(x)                  (((uint32_t)(((uint32_t)(x)) << FLASH_OBR_NRSTSTDBY_SHIFT)) & FLASH_OBR_NRSTSTDBY_MASK)

#define FLASH_OBR_NRSTSTOP_SHIFT                (3)
#define FLASH_OBR_NRSTSTOP_MASK                 (0x1U << FLASH_OBR_NRSTSTOP_SHIFT)
#define FLASH_OBR_NRSTSTOP(x)                   (((uint32_t)(((uint32_t)(x)) << FLASH_OBR_NRSTSTOP_SHIFT)) & FLASH_OBR_NRSTSTOP_MASK)

#define FLASH_OBR_WDGSW_SHIFT                   (2)
#define FLASH_OBR_WDGSW_MASK                    (0x1U << FLASH_OBR_WDGSW_SHIFT)
#define FLASH_OBR_WDGSW(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_OBR_WDGSW_SHIFT)) & FLASH_OBR_WDGSW_MASK)

#define FLASH_OBR_OPTERR_SHIFT                  (0)
#define FLASH_OBR_OPTERR_MASK                   (0x1U << FLASH_OBR_OPTERR_SHIFT)
#define FLASH_OBR_OPTERR(x)                     (((uint32_t)(((uint32_t)(x)) << FLASH_OBR_OPTERR_SHIFT)) & FLASH_OBR_OPTERR_MASK)

/*!
 * @brief FLASH_WRPR Register Bit Definition
 */

#define FLASH_WRPR_WRP_SHIFT                    (0)
#define FLASH_WRPR_WRP_MASK                     (0xFFFFFFFFU << FLASH_WRPR_WRP_SHIFT)
#define FLASH_WRPR_WRP(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_WRPR_WRP_SHIFT)) & FLASH_WRPR_WRP_MASK)

/*!
 * @brief FLASH_ECC_CR Register Bit Definition
 */

#define FLASH_ECCCR_RERR_SHIFT                  (1)
#define FLASH_ECCCR_RERR_MASK                   (0x1U << FLASH_ECCCR_RERR_SHIFT)
#define FLASH_ECCCR_RERR(x)                     (((uint32_t)(((uint32_t)(x)) << FLASH_ECCCR_RERR_SHIFT)) & FLASH_ECCCR_RERR_MASK)

/*!
 * @brief FLASH_ECC_PR Register Bit Definition
 */

#define FLASH_ECCPR_PRC_SHIFT                   (0)
#define FLASH_ECCPR_PRC_MASK                    (0x1U << FLASH_ECCPR_PRC_SHIFT)
#define FLASH_ECCPR_PRC(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_ECCPR_PRC_SHIFT)) & FLASH_ECCPR_PRC_MASK)

/*!
 * @brief FLASH_ECC_EER Register Bit Definition
 */

#define FLASH_ECCEER_2BITIE_SHIFT               (1)
#define FLASH_ECCEER_2BITIE_MASK                (0x1U << FLASH_ECCEER_2BITIE_SHIFT)
#define FLASH_ECCEER_2BITIE(x)                  (((uint32_t)(((uint32_t)(x)) << FLASH_ECCEER_2BITIE_SHIFT)) & FLASH_ECCEER_2BITIE_MASK)

#define FLASH_ECCEER_1BITIE_SHIFT               (0)
#define FLASH_ECCEER_1BITIE_MASK                (0x1U << FLASH_ECCEER_1BITIE_SHIFT)
#define FLASH_ECCEER_1BITIE(x)                  (((uint32_t)(((uint32_t)(x)) << FLASH_ECCEER_1BITIE_SHIFT)) & FLASH_ECCEER_1BITIE_MASK)

/*!
 * @brief FLASH_ECC_SR Register Bit Definition
 */

#define FLASH_ECCSR_2BITF_SHIFT                 (1)
#define FLASH_ECCSR_2BITF_MASK                  (0x1U << FLASH_ECCSR_2BITF_SHIFT)
#define FLASH_ECCSR_2BITF(x)                    (((uint32_t)(((uint32_t)(x)) << FLASH_ECCSR_2BITF_SHIFT)) & FLASH_ECCSR_2BITF_MASK)

#define FLASH_ECCSR_1BITF_SHIFT                 (0)
#define FLASH_ECCSR_1BITF_MASK                  (0x1U << FLASH_ECCSR_1BITF_SHIFT)
#define FLASH_ECCSR_1BITF(x)                    (((uint32_t)(((uint32_t)(x)) << FLASH_ECCSR_1BITF_SHIFT)) & FLASH_ECCSR_1BITF_MASK)

/*!
 * @brief FLASH_ECC_ADDRR Register Bit Definition
 */

#define FLASH_ECCADDRR_ADDR_SHIFT               (0)
#define FLASH_ECCADDRR_ADDR_MASK                (0xFFFFFFFFU << FLASH_ECCADDRR_ADDR_SHIFT)
#define FLASH_ECCADDRR_ADDR(x)                  (((uint32_t)(((uint32_t)(x)) << FLASH_ECCADDRR_ADDR_SHIFT)) & FLASH_ECCADDRR_ADDR_MASK)

/*!
 * @brief FLASH_ECC_SYNR Register Bit Definition
 */

#define FLASH_ECCSYNR_SYN_SHIFT                 (0)
#define FLASH_ECCSYNR_SYN_MASK                  (0xFFU << FLASH_ECCSYNR_SYN_SHIFT)
#define FLASH_ECCSYNR_SYN(x)                    (((uint32_t)(((uint32_t)(x)) << FLASH_ECCSYNR_SYN_SHIFT)) & FLASH_ECCSYNR_SYN_MASK)

/*!
 * @brief FLASH_ECC_DLR Register Bit Definition
 */

#define FLASH_ECCDLR_DATAL_SHIFT                (0)
#define FLASH_ECCDLR_DATAL_MASK                 (0xFFFFFFFFU << FLASH_ECCDLR_DATAL_SHIFT)
#define FLASH_ECCDLR_DATAL(x)                   (((uint32_t)(((uint32_t)(x)) << FLASH_ECCDLR_DATAL_SHIFT)) & FLASH_ECCDLR_DATAL_MASK)

/*!
 * @brief FLASH_ECC_DHR Register Bit Definition
 */

#define FLASH_ECCDHR_DATAH_SHIFT                (0)
#define FLASH_ECCDHR_DATAH_MASK                 (0xFFFFFFFFU << FLASH_ECCDHR_DATAH_SHIFT)
#define FLASH_ECCDHR_DATAH(x)                   (((uint32_t)(((uint32_t)(x)) << FLASH_ECCDHR_DATAH_SHIFT)) & FLASH_ECCDHR_DATAH_MASK)

/*!
 * @}
 */ /* end of group FLASH_Register_Masks */
/******************************************************************************
 *FLASH Instance
*******************************************************************************/

#define FLASH                ((FLASH_Type*)FLASH_BASE)

/*!
 * @}
 */ /* end of group FLASH_Peripheral_Access_Layer */



/*!
 * @addtogroup FLEXCAN_Peripheral_Access_Layer FLEXCAN Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * FLEXCAN Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t MCR;                                                          ///< Module Configuration Register                offset: 0x00
    __IO uint32_t CTRL1;                                                        ///< Control Register 1                           offset: 0x04
    __IO uint32_t TIMER;                                                        ///< Free Running Timer Register                  offset: 0x08
    __IO uint32_t Reserved0[1];                                                 ///< Reserved
    __IO uint32_t RXMGMASK;                                                     ///< Rx Mailboxes Global Mask Register            offset: 0x10
    __IO uint32_t RX14MASK;                                                     ///< Rx 14 Mask Register                          offset: 0x14
    __IO uint32_t RX15MASK;                                                     ///< Rx 15 Mask Register                          offset: 0x18
    __IO uint32_t ECR;                                                          ///< Error Counter Register                       offset: 0x1C
    __IO uint32_t ESR1;                                                         ///< Error and Status Register 1                  offset: 0x20
    __IO uint32_t Reserved1[1];                                                 ///< Reserved
    __IO uint32_t IMASK1;                                                       ///< Interrupt Mask Register 1                    offset: 0x28
    __IO uint32_t Reserved2[1];                                                 ///< Reserved
    __IO uint32_t IFLAG1;                                                       ///< Interrupt Flag Register 1                    offset: 0x30
    __IO uint32_t CTRL2;                                                        ///< Control Register 2                           offset: 0x34
    __IO uint32_t ESR2;                                                         ///< Error and Status Register 2                  offset: 0x38
    __IO uint32_t Reserved3[2];                                                 ///< Reserved
    __IO uint32_t CRCR;                                                         ///< CRC Register                                 offset: 0x44
    __IO uint32_t RXFGMASK;                                                     ///< Rx FIFO Global Mask Register                 offset: 0x48
    __IO uint32_t RXFIR;                                                       ///< FIFO Information Register                    offset: 0x4C
    __IO uint32_t CBT;                                                          ///< CAN Bit Timing Register                      offset: 0x50
    __IO uint32_t Reserved4[11];                                                  ///< Reserved
    struct {
        __IO uint32_t CS ;                                                        ///<  Legacy Message Buffer 0 CS Register       offset: 0x80
        __IO uint32_t ID;                                                         ///<  Legacy Message Buffer 0 ID Register       offset: 0x84
        __IO uint32_t WORD0;                                                      ///<  Legacy Message Buffer 0 WORD0 Register    offset: 0x88
        __IO uint32_t WORD1;                                                      ///<  Legacy Message Buffer 0 WORD1 Register    offset: 0x8C
    } MB[32];
    __IO uint32_t Reserved5[384];                                               ///< Reserved
    __IO uint32_t RXIMRN[32];                                                    ///< Rx Individual Mask Registers (n = 0~31)      offset: 0x880
    __IO uint32_t Reserved6[192];                                               ///< Reserved
    __IO uint32_t FDCTRL;                                                       ///< CAN FD Control Register                      offset: 0xC00
    __IO uint32_t FDCBT;                                                        ///< CAN FD Bit Timing Register                   offset: 0xC04
    __IO uint32_t FDCRC;                                                        ///< CAN FD CRC Register                          offset: 0xC08
    __IO uint32_t ERFCR;                                                        ///< Enhanced Rx FIFO Control Register            offset: 0xC0C
    __IO uint32_t ERFIER;                                                       ///< Enhanced Rx FIFO Interrupt Enable Register   offset: 0xC10
    __IO uint32_t ERFSR;                                                        ///< Enhanced Rx FIFO Status Register             offset: 0xC14
    __IO uint32_t Reserved7[1274];                                              ///< Reserved
    struct {
        __IO uint32_t ERFCS ;                                                   ///<  Enhanced Rx FIFO Buffer 0 CS Register       offset: 0x2000
        __IO uint32_t ERFDID;                                                   ///<  Enhanced Rx FIFO Buffer 0 ID Register       offset: 0x2004
        __IO uint32_t ERFDWORD[16];                                             ///<  Enhanced Rx FIFO Buffer 0 WORD Register     offset: 0x2008
        __IO uint32_t IHOFF;                                                    ///<  Identifier receive filter hit indication    offset: 0x2048
        __IO uint32_t Reserved8;
    }ERFMB[6];
    __IO uint32_t Reserved9[904];                                               ///< Reserved
    __IO uint32_t ERFFEL[2];                                                    ///< Enhanced Rx FIFO Filter Element Registers (n=0 ~ 1)offset: 0x3000
} FLEXCAN_Type;

