AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
/*******************************************************************************
 * FLEXCAN Type
 ******************************************************************************/

/*!
 * @addtogroup FLEXCAN_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief FLEXCAN_MCR Register Bit Definition
 */

#define FLEXCAN_MCR_MDIS_SHIFT                  (31)
#define FLEXCAN_MCR_MDIS_MASK                   (0x1U << FLEXCAN_MCR_MDIS_SHIFT)
#define FLEXCAN_MCR_MDIS(x)                     (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_MDIS_SHIFT)) & FLEXCAN_MCR_MDIS_MASK)

#define FLEXCAN_MCR_FRZ_SHIFT                   (30)
#define FLEXCAN_MCR_FRZ_MASK                    (0x1U << FLEXCAN_MCR_FRZ_SHIFT)
#define FLEXCAN_MCR_FRZ(x)                      (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_FRZ_SHIFT)) & FLEXCAN_MCR_FRZ_MASK)

#define FLEXCAN_MCR_RFEN_SHIFT                  (29)
#define FLEXCAN_MCR_RFEN_MASK                   (0x1U << FLEXCAN_MCR_RFEN_SHIFT)
#define FLEXCAN_MCR_RFEN(x)                     (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_RFEN_SHIFT)) & FLEXCAN_MCR_RFEN_MASK)

#define FLEXCAN_MCR_HALT_SHIFT                  (28)
#define FLEXCAN_MCR_HALT_MASK                   (0x1U << FLEXCAN_MCR_HALT_SHIFT)
#define FLEXCAN_MCR_HALT(x)                     (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_HALT_SHIFT)) & FLEXCAN_MCR_HALT_MASK)

#define FLEXCAN_MCR_NOTRDY_SHIFT                (27)
#define FLEXCAN_MCR_NOTRDY_MASK                 (0x1U << FLEXCAN_MCR_NOTRDY_SHIFT)
#define FLEXCAN_MCR_NOTRDY(x)                   (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_NOTRDY_SHIFT)) & FLEXCAN_MCR_NOTRDY_MASK)

#define FLEXCAN_MCR_SOFTRST_SHIFT               (25)
#define FLEXCAN_MCR_SOFTRST_MASK                (0x1U << FLEXCAN_MCR_SOFTRST_SHIFT)
#define FLEXCAN_MCR_SOFTRST(x)                  (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_SOFTRST_SHIFT)) & FLEXCAN_MCR_SOFTRST_MASK)

#define FLEXCAN_MCR_FRZACK_SHIFT                (24)
#define FLEXCAN_MCR_FRZACK_MASK                 (0x1U << FLEXCAN_MCR_FRZACK_SHIFT)
#define FLEXCAN_MCR_FRZACK(x)                   (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_FRZACK_SHIFT)) & FLEXCAN_MCR_FRZACK_MASK)

#define FLEXCAN_MCR_SUPV_SHIFT                  (23)
#define FLEXCAN_MCR_SUPV_MASK                   (0x1U << FLEXCAN_MCR_SUPV_SHIFT)
#define FLEXCAN_MCR_SUPV(x)                     (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_SUPV_SHIFT)) & FLEXCAN_MCR_SUPV_MASK)

#define FLEXCAN_MCR_SLFWAK_SHIFT                (22)
#define FLEXCAN_MCR_SLFWAK_MASK                 (0x01U << FLEXCAN_MCR_SLFWAK_SHIFT)
#define FLEXCAN_MCR_SLFWAK(x)                   (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_SLFWAK_SHIFT)) & FLEXCAN_MCR_SLFWAK_MASK)

#define FLEXCAN_MCR_WRNEN_SHIFT                 (21)
#define FLEXCAN_MCR_WRNEN_MASK                  (0x1U << FLEXCAN_MCR_WRNEN_SHIFT)
#define FLEXCAN_MCR_WRNEN(x)                    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_WRNEN_SHIFT)) & FLEXCAN_MCR_WRNEN_MASK)

#define FLEXCAN_MCR_LPMACK_SHIFT                (20)
#define FLEXCAN_MCR_LPMACK_MASK                 (0x1U << FLEXCAN_MCR_LPMACK_SHIFT)
#define FLEXCAN_MCR_LPMACK(x)                   (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_LPMACK_SHIFT)) & FLEXCAN_MCR_LPMACK_MASK)

#define FLEXCAN_MCR_WAKSRC_SHIFT                (19)
#define FLEXCAN_MCR_WAKSRC_MASK                 (0x01U << FLEXCAN_MCR_WAKSRC_SHIFT)
#define FLEXCAN_MCR_WAKSRC(x)                   (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_WAKSRC_SHIFT)) & FLEXCAN_MCR_WAKSRC_MASK)

#define FLEXCAN_MCR_SRXDIS_SHIFT                (17)
#define FLEXCAN_MCR_SRXDIS_MASK                 (0x1U << FLEXCAN_MCR_SRXDIS_SHIFT)
#define FLEXCAN_MCR_SRXDIS(x)                   (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_SRXDIS_SHIFT)) & FLEXCAN_MCR_SRXDIS_MASK)

#define FLEXCAN_MCR_IRMQ_SHIFT                  (16)
#define FLEXCAN_MCR_IRMQ_MASK                   (0x1U << FLEXCAN_MCR_IRMQ_SHIFT)
#define FLEXCAN_MCR_IRMQ(x)                     (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_IRMQ_SHIFT)) & FLEXCAN_MCR_IRMQ_MASK)

#define FLEXCAN_MCR_DMA_SHIFT                   (15)
#define FLEXCAN_MCR_DMA_MASK                    (0x1U << FLEXCAN_MCR_DMA_SHIFT)
#define FLEXCAN_MCR_DMA(x)                      (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_DMA_SHIFT)) & FLEXCAN_MCR_DMA_MASK)

#define FLEXCAN_MCR_LPRIOEN_SHIFT               (13)
#define FLEXCAN_MCR_LPRIOEN_MASK                (0x1U << FLEXCAN_MCR_LPRIOEN_SHIFT)
#define FLEXCAN_MCR_LPRIOEN(x)                  (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_LPRIOEN_SHIFT)) & FLEXCAN_MCR_LPRIOEN_MASK)

#define FLEXCAN_MCR_AEN_SHIFT                   (12)
#define FLEXCAN_MCR_AEN_MASK                    (0x1U << FLEXCAN_MCR_AEN_SHIFT)
#define FLEXCAN_MCR_AEN(x)                      (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_AEN_SHIFT)) & FLEXCAN_MCR_AEN_MASK)

#define FLEXCAN_MCR_FDEN_SHIFT                  (11)
#define FLEXCAN_MCR_FDEN_MASK                   (0x1U << FLEXCAN_MCR_FDEN_SHIFT)
#define FLEXCAN_MCR_FDEN(x)                     (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_FDEN_SHIFT)) & FLEXCAN_MCR_FDEN_MASK)

#define FLEXCAN_MCR_IDAM_SHIFT                  (8)
#define FLEXCAN_MCR_IDAM_MASK                   (0x3U << FLEXCAN_MCR_IDAM_SHIFT)
#define FLEXCAN_MCR_IDAM(x)                     (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_IDAM_SHIFT)) & FLEXCAN_MCR_IDAM_MASK)

#define FLEXCAN_MCR_MAXMB_SHIFT                 (0)
#define FLEXCAN_MCR_MAXMB_MASK                  (0x7FU << FLEXCAN_MCR_MAXMB_SHIFT)
#define FLEXCAN_MCR_MAXMB(x)                    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_MAXMB_SHIFT)) & FLEXCAN_MCR_MAXMB_MASK)

/*!
 * @brief FLEXCAN_CTRL1 Register Bit Definition
 */

#define FLEXCAN_CTRL1_PRESDIV_SHIFT             (24)
#define FLEXCAN_CTRL1_PRESDIV_MASK              (0xFFU << FLEXCAN_CTRL1_PRESDIV_SHIFT)
#define FLEXCAN_CTRL1_PRESDIV(x)                (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_PRESDIV_SHIFT)) & FLEXCAN_CTRL1_PRESDIV_MASK)

#define FLEXCAN_CTRL1_RJW_SHIFT                 (22)
#define FLEXCAN_CTRL1_RJW_MASK                  (0x3U << FLEXCAN_CTRL1_RJW_SHIFT)
#define FLEXCAN_CTRL1_RJW(x)                    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_RJW_SHIFT)) & FLEXCAN_CTRL1_RJW_MASK)

#define FLEXCAN_CTRL1_PSEG1_SHIFT               (19)
#define FLEXCAN_CTRL1_PSEG1_MASK                (0x7U << FLEXCAN_CTRL1_PSEG1_SHIFT)
#define FLEXCAN_CTRL1_PSEG1(x)                  (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_PSEG1_SHIFT)) & FLEXCAN_CTRL1_PSEG1_MASK)

#define FLEXCAN_CTRL1_PSEG2_SHIFT               (16)
#define FLEXCAN_CTRL1_PSEG2_MASK                (0x7U << FLEXCAN_CTRL1_PSEG2_SHIFT)
#define FLEXCAN_CTRL1_PSEG2(x)                  (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_PSEG2_SHIFT)) & FLEXCAN_CTRL1_PSEG2_MASK)

#define FLEXCAN_CTRL1_BOFFMSK_SHIFT             (15)
#define FLEXCAN_CTRL1_BOFFMSK_MASK              (0x1U << FLEXCAN_CTRL1_BOFFMSK_SHIFT)
#define FLEXCAN_CTRL1_BOFFMSK(x)                (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_BOFFMSK_SHIFT)) & FLEXCAN_CTRL1_BOFFMSK_MASK)

