AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define FLEXCAN_CTRL1_ERRMSK_SHIFT              (14)
#define FLEXCAN_CTRL1_ERRMSK_MASK               (0x1U << FLEXCAN_CTRL1_ERRMSK_SHIFT)
#define FLEXCAN_CTRL1_ERRMSK(x)                 (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_ERRMSK_SHIFT)) & FLEXCAN_CTRL1_ERRMSK_MASK)

#define FLEXCAN_CTRL1_CLKSRC_SHIFT              (13)
#define FLEXCAN_CTRL1_CLKSRC_MASK               (0x1U << FLEXCAN_CTRL1_CLKSRC_SHIFT)
#define FLEXCAN_CTRL1_CLKSRC(x)                 (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_CLKSRC_SHIFT)) & FLEXCAN_CTRL1_CLKSRC_MASK)

#define FLEXCAN_CTRL1_LPB_SHIFT                 (12)
#define FLEXCAN_CTRL1_LPB_MASK                  (0x1U << FLEXCAN_CTRL1_LPB_SHIFT)
#define FLEXCAN_CTRL1_LPB(x)                    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_LPB_SHIFT)) & FLEXCAN_CTRL1_LPB_MASK)

#define FLEXCAN_CTRL1_TWRNMSK_SHIFT             (11)
#define FLEXCAN_CTRL1_TWRNMSK_MASK              (0x1U << FLEXCAN_CTRL1_TWRNMSK_SHIFT)
#define FLEXCAN_CTRL1_TWRNMSK(x)                (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_TWRNMSK_SHIFT)) & FLEXCAN_CTRL1_TWRNMSK_MASK)

#define FLEXCAN_CTRL1_RWRNMSK_SHIFT             (10)
#define FLEXCAN_CTRL1_RWRNMSK_MASK              (0x1U << FLEXCAN_CTRL1_RWRNMSK_SHIFT)
#define FLEXCAN_CTRL1_RWRNMSK(x)                (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_RWRNMSK_SHIFT)) & FLEXCAN_CTRL1_RWRNMSK_MASK)

#define FLEXCAN_CTRL1_SMP_SHIFT                 (7)
#define FLEXCAN_CTRL1_SMP_MASK                  (0x1U << FLEXCAN_CTRL1_SMP_SHIFT)
#define FLEXCAN_CTRL1_SMP(x)                    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_SMP_SHIFT)) & FLEXCAN_CTRL1_SMP_MASK)

#define FLEXCAN_CTRL1_BOFFREC_SHIFT             (6)
#define FLEXCAN_CTRL1_BOFFREC_MASK              (0x1U << FLEXCAN_CTRL1_BOFFREC_SHIFT)
#define FLEXCAN_CTRL1_BOFFREC(x)                (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_BOFFREC_SHIFT)) & FLEXCAN_CTRL1_BOFFREC_MASK)

#define FLEXCAN_CTRL1_TSYN_SHIFT                (5)
#define FLEXCAN_CTRL1_TSYN_MASK                 (0x1U << FLEXCAN_CTRL1_TSYN_SHIFT)
#define FLEXCAN_CTRL1_TSYN(x)                   (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_TSYN_SHIFT)) & FLEXCAN_CTRL1_TSYN_MASK)

#define FLEXCAN_CTRL1_LBUF_SHIFT                (4)
#define FLEXCAN_CTRL1_LBUF_MASK                 (0x1U << FLEXCAN_CTRL1_LBUF_SHIFT)
#define FLEXCAN_CTRL1_LBUF(x)                   (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_LBUF_SHIFT)) & FLEXCAN_CTRL1_LBUF_MASK)

#define FLEXCAN_CTRL1_LOM_SHIFT                 (3)
#define FLEXCAN_CTRL1_LOM_MASK                  (0x1U << FLEXCAN_CTRL1_LOM_SHIFT)
#define FLEXCAN_CTRL1_LOM(x)                    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_LOM_SHIFT)) & FLEXCAN_CTRL1_LOM_MASK)

#define FLEXCAN_CTRL1_PROPSEG_SHIFT             (0)
#define FLEXCAN_CTRL1_PROPSEG_MASK              (0x7U << FLEXCAN_CTRL1_PROPSEG_SHIFT)
#define FLEXCAN_CTRL1_PROPSEG(x)                (((uint32_t)(((uint32_t)(x)) << FLEXCAN_CTRL1_PROPSEG_SHIFT)) & FLEXCAN_CTRL1_PROPSEG_MASK)

/*!
 * @brief FLEXCAN_TIMER Register Bit Definition
 */

#define FLEXCAN_TIMER_TIMER_SHIFT               (0)
#define FLEXCAN_TIMER_TIMER_MASK                (0xFFFFU << FLEXCAN_TIMER_TIMER_SHIFT)
#define FLEXCAN_TIMER_TIMER(x)                  (((uint32_t)(((uint32_t)(x)) << FLEXCAN_TIMER_TIMER_SHIFT)) & FLEXCAN_TIMER_TIMER_MASK)

/*!
 * @brief FLEXCAN_RXMGMASK Register Bit Definition
 */

#define FLEXCAN_RXMGMASK_MG_SHIFT               (0)
#define FLEXCAN_RXMGMASK_MG_MASK                (0xFFFFFFFFU << FLEXCAN_RXMGMASK_MG_SHIFT)
#define FLEXCAN_RXMGMASK_MG(x)                  (((uint32_t)(((uint32_t)(x)) << FLEXCAN_RXMGMASK_MG_SHIFT)) & FLEXCAN_RXMGMASK_MG_MASK)

/*!
 * @brief FLEXCAN_RX14MASK Register Bit Definition
 */

#define FLEXCAN_RX14MASK_RX14M_SHIFT            (0)
#define FLEXCAN_RX14MASK_RX14M_MASK             (0xFFFFFFFFU << FLEXCAN_RX14MASK_RX14M_SHIFT)
#define FLEXCAN_RX14MASK_RX14M(x)               (((uint32_t)(((uint32_t)(x)) << FLEXCAN_RX14MASK_RX14M_SHIFT)) & FLEXCAN_RX14MASK_RX14M_MASK)

/*!
 * @brief FLEXCAN_RX15MASK Register Bit Definition
 */

#define FLEXCAN_RX15MASK_RX15M_SHIFT            (0)
#define FLEXCAN_RX15MASK_RX15M_MASK             (0xFFFFFFFFU << FLEXCAN_RX15MASK_RX15M_SHIFT)
#define FLEXCAN_RX15MASK_RX15M(x)               (((uint32_t)(((uint32_t)(x)) << FLEXCAN_RX15MASK_RX15M_SHIFT)) & FLEXCAN_RX15MASK_RX15M_MASK)

/*!
 * @brief FLEXCAN_ECR Register Bit Definition
 */

#define FLEXCAN_ECR_RXERRCNTFAST_SHIFT          (24)
#define FLEXCAN_ECR_RXERRCNTFAST_MASK           (0xFFU << FLEXCAN_ECR_RXERRCNTFAST_SHIFT)
#define FLEXCAN_ECR_RXERRCNTFAST(x)             (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ECR_RXERRCNTFAST_SHIFT)) & FLEXCAN_ECR_RXERRCNTFAST_MASK)

#define FLEXCAN_ECR_TXERRCNTFAST_SHIFT          (16)
#define FLEXCAN_ECR_TXERRCNTFAST_MASK           (0xFFU << FLEXCAN_ECR_TXERRCNTFAST_SHIFT)
#define FLEXCAN_ECR_TXERRCNTFAST(x)             (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ECR_TXERRCNTFAST_SHIFT)) & FLEXCAN_ECR_TXERRCNTFAST_MASK)

#define FLEXCAN_ECR_RXERRCNT_SHIFT              (8)
#define FLEXCAN_ECR_RXERRCNT_MASK               (0xFFU << FLEXCAN_ECR_RXERRCNT_SHIFT)
#define FLEXCAN_ECR_RXERRCNT(x)                 (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ECR_RXERRCNT_SHIFT)) & FLEXCAN_ECR_RXERRCNT_MASK)

#define FLEXCAN_ECR_TXERRCNT_SHIFT              (0)
#define FLEXCAN_ECR_TXERRCNT_MASK               (0xFFU << FLEXCAN_ECR_TXERRCNT_SHIFT)
#define FLEXCAN_ECR_TXERRCNT(x)                 (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ECR_TXERRCNT_SHIFT)) & FLEXCAN_ECR_TXERRCNT_MASK)

/*!
 * @brief FLEXCAN_ESR1 Register Bit Definition
 */

#define FLEXCAN_ESR1_BIT1ERRFAST_SHIFT          (31)
#define FLEXCAN_ESR1_BIT1ERRFAST_MASK           (0x1U << FLEXCAN_ESR1_BIT1ERRFAST_SHIFT)
#define FLEXCAN_ESR1_BIT1ERRFAST(x)             (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_BIT1ERRFAST_SHIFT)) & FLEXCAN_ESR1_BIT1ERRFAST_MASK)

#define FLEXCAN_ESR1_BIT0ERRFAST_SHIFT          (30)
#define FLEXCAN_ESR1_BIT0ERRFAST_MASK           (0x1U << FLEXCAN_ESR1_BIT0ERRFAST_SHIFT)
#define FLEXCAN_ESR1_BIT0ERRFAST(x)             (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_BIT0ERRFAST_SHIFT)) & FLEXCAN_ESR1_BIT0ERRFAST_MASK)

#define FLEXCAN_ESR1_CRCERRFAST_SHIFT           (28)
#define FLEXCAN_ESR1_CRCERRFAST_MASK            (0x1U << FLEXCAN_ESR1_CRCERRFAST_SHIFT)
#define FLEXCAN_ESR1_CRCERRFAST(x)              (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_CRCERRFAST_SHIFT)) & FLEXCAN_ESR1_CRCERRFAST_MASK)

#define FLEXCAN_ESR1_FRMERRFAST_SHIFT           (27)
#define FLEXCAN_ESR1_FRMERRFAST_MASK            (0x1U << FLEXCAN_ESR1_FRMERRFAST_SHIFT)
#define FLEXCAN_ESR1_FRMERRFAST(x)              (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_FRMERRFAST_SHIFT)) & FLEXCAN_ESR1_FRMERRFAST_MASK)

#define FLEXCAN_ESR1_STFERRFAST_SHIFT           (26)
#define FLEXCAN_ESR1_STFERRFAST_MASK            (0x1U << FLEXCAN_ESR1_STFERRFAST_SHIFT)
#define FLEXCAN_ESR1_STFERRFAST(x)              (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_STFERRFAST_SHIFT)) & FLEXCAN_ESR1_STFERRFAST_MASK)

#define FLEXCAN_ESR1_ERROVR_SHIFT               (21)
#define FLEXCAN_ESR1_ERROVR_MASK                (0x1U << FLEXCAN_ESR1_ERROVR_SHIFT)
#define FLEXCAN_ESR1_ERROVR(x)                  (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_ERROVR_SHIFT)) & FLEXCAN_ESR1_ERROVR_MASK)

#define FLEXCAN_ESR1_ERRINTFAST_SHIFT           (20)
#define FLEXCAN_ESR1_ERRINTFAST_MASK            (0x1U << FLEXCAN_ESR1_ERRINTFAST_SHIFT)
#define FLEXCAN_ESR1_ERRINTFAST(x)              (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_ERRINTFAST_SHIFT)) & FLEXCAN_ESR1_ERRINTFAST_MASK)

#define FLEXCAN_ESR1_BOFFDONEINT_SHIFT          (19)
#define FLEXCAN_ESR1_BOFFDONEINT_MASK           (0x1U << FLEXCAN_ESR1_BOFFDONEINT_SHIFT)
#define FLEXCAN_ESR1_BOFFDONEINT(x)             (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ESR1_BOFFDONEINT_SHIFT)) & FLEXCAN_ESR1_BOFFDONEINT_MASK)

