AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define FLEXCAN_WORD0_BYTE2_SHIFT               (8)
#define FLEXCAN_WORD0_BYTE2_MASK                (0xFFU << FLEXCAN_WORD0_BYTE2_SHIFT)
#define FLEXCAN_WORD0_BYTE2(x)                  (((uint32_t)(((uint32_t)(x)) << FLEXCAN_WORD0_BYTE2_SHIFT)) & FLEXCAN_WORD0_BYTE2_MASK)

#define FLEXCAN_WORD0_BYTE3_SHIFT               (0)
#define FLEXCAN_WORD0_BYTE3_MASK                (0xFFU << FLEXCAN_WORD0_BYTE3_SHIFT)
#define FLEXCAN_WORD0_BYTE3(x)                  (((uint32_t)(((uint32_t)(x)) << FLEXCAN_WORD0_BYTE3_SHIFT)) & FLEXCAN_WORD0_BYTE3_MASK)

/*!
 * @brief FLEXCAN_WORD1 Register Bit Definition
 */

#define FLEXCAN_WORD1_BYTE4_SHIFT               (24)
#define FLEXCAN_WORD1_BYTE4_MASK                (0xFFU << FLEXCAN_WORD1_BYTE4_SHIFT)
#define FLEXCAN_WORD1_BYTE4(x)                  (((uint32_t)(((uint32_t)(x)) << FLEXCAN_WORD1_BYTE4_SHIFT)) & FLEXCAN_WORD1_BYTE4_MASK)

#define FLEXCAN_WORD1_BYTE5_SHIFT               (16)
#define FLEXCAN_WORD1_BYTE5_MASK                (0x3FU << FLEXCAN_WORD1_BYTE5_SHIFT)
#define FLEXCAN_WORD1_BYTE5(x)                  (((uint32_t)(((uint32_t)(x)) << FLEXCAN_WORD1_BYTE5_SHIFT)) & FLEXCAN_WORD1_BYTE5_MASK)

#define FLEXCAN_WORD1_BYTE6_SHIFT               (8)
#define FLEXCAN_WORD1_BYTE6_MASK                (0xFFU << FLEXCAN_WORD1_BYTE6_SHIFT)
#define FLEXCAN_WORD1_BYTE6(x)                  (((uint32_t)(((uint32_t)(x)) << FLEXCAN_WORD1_BYTE6_SHIFT)) & FLEXCAN_WORD1_BYTE6_MASK)

#define FLEXCAN_WORD1_BYTE7_SHIFT               (0)
#define FLEXCAN_WORD1_BYTE7_MASK                (0xFFU << FLEXCAN_WORD1_BYTE7_SHIFT)
#define FLEXCAN_WORD1_BYTE7(x)                  (((uint32_t)(((uint32_t)(x)) << FLEXCAN_WORD1_BYTE7_SHIFT)) & FLEXCAN_WORD1_BYTE7_MASK)

/*!
 * @brief FLEXCAN_RXIMR Register Bit Definition
 */

#define FLEXCAN_RXIMR_MI_SHIFT                  (0)
#define FLEXCAN_RXIMR_MI_MASK                   (0xFFFFFFFFU << FLEXCAN_RXIMR_MI_SHIFT)
#define FLEXCAN_RXIMR_MI(x)                     (((uint32_t)(((uint32_t)(x)) << FLEXCAN_RXIMR_MI_SHIFT)) & FLEXCAN_RXIMR_MI_MASK)

/*!
 * @brief FLEXCAN_FDCTRL Register Bit Definition
 */

#define FLEXCAN_FDCTRL_FDRATE_SHIFT             (31)
#define FLEXCAN_FDCTRL_FDRATE_MASK              (0x1U << FLEXCAN_FDCTRL_FDRATE_SHIFT)
#define FLEXCAN_FDCTRL_FDRATE(x)                (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FDCTRL_FDRATE_SHIFT)) & FLEXCAN_FDCTRL_FDRATE_MASK)

#define FLEXCAN_FDCTRL_MBDSR0_SHIFT             (16)
#define FLEXCAN_FDCTRL_MBDSR0_MASK              (0x3U << FLEXCAN_FDCTRL_MBDSR0_SHIFT)
#define FLEXCAN_FDCTRL_MBDSR0(x)                (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FDCTRL_MBDSR0_SHIFT)) & FLEXCAN_FDCTRL_MBDSR0_MASK)

#define FLEXCAN_FDCTRL_TDCEN_SHIFT              (15)
#define FLEXCAN_FDCTRL_TDCEN_MASK               (0x1U << FLEXCAN_FDCTRL_TDCEN_SHIFT)
#define FLEXCAN_FDCTRL_TDCEN(x)                 (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FDCTRL_TDCEN_SHIFT)) & FLEXCAN_FDCTRL_TDCEN_MASK)

#define FLEXCAN_FDCTRL_TDCFAIL_SHIFT            (14)
#define FLEXCAN_FDCTRL_TDCFAIL_MASK             (0x1U << FLEXCAN_FDCTRL_TDCFAIL_SHIFT)
#define FLEXCAN_FDCTRL_TDCFAIL(x)               (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FDCTRL_TDCFAIL_SHIFT)) & FLEXCAN_FDCTRL_TDCFAIL_MASK)

#define FLEXCAN_FDCTRL_TDCOFF_SHIFT             (8)
#define FLEXCAN_FDCTRL_TDCOFF_MASK              (0x1FU << FLEXCAN_FDCTRL_TDCOFF_SHIFT)
#define FLEXCAN_FDCTRL_TDCOFF(x)                (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FDCTRL_TDCOFF_SHIFT)) & FLEXCAN_FDCTRL_TDCOFF_MASK)

#define FLEXCAN_FDCTRL_TDCVAL_SHIFT             (0)
#define FLEXCAN_FDCTRL_TDCVAL_MASK              (0x3FU << FLEXCAN_FDCTRL_TDCVAL_SHIFT)
#define FLEXCAN_FDCTRL_TDCVAL(x)                (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FDCTRL_TDCVAL_SHIFT)) & FLEXCAN_FDCTRL_TDCVAL_MASK)

/*!
 * @brief FLEXCAN_FDCBT Register Bit Definition
 */

#define FLEXCAN_FDCBT_FPRESDIV_SHIFT            (20)
#define FLEXCAN_FDCBT_FPRESDIV_MASK             (0x3FFU << FLEXCAN_FDCBT_FPRESDIV_SHIFT)
#define FLEXCAN_FDCBT_FPRESDIV(x)               (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FDCBT_FPRESDIV_SHIFT)) & FLEXCAN_FDCBT_FPRESDIV_MASK)

#define FLEXCAN_FDCBT_FRJW_SHIFT                (16)
#define FLEXCAN_FDCBT_FRJW_MASK                 (0x7U << FLEXCAN_FDCBT_FRJW_SHIFT)
#define FLEXCAN_FDCBT_FRJW(x)                   (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FDCBT_FRJW_SHIFT)) & FLEXCAN_FDCBT_FRJW_MASK)

#define FLEXCAN_FDCBT_FPROPSEG_SHIFT            (10)
#define FLEXCAN_FDCBT_FPROPSEG_MASK             (0x1FU << FLEXCAN_FDCBT_FPROPSEG_SHIFT)
#define FLEXCAN_FDCBT_FPROPSEG(x)               (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FDCBT_FPROPSEG_SHIFT)) & FLEXCAN_FDCBT_FPROPSEG_MASK)

#define FLEXCAN_FDCBT_FPSEG1_SHIFT              (5)
#define FLEXCAN_FDCBT_FPSEG1_MASK               (0x7U << FLEXCAN_FDCBT_FPSEG1_SHIFT)
#define FLEXCAN_FDCBT_FPSEG1(x)                 (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FDCBT_FPSEG1_SHIFT)) & FLEXCAN_FDCBT_FPSEG1_MASK)

#define FLEXCAN_FDCBT_FPSEG2_SHIFT              (0)
#define FLEXCAN_FDCBT_FPSEG2_MASK               (0x7U << FLEXCAN_FDCBT_FPSEG2_SHIFT)
#define FLEXCAN_FDCBT_FPSEG2(x)                 (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FDCBT_FPSEG2_SHIFT)) & FLEXCAN_FDCBT_FPSEG2_MASK)

/*!
 * @brief FLEXCAN_FDCRC Register Bit Definition
 */

#define FLEXCAN_FDCRC_FDMBCRC_SHIFT             (24)
#define FLEXCAN_FDCRC_FDMBCRC_MASK              (0x7FU << FLEXCAN_FDCRC_FDMBCRC_SHIFT)
#define FLEXCAN_FDCRC_FDMBCRC(x)                (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FDCRC_FDMBCRC_SHIFT)) & FLEXCAN_FDCRC_FDMBCRC_MASK)

#define FLEXCAN_FDCRC_FDTXCRC_SHIFT             (0)
#define FLEXCAN_FDCRC_FDTXCRC_MASK              (0x1FFFFFU << FLEXCAN_FDCRC_FDTXCRC_SHIFT)
#define FLEXCAN_FDCRC_FDTXCRC(x)                (((uint32_t)(((uint32_t)(x)) << FLEXCAN_FDCRC_FDTXCRC_SHIFT)) & FLEXCAN_FDCRC_FDTXCRC_MASK)

/*!
 * @brief FLEXCAN_ERFCR Register Bit Definition
 */

#define FLEXCAN_ERFCR_ERFEN_SHIFT               (31)
#define FLEXCAN_ERFCR_ERFEN_MASK                (0x1U << FLEXCAN_ERFCR_ERFEN_SHIFT)
#define FLEXCAN_ERFCR_ERFEN(x)                  (((uint32_t)(((uint32_t)(x)) << FLEXCAN_ERFCR_ERFEN_SHIFT)) & FLEXCAN_ERFCR_ERFEN_MASK)

