AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define GPIO_DCR_PX3_SHIFT                      (6)
#define GPIO_DCR_PX3_MASK                       (0x3U << GPIO_DCR_PX3_SHIFT)
#define GPIO_DCR_PX3(x)                         (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX3_SHIFT)) & GPIO_DCR_PX3_MASK)

#define GPIO_DCR_PX2_SHIFT                      (4)
#define GPIO_DCR_PX2_MASK                       (0x3U << GPIO_DCR_PX2_SHIFT)
#define GPIO_DCR_PX2(x)                         (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX2_SHIFT)) & GPIO_DCR_PX2_MASK)

#define GPIO_DCR_PX1_SHIFT                      (2)
#define GPIO_DCR_PX1_MASK                       (0x3U << GPIO_DCR_PX1_SHIFT)
#define GPIO_DCR_PX1(x)                         (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX1_SHIFT)) & GPIO_DCR_PX1_MASK)

#define GPIO_DCR_PX0_SHIFT                      (0)
#define GPIO_DCR_PX0_MASK                       (0x3U << GPIO_DCR_PX0_SHIFT)
#define GPIO_DCR_PX0(x)                         (((uint32_t)(((uint32_t)(x)) << GPIO_DCR_PX0_SHIFT)) & GPIO_DCR_PX0_MASK)

/*!
 * @brief GPIO_AFRL Register Bit Definition
 */

#define GPIO_AFRL_AFRY_SHIFT                    (0)
#define GPIO_AFRL_AFRY_MASK                     (0xFFFFFFFFU << GPIO_AFRL_AFRY_SHIFT)
#define GPIO_AFRL_AFRY(x)                       (((uint32_t)(((uint32_t)(x)) << GPIO_AFRL_AFRY_SHIFT)) & GPIO_AFRL_AFRY_MASK)

/*!
 * @brief GPIO_AFRH Register Bit Definition
 */

#define GPIO_AFRH_AFRY_SHIFT                    (0)
#define GPIO_AFRH_AFRY_MASK                     (0xFFFFFFFFU << GPIO_AFRH_AFRY_SHIFT)
#define GPIO_AFRH_AFRY(x)                       (((uint32_t)(((uint32_t)(x)) << GPIO_AFRH_AFRY_SHIFT)) & GPIO_AFRH_AFRY_MASK)

/*!
 * @}
 */ /* end of group GPIO_Register_Masks */
/******************************************************************************
 *GPIO Instance
*******************************************************************************/

#define GPIOA                ((GPIO_Type*)GPIOA_BASE)

#define GPIOB                ((GPIO_Type*)GPIOB_BASE)

#define GPIOC                ((GPIO_Type*)GPIOC_BASE)

#define GPIOD                ((GPIO_Type*)GPIOD_BASE)

#define GPIOH                ((GPIO_Type*)GPIOH_BASE)

#define GPIOI                ((GPIO_Type*)GPIOI_BASE)

/*!
 * @}
 */ /* end of group GPIO_Peripheral_Access_Layer */



/*!
 * @addtogroup I2C_Peripheral_Access_Layer I2C Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * I2C Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CR;                                                           ///< Control Register                             offset: 0x00
    __IO uint32_t TAR;                                                          ///< Target Address Register                      offset: 0x04
    __IO uint32_t SAR;                                                          ///< Slave Address Register                       offset: 0x08
    __IO uint32_t Reserved0[1];                                                 ///< Reserved
    __IO uint32_t DR;                                                           ///< Data Command Register                        offset: 0x10
    __IO uint32_t SSHR;                                                         ///< Standard Mode SCL High Count Register        offset: 0x14
    __IO uint32_t SSLR;                                                         ///< Standard Mode SCL Low Count Register         offset: 0x18
    __IO uint32_t FSHR;                                                         ///< Fast Mode/Fast Mode Plus SCL High Count Registeroffset: 0x1C
    __IO uint32_t FSLR;                                                         ///< Fast Mode/Fast Mode Plus SCL Low Count Registeroffset: 0x20
    __IO uint32_t Reserved1[2];                                                 ///< Reserved
    __IO uint32_t ISR;                                                          ///< Interrupt Status Register                    offset: 0x2C
    __IO uint32_t IMR;                                                          ///< Interrupt Mask Register                      offset: 0x30
    __IO uint32_t RAWISR;                                                       ///< RAW Interrupt Status Register                offset: 0x34
    __IO uint32_t RXTLR;                                                        ///< Receive Threshold Register                   offset: 0x38
    __IO uint32_t TXTLR;                                                        ///< Transmit Threshold Register                  offset: 0x3C
    __IO uint32_t ICR;                                                          ///< Combined and Independent Interrupt Clear Registeroffset: 0x40
    __IO uint32_t RXUNDER;                                                      ///< RX_UNDER Interrupt Clear Register            offset: 0x44
    __IO uint32_t RXOVER;                                                       ///< RX_OVER Interrupt Clear Register             offset: 0x48
    __IO uint32_t TXOVER;                                                       ///< TX_OVER Interrupt Clear Register             offset: 0x4C
    __IO uint32_t RDREQ;                                                        ///< RD_REQ Interrupt Clear Register              offset: 0x50
    __IO uint32_t TXABRT;                                                       ///< TX_ABRT Interrupt Clear Register             offset: 0x54
    __IO uint32_t RXDONE;                                                       ///< RX_DONE Interrupt Clear Register             offset: 0x58
    __IO uint32_t ACTIV;                                                        ///< ACTIVITY Interrupt Clear Register            offset: 0x5C
    __IO uint32_t STOP;                                                         ///< STOP_DET Interrupt Clear Register            offset: 0x60
    __IO uint32_t START;                                                        ///< START_DET Interrupt Clear Register           offset: 0x64
    __IO uint32_t GC;                                                           ///< GEN_CALL Interrupt Clear Register            offset: 0x68
    __IO uint32_t ENR;                                                          ///< Enable Register                              offset: 0x6C
    __IO uint32_t SR;                                                           ///< Status Register                              offset: 0x70
    __IO uint32_t TXFLR;                                                        ///< Transmit FIFO Level Register                 offset: 0x74
    __IO uint32_t RXFLR;                                                        ///< Receive FIFO Level Register                  offset: 0x78
    __IO uint32_t HOLD;                                                         ///< SDA Hold Time Register                       offset: 0x7C
    __IO uint32_t TXABRTSRC;                                                    ///< Transfer Abort Source Register               offset: 0x80
    __IO uint32_t SLVNACK;                                                      ///< Slave Receive NACK Register                  offset: 0x84
    __IO uint32_t DMA;                                                          ///< DMA Control Register                         offset: 0x88
    __IO uint32_t Reserved2[2];                                                 ///< Reserved
    __IO uint32_t SETUP;                                                        ///< SDA Setup Time Register                      offset: 0x94
    __IO uint32_t GCR;                                                          ///< General Call ACK Register                    offset: 0x98
    __IO uint32_t ENSR;                                                         ///< ENABLE Status Register                       offset: 0x9C
    __IO uint32_t SPKLEN;                                                       ///< Filter Register                              offset: 0xA0
    __IO uint32_t Reserved3[2];                                                 ///< Reserved
    __IO uint32_t SCLTMO;                                                       ///< SCL Low Timeout Register                     offset: 0xAC
    __IO uint32_t SDATMO;                                                       ///< SDA Low Timeout Register                     offset: 0xB0
    __IO uint32_t SCLSTUCK;                                                     ///< Clear SCL_STUCK Interrupt Register           offset: 0xB4
    __IO uint32_t Reserved4[1];                                                 ///< Reserved
    __IO uint32_t SMBSEXT;                                                      ///< SMBus Slave Device Clock Extension Timeout Register offset: 0xBC
    __IO uint32_t SMBMEXT;                                                      ///< SMBus Master Device Clock Extension Timeout Registeroffset: 0xC0
    __IO uint32_t SMBIDLE;                                                      ///< SMBus Bus Idle Count Register                offset: 0xC4
    __IO uint32_t SMBISR;                                                       ///< SMBus Interrupt Status Register              offset: 0xC8
    __IO uint32_t SMBIMR;                                                       ///< SMBus Interrupt Mask Register                offset: 0xCC
    __IO uint32_t SMBRAWISR;                                                    ///< SMBus RAW Interrupt Register                 offset: 0xD0
    __IO uint32_t SMBICR;                                                       ///< SMBus Combinational and Independent Interrupt Clear Registeroffset: 0xD4
    __IO uint32_t OPTSAR;                                                       ///< Optional Slave Address Register              offset: 0xD8
    __IO uint32_t SMBUDIDLSB;                                                   ///< SMBus UDID LSB Register                      offset: 0xDC
    __IO uint32_t SMBUDIDMSB0;                                                  ///< SMBus UDID MSB Register 0                    offset: 0XE0
    __IO uint32_t SMBUDIDMSB1;                                                  ///< SMBus UDID MSB Register 1                    offset: 0XE4
    __IO uint32_t SMBUDIDMSB2;                                                  ///< SMBus UDID MSB Register 2                    offset: 0xE8
    __IO uint32_t SLVMASK;                                                      ///< Slave Address Mask Register                  offset: 0xEC
    __IO uint32_t SLVRCVADDR;                                                   ///< Slave Address Receive Register               offset: 0xF0
} I2C_Type;

