AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define I2C_TAR_ADDR_SHIFT                      (0)
#define I2C_TAR_ADDR_MASK                       (0x3FFU << I2C_TAR_ADDR_SHIFT)
#define I2C_TAR_ADDR(x)                         (((uint32_t)(((uint32_t)(x)) << I2C_TAR_ADDR_SHIFT)) & I2C_TAR_ADDR_MASK)

/*!
 * @brief I2C_SAR Register Bit Definition
 */

#define I2C_SAR_ADDR_SHIFT                      (0)
#define I2C_SAR_ADDR_MASK                       (0x3FFU << I2C_SAR_ADDR_SHIFT)
#define I2C_SAR_ADDR(x)                         (((uint32_t)(((uint32_t)(x)) << I2C_SAR_ADDR_SHIFT)) & I2C_SAR_ADDR_MASK)

/*!
 * @brief I2C_DR Register Bit Definition
 */

#define I2C_DR_FIRSTDATA_SHIFT                  (11)
#define I2C_DR_FIRSTDATA_MASK                   (0x1U << I2C_DR_FIRSTDATA_SHIFT)
#define I2C_DR_FIRSTDATA(x)                     (((uint32_t)(((uint32_t)(x)) << I2C_DR_FIRSTDATA_SHIFT)) & I2C_DR_FIRSTDATA_MASK)

#define I2C_DR_CMD_SHIFT                        (8)
#define I2C_DR_CMD_MASK                         (0x1U << I2C_DR_CMD_SHIFT)
#define I2C_DR_CMD(x)                           (((uint32_t)(((uint32_t)(x)) << I2C_DR_CMD_SHIFT)) & I2C_DR_CMD_MASK)

#define I2C_DR_DAT_SHIFT                        (0)
#define I2C_DR_DAT_MASK                         (0xFFU << I2C_DR_DAT_SHIFT)
#define I2C_DR_DAT(x)                           (((uint32_t)(((uint32_t)(x)) << I2C_DR_DAT_SHIFT)) & I2C_DR_DAT_MASK)

/*!
 * @brief I2C_SSHR Register Bit Definition
 */

#define I2C_SSHR_CNT_SHIFT                      (0)
#define I2C_SSHR_CNT_MASK                       (0xFFFFU << I2C_SSHR_CNT_SHIFT)
#define I2C_SSHR_CNT(x)                         (((uint32_t)(((uint32_t)(x)) << I2C_SSHR_CNT_SHIFT)) & I2C_SSHR_CNT_MASK)

/*!
 * @brief I2C_SSLR Register Bit Definition
 */

#define I2C_SSLR_CNT_SHIFT                      (0)
#define I2C_SSLR_CNT_MASK                       (0xFFFFU << I2C_SSLR_CNT_SHIFT)
#define I2C_SSLR_CNT(x)                         (((uint32_t)(((uint32_t)(x)) << I2C_SSLR_CNT_SHIFT)) & I2C_SSLR_CNT_MASK)

/*!
 * @brief I2C_FSHR Register Bit Definition
 */

#define I2C_FSHR_CNT_SHIFT                      (0)
#define I2C_FSHR_CNT_MASK                       (0xFFFFU << I2C_FSHR_CNT_SHIFT)
#define I2C_FSHR_CNT(x)                         (((uint32_t)(((uint32_t)(x)) << I2C_FSHR_CNT_SHIFT)) & I2C_FSHR_CNT_MASK)

/*!
 * @brief I2C_FSLR Register Bit Definition
 */

#define I2C_FSLR_CNT_SHIFT                      (0)
#define I2C_FSLR_CNT_MASK                       (0xFFFFU << I2C_FSLR_CNT_SHIFT)
#define I2C_FSLR_CNT(x)                         (((uint32_t)(((uint32_t)(x)) << I2C_FSLR_CNT_SHIFT)) & I2C_FSLR_CNT_MASK)

/*!
 * @brief I2C_ISR Register Bit Definition
 */

#define I2C_ISR_RSCLSTUCKATLOW_SHIFT            (14)
#define I2C_ISR_RSCLSTUCKATLOW_MASK             (0x1U << I2C_ISR_RSCLSTUCKATLOW_SHIFT)
#define I2C_ISR_RSCLSTUCKATLOW(x)               (((uint32_t)(((uint32_t)(x)) << I2C_ISR_RSCLSTUCKATLOW_SHIFT)) & I2C_ISR_RSCLSTUCKATLOW_MASK)

#define I2C_ISR_RMSTONHOLD_SHIFT                (13)
#define I2C_ISR_RMSTONHOLD_MASK                 (0x1U << I2C_ISR_RMSTONHOLD_SHIFT)
#define I2C_ISR_RMSTONHOLD(x)                   (((uint32_t)(((uint32_t)(x)) << I2C_ISR_RMSTONHOLD_SHIFT)) & I2C_ISR_RMSTONHOLD_MASK)

#define I2C_ISR_RGC_SHIFT                       (11)
#define I2C_ISR_RGC_MASK                        (0x1U << I2C_ISR_RGC_SHIFT)
#define I2C_ISR_RGC(x)                          (((uint32_t)(((uint32_t)(x)) << I2C_ISR_RGC_SHIFT)) & I2C_ISR_RGC_MASK)

#define I2C_ISR_RSTART_SHIFT                    (10)
#define I2C_ISR_RSTART_MASK                     (0x1U << I2C_ISR_RSTART_SHIFT)
#define I2C_ISR_RSTART(x)                       (((uint32_t)(((uint32_t)(x)) << I2C_ISR_RSTART_SHIFT)) & I2C_ISR_RSTART_MASK)

#define I2C_ISR_RSTOP_SHIFT                     (9)
#define I2C_ISR_RSTOP_MASK                      (0x1U << I2C_ISR_RSTOP_SHIFT)
#define I2C_ISR_RSTOP(x)                        (((uint32_t)(((uint32_t)(x)) << I2C_ISR_RSTOP_SHIFT)) & I2C_ISR_RSTOP_MASK)

#define I2C_ISR_RACTIV_SHIFT                    (8)
#define I2C_ISR_RACTIV_MASK                     (0x1U << I2C_ISR_RACTIV_SHIFT)
#define I2C_ISR_RACTIV(x)                       (((uint32_t)(((uint32_t)(x)) << I2C_ISR_RACTIV_SHIFT)) & I2C_ISR_RACTIV_MASK)

#define I2C_ISR_RRXDONE_SHIFT                   (7)
#define I2C_ISR_RRXDONE_MASK                    (0x1U << I2C_ISR_RRXDONE_SHIFT)
#define I2C_ISR_RRXDONE(x)                      (((uint32_t)(((uint32_t)(x)) << I2C_ISR_RRXDONE_SHIFT)) & I2C_ISR_RRXDONE_MASK)

#define I2C_ISR_RTXABRT_SHIFT                   (6)
#define I2C_ISR_RTXABRT_MASK                    (0x1U << I2C_ISR_RTXABRT_SHIFT)
#define I2C_ISR_RTXABRT(x)                      (((uint32_t)(((uint32_t)(x)) << I2C_ISR_RTXABRT_SHIFT)) & I2C_ISR_RTXABRT_MASK)

#define I2C_ISR_RRDREQ_SHIFT                    (5)
#define I2C_ISR_RRDREQ_MASK                     (0x1U << I2C_ISR_RRDREQ_SHIFT)
#define I2C_ISR_RRDREQ(x)                       (((uint32_t)(((uint32_t)(x)) << I2C_ISR_RRDREQ_SHIFT)) & I2C_ISR_RRDREQ_MASK)

#define I2C_ISR_RTXEMPTY_SHIFT                  (4)
#define I2C_ISR_RTXEMPTY_MASK                   (0x1U << I2C_ISR_RTXEMPTY_SHIFT)
#define I2C_ISR_RTXEMPTY(x)                     (((uint32_t)(((uint32_t)(x)) << I2C_ISR_RTXEMPTY_SHIFT)) & I2C_ISR_RTXEMPTY_MASK)

#define I2C_ISR_RTXOVER_SHIFT                   (3)
#define I2C_ISR_RTXOVER_MASK                    (0x1U << I2C_ISR_RTXOVER_SHIFT)
#define I2C_ISR_RTXOVER(x)                      (((uint32_t)(((uint32_t)(x)) << I2C_ISR_RTXOVER_SHIFT)) & I2C_ISR_RTXOVER_MASK)

#define I2C_ISR_RRXFULL_SHIFT                   (2)
#define I2C_ISR_RRXFULL_MASK                    (0x1U << I2C_ISR_RRXFULL_SHIFT)
#define I2C_ISR_RRXFULL(x)                      (((uint32_t)(((uint32_t)(x)) << I2C_ISR_RRXFULL_SHIFT)) & I2C_ISR_RRXFULL_MASK)

#define I2C_ISR_RRXOVER_SHIFT                   (1)
#define I2C_ISR_RRXOVER_MASK                    (0x1U << I2C_ISR_RRXOVER_SHIFT)
#define I2C_ISR_RRXOVER(x)                      (((uint32_t)(((uint32_t)(x)) << I2C_ISR_RRXOVER_SHIFT)) & I2C_ISR_RRXOVER_MASK)

#define I2C_ISR_RRXUNDER_SHIFT                  (0)
#define I2C_ISR_RRXUNDER_MASK                   (0x1U << I2C_ISR_RRXUNDER_SHIFT)
#define I2C_ISR_RRXUNDER(x)                     (((uint32_t)(((uint32_t)(x)) << I2C_ISR_RRXUNDER_SHIFT)) & I2C_ISR_RRXUNDER_MASK)

/*!
 * @brief I2C_IMR Register Bit Definition
 */

#define I2C_IMR_MSCLSTUCK_SHIFT                 (14)
#define I2C_IMR_MSCLSTUCK_MASK                  (0x1U << I2C_IMR_MSCLSTUCK_SHIFT)
#define I2C_IMR_MSCLSTUCK(x)                    (((uint32_t)(((uint32_t)(x)) << I2C_IMR_MSCLSTUCK_SHIFT)) & I2C_IMR_MSCLSTUCK_MASK)

#define I2C_IMR_MMSTONHOLD_SHIFT                (13)
#define I2C_IMR_MMSTONHOLD_MASK                 (0x1U << I2C_IMR_MMSTONHOLD_SHIFT)
#define I2C_IMR_MMSTONHOLD(x)                   (((uint32_t)(((uint32_t)(x)) << I2C_IMR_MMSTONHOLD_SHIFT)) & I2C_IMR_MMSTONHOLD_MASK)

#define I2C_IMR_MGC_SHIFT                       (11)
#define I2C_IMR_MGC_MASK                        (0x1U << I2C_IMR_MGC_SHIFT)
#define I2C_IMR_MGC(x)                          (((uint32_t)(((uint32_t)(x)) << I2C_IMR_MGC_SHIFT)) & I2C_IMR_MGC_MASK)

#define I2C_IMR_MSTART_SHIFT                    (10)
#define I2C_IMR_MSTART_MASK                     (0x1U << I2C_IMR_MSTART_SHIFT)
#define I2C_IMR_MSTART(x)                       (((uint32_t)(((uint32_t)(x)) << I2C_IMR_MSTART_SHIFT)) & I2C_IMR_MSTART_MASK)

#define I2C_IMR_MSTOP_SHIFT                     (9)
#define I2C_IMR_MSTOP_MASK                      (0x1U << I2C_IMR_MSTOP_SHIFT)
#define I2C_IMR_MSTOP(x)                        (((uint32_t)(((uint32_t)(x)) << I2C_IMR_MSTOP_SHIFT)) & I2C_IMR_MSTOP_MASK)

#define I2C_IMR_MACTIV_SHIFT                    (8)
#define I2C_IMR_MACTIV_MASK                     (0x1U << I2C_IMR_MACTIV_SHIFT)
#define I2C_IMR_MACTIV(x)                       (((uint32_t)(((uint32_t)(x)) << I2C_IMR_MACTIV_SHIFT)) & I2C_IMR_MACTIV_MASK)

#define I2C_IMR_MRXDONE_SHIFT                   (7)
#define I2C_IMR_MRXDONE_MASK                    (0x1U << I2C_IMR_MRXDONE_SHIFT)
#define I2C_IMR_MRXDONE(x)                      (((uint32_t)(((uint32_t)(x)) << I2C_IMR_MRXDONE_SHIFT)) & I2C_IMR_MRXDONE_MASK)

#define I2C_IMR_MTXABRT_SHIFT                   (6)
#define I2C_IMR_MTXABRT_MASK                    (0x1U << I2C_IMR_MTXABRT_SHIFT)
#define I2C_IMR_MTXABRT(x)                      (((uint32_t)(((uint32_t)(x)) << I2C_IMR_MTXABRT_SHIFT)) & I2C_IMR_MTXABRT_MASK)

#define I2C_IMR_MRDREQ_SHIFT                    (5)
#define I2C_IMR_MRDREQ_MASK                     (0x1U << I2C_IMR_MRDREQ_SHIFT)
#define I2C_IMR_MRDREQ(x)                       (((uint32_t)(((uint32_t)(x)) << I2C_IMR_MRDREQ_SHIFT)) & I2C_IMR_MRDREQ_MASK)

