AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define I2C_SMBICR_CLRARPPRE_SHIFT              (4)
#define I2C_SMBICR_CLRARPPRE_MASK               (0x1U << I2C_SMBICR_CLRARPPRE_SHIFT)
#define I2C_SMBICR_CLRARPPRE(x)                 (((uint32_t)(((uint32_t)(x)) << I2C_SMBICR_CLRARPPRE_SHIFT)) & I2C_SMBICR_CLRARPPRE_MASK)

#define I2C_SMBICR_CLRARPNOTIFY_SHIFT           (3)
#define I2C_SMBICR_CLRARPNOTIFY_MASK            (0x1U << I2C_SMBICR_CLRARPNOTIFY_SHIFT)
#define I2C_SMBICR_CLRARPNOTIFY(x)              (((uint32_t)(((uint32_t)(x)) << I2C_SMBICR_CLRARPNOTIFY_SHIFT)) & I2C_SMBICR_CLRARPNOTIFY_MASK)

#define I2C_SMBICR_CLRARPQUICK_SHIFT            (2)
#define I2C_SMBICR_CLRARPQUICK_MASK             (0x1U << I2C_SMBICR_CLRARPQUICK_SHIFT)
#define I2C_SMBICR_CLRARPQUICK(x)               (((uint32_t)(((uint32_t)(x)) << I2C_SMBICR_CLRARPQUICK_SHIFT)) & I2C_SMBICR_CLRARPQUICK_MASK)

#define I2C_SMBICR_CLRMSTTMO_SHIFT              (1)
#define I2C_SMBICR_CLRMSTTMO_MASK               (0x1U << I2C_SMBICR_CLRMSTTMO_SHIFT)
#define I2C_SMBICR_CLRMSTTMO(x)                 (((uint32_t)(((uint32_t)(x)) << I2C_SMBICR_CLRMSTTMO_SHIFT)) & I2C_SMBICR_CLRMSTTMO_MASK)

#define I2C_SMBICR_CLRSLVTMO_SHIFT              (0)
#define I2C_SMBICR_CLRSLVTMO_MASK               (0x1U << I2C_SMBICR_CLRSLVTMO_SHIFT)
#define I2C_SMBICR_CLRSLVTMO(x)                 (((uint32_t)(((uint32_t)(x)) << I2C_SMBICR_CLRSLVTMO_SHIFT)) & I2C_SMBICR_CLRSLVTMO_MASK)

/*!
 * @brief I2C_OPT_SAR Register Bit Definition
 */

#define I2C_OPTSAR_ADDR_SHIFT                   (0)
#define I2C_OPTSAR_ADDR_MASK                    (0x7FU << I2C_OPTSAR_ADDR_SHIFT)
#define I2C_OPTSAR_ADDR(x)                      (((uint32_t)(((uint32_t)(x)) << I2C_OPTSAR_ADDR_SHIFT)) & I2C_OPTSAR_ADDR_MASK)

/*!
 * @brief I2C_SMB_UDID_LSB Register Bit Definition
 */

#define I2C_SMBUDIDLSB_SMBUDIDLSB_SHIFT         (0)
#define I2C_SMBUDIDLSB_SMBUDIDLSB_MASK          (0xFFFFFFFFU << I2C_SMBUDIDLSB_SMBUDIDLSB_SHIFT)
#define I2C_SMBUDIDLSB_SMBUDIDLSB(x)            (((uint32_t)(((uint32_t)(x)) << I2C_SMBUDIDLSB_SMBUDIDLSB_SHIFT)) & I2C_SMBUDIDLSB_SMBUDIDLSB_MASK)

/*!
 * @brief I2C_SMB_UDID_MSB0 Register Bit Definition
 */

#define I2C_SMBUDIDMSB0_SMBUDIDMSB0_SHIFT       (0)
#define I2C_SMBUDIDMSB0_SMBUDIDMSB0_MASK        (0xFFFFFFFFU << I2C_SMBUDIDMSB0_SMBUDIDMSB0_SHIFT)
#define I2C_SMBUDIDMSB0_SMBUDIDMSB0(x)          (((uint32_t)(((uint32_t)(x)) << I2C_SMBUDIDMSB0_SMBUDIDMSB0_SHIFT)) & I2C_SMBUDIDMSB0_SMBUDIDMSB0_MASK)

/*!
 * @brief I2C_SMB_UDID_MSB1 Register Bit Definition
 */

#define I2C_SMBUDIDMSB1_SMBUDIDMSB1_SHIFT       (0)
#define I2C_SMBUDIDMSB1_SMBUDIDMSB1_MASK        (0xFFFFFFFFU << I2C_SMBUDIDMSB1_SMBUDIDMSB1_SHIFT)
#define I2C_SMBUDIDMSB1_SMBUDIDMSB1(x)          (((uint32_t)(((uint32_t)(x)) << I2C_SMBUDIDMSB1_SMBUDIDMSB1_SHIFT)) & I2C_SMBUDIDMSB1_SMBUDIDMSB1_MASK)

/*!
 * @brief I2C_SMB_UDID_MSB2 Register Bit Definition
 */

#define I2C_SMBUDIDMSB2_SMBUDIDMSB2_SHIFT       (0)
#define I2C_SMBUDIDMSB2_SMBUDIDMSB2_MASK        (0xFFFFFFFFU << I2C_SMBUDIDMSB2_SMBUDIDMSB2_SHIFT)
#define I2C_SMBUDIDMSB2_SMBUDIDMSB2(x)          (((uint32_t)(((uint32_t)(x)) << I2C_SMBUDIDMSB2_SMBUDIDMSB2_SHIFT)) & I2C_SMBUDIDMSB2_SMBUDIDMSB2_MASK)

/*!
 * @brief I2C_SLVMASK Register Bit Definition
 */

#define I2C_SLVMASK_MASK_SHIFT                  (0)
#define I2C_SLVMASK_MASK_MASK                   (0x3FFU << I2C_SLVMASK_MASK_SHIFT)
#define I2C_SLVMASK_MASK(x)                     (((uint32_t)(((uint32_t)(x)) << I2C_SLVMASK_MASK_SHIFT)) & I2C_SLVMASK_MASK_MASK)

/*!
 * @brief I2C_SLVRCVADDR Register Bit Definition
 */

#define I2C_SLVRCVADDR_ADDR_SHIFT               (0)
#define I2C_SLVRCVADDR_ADDR_MASK                (0x3FFU << I2C_SLVRCVADDR_ADDR_SHIFT)
#define I2C_SLVRCVADDR_ADDR(x)                  (((uint32_t)(((uint32_t)(x)) << I2C_SLVRCVADDR_ADDR_SHIFT)) & I2C_SLVRCVADDR_ADDR_MASK)

/*!
 * @}
 */ /* end of group I2C_Register_Masks */
/******************************************************************************
 *I2C Instance
*******************************************************************************/

#define I2C1                 ((I2C_Type*)I2C1_BASE)

#define I2C2                 ((I2C_Type*)I2C2_BASE)

/*!
 * @}
 */ /* end of group I2C_Peripheral_Access_Layer */



/*!
 * @addtogroup I3C_Peripheral_Access_Layer I3C Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * I3C Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t Reserved0;                                                    ///< Reserved
    __IO uint32_t CONFIG;                                                       ///< Configuration register                       offset: 0x004
    __IO uint32_t STATUS;                                                       ///< Status register                              offset: 0x008
    __IO uint32_t CTRL;                                                         ///< Control register                             offset: 0x00C
    __IO uint32_t INTSET;                                                       ///< Interrupt enable set register                offset: 0x010
    __IO uint32_t INTCLR;                                                       ///< Interrupt enable clear register              offset: 0x014
    __IO uint32_t INTMSKED;                                                     ///< Interrupt masked status register             offset: 0x018
    __IO uint32_t ERWAR;                                                        ///< Error and warning register                   offset: 0x01C
    __IO uint32_t DMACTRL;                                                      ///< DMA control register                         offset: 0x020
    __IO uint32_t Reserved1[2];                                                 ///< Reserved
    __IO uint32_t DATACTRL;                                                     ///< Data control register                        offset: 0x02C
    __IO uint32_t WDATAB;                                                       ///< Write byte register                          offset: 0x030
    __IO uint32_t WDATABE;                                                      ///< Write byte as end register                   offset: 0x034
    __IO uint32_t WDATAH;                                                       ///< Write halfword register                      offset: 0x038
    __IO uint32_t WDATAHE;                                                      ///< Write halfword as end register               offset: 0x03C
    __IO uint32_t RDATAB;                                                       ///< Read byte register                           offset: 0x040
    __IO uint32_t Reserved2[1];                                                 ///< Reserved
    __IO uint32_t RDATAH;                                                       ///< Read halfword register                       offset: 0x048
    __IO uint32_t Reserved3[2];                                                 ///< Reserved
    __IO uint32_t WDATAB1;                                                      ///< Byte-only Write byte register                offset: 0x054
    __IO uint32_t Reserved4[1];                                                 ///< Reserved
    __IO uint32_t CAPABILITIES2;                                                ///< Capabilities 2 register                      offset: 0x05C
    __IO uint32_t CAPABILITIES;                                                 ///< Capabilities register                        offset: 0x060
    __IO uint32_t DYNADDR;                                                      ///< Dynamic address register                     offset: 0x064
    __IO uint32_t MAXLIMITS;                                                    ///< Maximum limits register                      offset: 0x068
    __IO uint32_t IDPARTNO;                                                     ///< Part number ID register                      offset: 0x06C
    __IO uint32_t IDEXT;                                                        ///< ID components register                       offset: 0x070
    __IO uint32_t VENDORID;                                                     ///< Vendor ID register                           offset: 0x074
    __IO uint32_t Reserved5[98];                                                ///< Reserved
    __IO uint32_t DIV;                                                          ///< Division register                            offset: 0x200
    __IO uint32_t SPKLEN;                                                       ///< Filter register                              offset: 0x204
} I3C_Type;

