AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
/*******************************************************************************
 * I3C Type
 ******************************************************************************/

/*!
 * @addtogroup I3C_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief I3C_CONFIG Register Bit Definition
 */

#define I3C_CONFIG_SADDR_SHIFT                  (25)
#define I3C_CONFIG_SADDR_MASK                   (0x7FU << I3C_CONFIG_SADDR_SHIFT)
#define I3C_CONFIG_SADDR(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_CONFIG_SADDR_SHIFT)) & I3C_CONFIG_SADDR_MASK)

#define I3C_CONFIG_BAMAT_SHIFT                  (16)
#define I3C_CONFIG_BAMAT_MASK                   (0xFFU << I3C_CONFIG_BAMAT_SHIFT)
#define I3C_CONFIG_BAMAT(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_CONFIG_BAMAT_SHIFT)) & I3C_CONFIG_BAMAT_MASK)

#define I3C_CONFIG_OFFLINE_SHIFT                (9)
#define I3C_CONFIG_OFFLINE_MASK                 (0x1U << I3C_CONFIG_OFFLINE_SHIFT)
#define I3C_CONFIG_OFFLINE(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_CONFIG_OFFLINE_SHIFT)) & I3C_CONFIG_OFFLINE_MASK)

#define I3C_CONFIG_IDRAND_SHIFT                 (8)
#define I3C_CONFIG_IDRAND_MASK                  (0x1U << I3C_CONFIG_IDRAND_SHIFT)
#define I3C_CONFIG_IDRAND(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_CONFIG_IDRAND_SHIFT)) & I3C_CONFIG_IDRAND_MASK)

#define I3C_CONFIG_S0IGNORE_SHIFT               (3)
#define I3C_CONFIG_S0IGNORE_MASK                (0x1U << I3C_CONFIG_S0IGNORE_SHIFT)
#define I3C_CONFIG_S0IGNORE(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_CONFIG_S0IGNORE_SHIFT)) & I3C_CONFIG_S0IGNORE_MASK)

#define I3C_CONFIG_MATSS_SHIFT                  (2)
#define I3C_CONFIG_MATSS_MASK                   (0x1U << I3C_CONFIG_MATSS_SHIFT)
#define I3C_CONFIG_MATSS(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_CONFIG_MATSS_SHIFT)) & I3C_CONFIG_MATSS_MASK)

#define I3C_CONFIG_NACK_SHIFT                   (1)
#define I3C_CONFIG_NACK_MASK                    (0x1U << I3C_CONFIG_NACK_SHIFT)
#define I3C_CONFIG_NACK(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_CONFIG_NACK_SHIFT)) & I3C_CONFIG_NACK_MASK)

#define I3C_CONFIG_SLVENA_SHIFT                 (0)
#define I3C_CONFIG_SLVENA_MASK                  (0x1U << I3C_CONFIG_SLVENA_SHIFT)
#define I3C_CONFIG_SLVENA(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_CONFIG_SLVENA_SHIFT)) & I3C_CONFIG_SLVENA_MASK)

/*!
 * @brief I3C_STATUS Register Bit Definition
 */

#define I3C_STATUS_ACTSTATE_SHIFT               (28)
#define I3C_STATUS_ACTSTATE_MASK                (0x3U << I3C_STATUS_ACTSTATE_SHIFT)
#define I3C_STATUS_ACTSTATE(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_ACTSTATE_SHIFT)) & I3C_STATUS_ACTSTATE_MASK)

#define I3C_STATUS_HJDIS_SHIFT                  (27)
#define I3C_STATUS_HJDIS_MASK                   (0x1U << I3C_STATUS_HJDIS_SHIFT)
#define I3C_STATUS_HJDIS(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_HJDIS_SHIFT)) & I3C_STATUS_HJDIS_MASK)

#define I3C_STATUS_MRDIS_SHIFT                  (25)
#define I3C_STATUS_MRDIS_MASK                   (0x1U << I3C_STATUS_MRDIS_SHIFT)
#define I3C_STATUS_MRDIS(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_MRDIS_SHIFT)) & I3C_STATUS_MRDIS_MASK)

#define I3C_STATUS_IBIDIS_SHIFT                 (24)
#define I3C_STATUS_IBIDIS_MASK                  (0x1U << I3C_STATUS_IBIDIS_SHIFT)
#define I3C_STATUS_IBIDIS(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_IBIDIS_SHIFT)) & I3C_STATUS_IBIDIS_MASK)

#define I3C_STATUS_EVDET_SHIFT                  (20)
#define I3C_STATUS_EVDET_MASK                   (0x3U << I3C_STATUS_EVDET_SHIFT)
#define I3C_STATUS_EVDET(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_EVDET_SHIFT)) & I3C_STATUS_EVDET_MASK)

#define I3C_STATUS_EVENT_SHIFT                  (18)
#define I3C_STATUS_EVENT_MASK                   (0x1U << I3C_STATUS_EVENT_SHIFT)
#define I3C_STATUS_EVENT(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_EVENT_SHIFT)) & I3C_STATUS_EVENT_MASK)

#define I3C_STATUS_CHANDLED_SHIFT               (17)
#define I3C_STATUS_CHANDLED_MASK                (0x1U << I3C_STATUS_CHANDLED_SHIFT)
#define I3C_STATUS_CHANDLED(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_CHANDLED_SHIFT)) & I3C_STATUS_CHANDLED_MASK)

#define I3C_STATUS_ERWAR_SHIFT                  (15)
#define I3C_STATUS_ERWAR_MASK                   (0x1U << I3C_STATUS_ERWAR_SHIFT)
#define I3C_STATUS_ERWAR(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_ERWAR_SHIFT)) & I3C_STATUS_ERWAR_MASK)

#define I3C_STATUS_CCC_SHIFT                    (14)
#define I3C_STATUS_CCC_MASK                     (0x1U << I3C_STATUS_CCC_SHIFT)
#define I3C_STATUS_CCC(x)                       (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_CCC_SHIFT)) & I3C_STATUS_CCC_MASK)

#define I3C_STATUS_DACHG_SHIFT                  (13)
#define I3C_STATUS_DACHG_MASK                   (0x1U << I3C_STATUS_DACHG_SHIFT)
#define I3C_STATUS_DACHG(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_DACHG_SHIFT)) & I3C_STATUS_DACHG_MASK)

#define I3C_STATUS_TXNF_SHIFT                   (12)
#define I3C_STATUS_TXNF_MASK                    (0x1U << I3C_STATUS_TXNF_SHIFT)
#define I3C_STATUS_TXNF(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_TXNF_SHIFT)) & I3C_STATUS_TXNF_MASK)

#define I3C_STATUS_RXPEND_SHIFT                 (11)
#define I3C_STATUS_RXPEND_MASK                  (0x1U << I3C_STATUS_RXPEND_SHIFT)
#define I3C_STATUS_RXPEND(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_RXPEND_SHIFT)) & I3C_STATUS_RXPEND_MASK)

#define I3C_STATUS_STOP_SHIFT                   (10)
#define I3C_STATUS_STOP_MASK                    (0x1U << I3C_STATUS_STOP_SHIFT)
#define I3C_STATUS_STOP(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_STOP_SHIFT)) & I3C_STATUS_STOP_MASK)

#define I3C_STATUS_MATED_SHIFT                  (9)
#define I3C_STATUS_MATED_MASK                   (0x1U << I3C_STATUS_MATED_SHIFT)
#define I3C_STATUS_MATED(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_MATED_SHIFT)) & I3C_STATUS_MATED_MASK)

#define I3C_STATUS_START_SHIFT                  (8)
#define I3C_STATUS_START_MASK                   (0x1U << I3C_STATUS_START_SHIFT)
#define I3C_STATUS_START(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_START_SHIFT)) & I3C_STATUS_START_MASK)

