AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define LPUART_LPUCON_RXPOL_SHIFT               (11)
#define LPUART_LPUCON_RXPOL_MASK                (0x1U << LPUART_LPUCON_RXPOL_SHIFT)
#define LPUART_LPUCON_RXPOL(x)                  (((uint32_t)(((uint32_t)(x)) << LPUART_LPUCON_RXPOL_SHIFT)) & LPUART_LPUCON_RXPOL_MASK)

#define LPUART_LPUCON_PAREN_SHIFT               (10)
#define LPUART_LPUCON_PAREN_MASK                (0x1U << LPUART_LPUCON_PAREN_SHIFT)
#define LPUART_LPUCON_PAREN(x)                  (((uint32_t)(((uint32_t)(x)) << LPUART_LPUCON_PAREN_SHIFT)) & LPUART_LPUCON_PAREN_MASK)

#define LPUART_LPUCON_PTYP_SHIFT                (9)
#define LPUART_LPUCON_PTYP_MASK                 (0x1U << LPUART_LPUCON_PTYP_SHIFT)
#define LPUART_LPUCON_PTYP(x)                   (((uint32_t)(((uint32_t)(x)) << LPUART_LPUCON_PTYP_SHIFT)) & LPUART_LPUCON_PTYP_MASK)

#define LPUART_LPUCON_SL_SHIFT                  (8)
#define LPUART_LPUCON_SL_MASK                   (0x1U << LPUART_LPUCON_SL_SHIFT)
#define LPUART_LPUCON_SL(x)                     (((uint32_t)(((uint32_t)(x)) << LPUART_LPUCON_SL_SHIFT)) & LPUART_LPUCON_SL_MASK)

#define LPUART_LPUCON_DL_SHIFT                  (7)
#define LPUART_LPUCON_DL_MASK                   (0x1U << LPUART_LPUCON_DL_SHIFT)
#define LPUART_LPUCON_DL(x)                     (((uint32_t)(((uint32_t)(x)) << LPUART_LPUCON_DL_SHIFT)) & LPUART_LPUCON_DL_MASK)

#define LPUART_LPUCON_RXEV_SHIFT                (5)
#define LPUART_LPUCON_RXEV_MASK                 (0x3U << LPUART_LPUCON_RXEV_SHIFT)
#define LPUART_LPUCON_RXEV(x)                   (((uint32_t)(((uint32_t)(x)) << LPUART_LPUCON_RXEV_SHIFT)) & LPUART_LPUCON_RXEV_MASK)

#define LPUART_LPUCON_ERRIE_SHIFT               (4)
#define LPUART_LPUCON_ERRIE_MASK                (0x1U << LPUART_LPUCON_ERRIE_SHIFT)
#define LPUART_LPUCON_ERRIE(x)                  (((uint32_t)(((uint32_t)(x)) << LPUART_LPUCON_ERRIE_SHIFT)) & LPUART_LPUCON_ERRIE_MASK)

#define LPUART_LPUCON_TCIE_SHIFT                (3)
#define LPUART_LPUCON_TCIE_MASK                 (0x1U << LPUART_LPUCON_TCIE_SHIFT)
#define LPUART_LPUCON_TCIE(x)                   (((uint32_t)(((uint32_t)(x)) << LPUART_LPUCON_TCIE_SHIFT)) & LPUART_LPUCON_TCIE_MASK)

#define LPUART_LPUCON_TXIE_SHIFT                (2)
#define LPUART_LPUCON_TXIE_MASK                 (0x1U << LPUART_LPUCON_TXIE_SHIFT)
#define LPUART_LPUCON_TXIE(x)                   (((uint32_t)(((uint32_t)(x)) << LPUART_LPUCON_TXIE_SHIFT)) & LPUART_LPUCON_TXIE_MASK)

#define LPUART_LPUCON_NEDET_SHIFT               (1)
#define LPUART_LPUCON_NEDET_MASK                (0x1U << LPUART_LPUCON_NEDET_SHIFT)
#define LPUART_LPUCON_NEDET(x)                  (((uint32_t)(((uint32_t)(x)) << LPUART_LPUCON_NEDET_SHIFT)) & LPUART_LPUCON_NEDET_MASK)

#define LPUART_LPUCON_RXIE_SHIFT                (0)
#define LPUART_LPUCON_RXIE_MASK                 (0x1U << LPUART_LPUCON_RXIE_SHIFT)
#define LPUART_LPUCON_RXIE(x)                   (((uint32_t)(((uint32_t)(x)) << LPUART_LPUCON_RXIE_SHIFT)) & LPUART_LPUCON_RXIE_MASK)

/*!
 * @brief LPUART_LPUEN Register Bit Definition
 */

#define LPUART_LPUEN_DMAR_SHIFT                 (3)
#define LPUART_LPUEN_DMAR_MASK                  (0x1U << LPUART_LPUEN_DMAR_SHIFT)
#define LPUART_LPUEN_DMAR(x)                    (((uint32_t)(((uint32_t)(x)) << LPUART_LPUEN_DMAR_SHIFT)) & LPUART_LPUEN_DMAR_MASK)

#define LPUART_LPUEN_DMAT_SHIFT                 (2)
#define LPUART_LPUEN_DMAT_MASK                  (0x1U << LPUART_LPUEN_DMAT_SHIFT)
#define LPUART_LPUEN_DMAT(x)                    (((uint32_t)(((uint32_t)(x)) << LPUART_LPUEN_DMAT_SHIFT)) & LPUART_LPUEN_DMAT_MASK)

#define LPUART_LPUEN_RXEN_SHIFT                 (1)
#define LPUART_LPUEN_RXEN_MASK                  (0x1U << LPUART_LPUEN_RXEN_SHIFT)
#define LPUART_LPUEN_RXEN(x)                    (((uint32_t)(((uint32_t)(x)) << LPUART_LPUEN_RXEN_SHIFT)) & LPUART_LPUEN_RXEN_MASK)

#define LPUART_LPUEN_TXEN_SHIFT                 (0)
#define LPUART_LPUEN_TXEN_MASK                  (0x1U << LPUART_LPUEN_TXEN_SHIFT)
#define LPUART_LPUEN_TXEN(x)                    (((uint32_t)(((uint32_t)(x)) << LPUART_LPUEN_TXEN_SHIFT)) & LPUART_LPUEN_TXEN_MASK)

/*!
 * @brief LPUART_LPURXD Register Bit Definition
 */

#define LPUART_LPURXD_DATA_SHIFT                (0)
#define LPUART_LPURXD_DATA_MASK                 (0xFFU << LPUART_LPURXD_DATA_SHIFT)
#define LPUART_LPURXD_DATA(x)                   (((uint32_t)(((uint32_t)(x)) << LPUART_LPURXD_DATA_SHIFT)) & LPUART_LPURXD_DATA_MASK)

/*!
 * @brief LPUART_LPUTXD Register Bit Definition
 */

#define LPUART_LPUTXD_DATA_SHIFT                (0)
#define LPUART_LPUTXD_DATA_MASK                 (0xFFU << LPUART_LPUTXD_DATA_SHIFT)
#define LPUART_LPUTXD_DATA(x)                   (((uint32_t)(((uint32_t)(x)) << LPUART_LPUTXD_DATA_SHIFT)) & LPUART_LPUTXD_DATA_MASK)

/*!
 * @brief LPUART_COMPARE Register Bit Definition
 */

#define LPUART_COMPARE_COMPARE_SHIFT            (0)
#define LPUART_COMPARE_COMPARE_MASK             (0xFFU << LPUART_COMPARE_COMPARE_SHIFT)
#define LPUART_COMPARE_COMPARE(x)               (((uint32_t)(((uint32_t)(x)) << LPUART_COMPARE_COMPARE_SHIFT)) & LPUART_COMPARE_COMPARE_MASK)

/*!
 * @brief LPUART_WKCKE Register Bit Definition
 */

#define LPUART_WKCKE_WKCKE_SHIFT                (0)
#define LPUART_WKCKE_WKCKE_MASK                 (0x1U << LPUART_WKCKE_WKCKE_SHIFT)
#define LPUART_WKCKE_WKCKE(x)                   (((uint32_t)(((uint32_t)(x)) << LPUART_WKCKE_WKCKE_SHIFT)) & LPUART_WKCKE_WKCKE_MASK)

/*!
 * @}
 */ /* end of group LPUART_Register_Masks */
/******************************************************************************
 *LPUART Instance
*******************************************************************************/

#define LPUART               ((LPUART_Type*)LPUART_BASE)

/*!
 * @}
 */ /* end of group LPUART_Peripheral_Access_Layer */



/*!
 * @addtogroup MDS_Peripheral_Access_Layer MDS Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * MDS Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t TRIGXCR[7];                                                  ///< Trigger channel x control register           offset: 0x000
    __IO uint32_t Reserved0[25];                                                ///< Reserved
    __IO uint32_t TRIGCLUXSEL[4];                                               ///< Trigger channel CLUx input select register   offset: 0x080
    __IO uint32_t Reserved1[12];                                                ///< Reserved
    __IO uint32_t TRIGCLUXCFG[4];                                               ///< Trigger channel CLUx configuration register  offset: 0xC0
    __IO uint32_t Reserved2[11];                                                ///< Reserved
    __IO uint32_t SWTRIG;                                                       ///< Software trigger control register            offset: 0x0FC
    __IO uint32_t CONNXCR[7];                                                   ///< Connection channel x control register        offset: 0x100
    __IO uint32_t Reserved3[25];                                                ///< Reserved
    __IO uint32_t CONNCLUXSEL[4];                                               ///< Connection channel CLUx input select registeroffset: 0x180
    __IO uint32_t Reserved4[12];                                                ///< Reserved
    __IO uint32_t CONNCLUXCFG[4];                                               ///< Connection channel CLUx configuration registeroffset: 0x1C0
} MDS_Type;

