AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define MDS_CONNCLUXCFG_INV3_SHIFT              (11)
#define MDS_CONNCLUXCFG_INV3_MASK               (0x01U << MDS_CONNCLUXCFG_INV3_SHIFT)
#define MDS_CONNCLUXCFG_INV3(x)                 (((uint32_t)(((uint32_t)(x)) << MDS_CONNCLUXCFG_INV3_SHIFT)) & MDS_CONNCLUXCFG_INV3_MASK)

#define MDS_CONNCLUXCFG_INV2_SHIFT              (10)
#define MDS_CONNCLUXCFG_INV2_MASK               (0x01U << MDS_CONNCLUXCFG_INV2_SHIFT)
#define MDS_CONNCLUXCFG_INV2(x)                 (((uint32_t)(((uint32_t)(x)) << MDS_CONNCLUXCFG_INV2_SHIFT)) & MDS_CONNCLUXCFG_INV2_MASK)

#define MDS_CONNCLUXCFG_INV1_SHIFT              (9)
#define MDS_CONNCLUXCFG_INV1_MASK               (0x01U << MDS_CONNCLUXCFG_INV1_SHIFT)
#define MDS_CONNCLUXCFG_INV1(x)                 (((uint32_t)(((uint32_t)(x)) << MDS_CONNCLUXCFG_INV1_SHIFT)) & MDS_CONNCLUXCFG_INV1_MASK)

#define MDS_CONNCLUXCFG_INV0_SHIFT              (8)
#define MDS_CONNCLUXCFG_INV0_MASK               (0x01U << MDS_CONNCLUXCFG_INV0_SHIFT)
#define MDS_CONNCLUXCFG_INV0(x)                 (((uint32_t)(((uint32_t)(x)) << MDS_CONNCLUXCFG_INV0_SHIFT)) & MDS_CONNCLUXCFG_INV0_MASK)

#define MDS_CONNCLUXCFG_CLMODE_SHIFT            (0)
#define MDS_CONNCLUXCFG_CLMODE_MASK             (0x3U << MDS_CONNCLUXCFG_CLMODE_SHIFT)
#define MDS_CONNCLUXCFG_CLMODE(x)               (((uint32_t)(((uint32_t)(x)) << MDS_CONNCLUXCFG_CLMODE_SHIFT)) & MDS_CONNCLUXCFG_CLMODE_MASK)

/*!
 * @}
 */ /* end of group MDS_Register_Masks */
/******************************************************************************
 *MDS Instance
*******************************************************************************/

#define MDS                  ((MDS_Type*)MDS_BASE)

/*!
 * @}
 */ /* end of group MDS_Peripheral_Access_Layer */


/*!
 * @addtogroup PWR_Peripheral_Access_Layer PWR Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * PWR Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CR1;                                                          ///< Power control register 1                     offset: 0x00
    __IO uint32_t CSR;                                                          ///< Power control status register                offset: 0x04
    __IO uint32_t CR2;                                                          ///< Power control register 2                     offset: 0x08
    __IO uint32_t CR3;                                                          ///< Power control register 3                     offset: 0x0C
    __IO uint32_t CR4;                                                          ///< Power control register 4                     offset: 0x10
    __IO uint32_t CR5;                                                          ///< Power control register 5                     offset: 0x14
    __IO uint32_t CR6;                                                          ///< Power control register 6                     offset: 0x18
    __IO uint32_t SR;                                                           ///< Power status register                        offset: 0x1C
    __IO uint32_t SCR;                                                          ///< Power status clear register                  offset: 0x20
    __IO uint32_t CFGR;                                                         ///< Power configuration register                 offset: 0x24
    __IO uint32_t Reserved0[2];                                                 ///< Reserved
    __IO uint32_t MEMCR;                                                        ///< Power supply storage control register        offset: 0x30
    __IO uint32_t PWCFGR1;                                                      ///< Power is waiting for the source configuration register 1offset: 0x34
    __IO uint32_t PWCFGR2;                                                      ///< Power is waiting for the source configuration register 2offset: 0x38
} PWR_Type;

/*******************************************************************************
 * PWR Type
 ******************************************************************************/

/*!
 * @addtogroup PWR_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief PWR_CR1 Register Bit Definition
 */

#define PWR_CR1_VOSL_SHIFT                      (14)
#define PWR_CR1_VOSL_MASK                       (0x3U << PWR_CR1_VOSL_SHIFT)
#define PWR_CR1_VOSL(x)                         (((uint32_t)(((uint32_t)(x)) << PWR_CR1_VOSL_SHIFT)) & PWR_CR1_VOSL_MASK)

#define PWR_CR1_LPR_SHIFT                       (13)
#define PWR_CR1_LPR_MASK                        (0x1U << PWR_CR1_LPR_SHIFT)
#define PWR_CR1_LPR(x)                          (((uint32_t)(((uint32_t)(x)) << PWR_CR1_LPR_SHIFT)) & PWR_CR1_LPR_MASK)

#define PWR_CR1_VOSH_SHIFT                      (8)
#define PWR_CR1_VOSH_MASK                       (0x1U << PWR_CR1_VOSH_SHIFT)
#define PWR_CR1_VOSH(x)                         (((uint32_t)(((uint32_t)(x)) << PWR_CR1_VOSH_SHIFT)) & PWR_CR1_VOSH_MASK)

#define PWR_CR1_CSBF_SHIFT                      (3)
#define PWR_CR1_CSBF_MASK                       (0x1U << PWR_CR1_CSBF_SHIFT)
#define PWR_CR1_CSBF(x)                         (((uint32_t)(((uint32_t)(x)) << PWR_CR1_CSBF_SHIFT)) & PWR_CR1_CSBF_MASK)

#define PWR_CR1_PDDS_SHIFT                      (1)
#define PWR_CR1_PDDS_MASK                       (0x1U << PWR_CR1_PDDS_SHIFT)
#define PWR_CR1_PDDS(x)                         (((uint32_t)(((uint32_t)(x)) << PWR_CR1_PDDS_SHIFT)) & PWR_CR1_PDDS_MASK)

#define PWR_CR1_LPDS_SHIFT                      (0)
#define PWR_CR1_LPDS_MASK                       (0x1U << PWR_CR1_LPDS_SHIFT)
#define PWR_CR1_LPDS(x)                         (((uint32_t)(((uint32_t)(x)) << PWR_CR1_LPDS_SHIFT)) & PWR_CR1_LPDS_MASK)

/*!
 * @brief PWR_CSR Register Bit Definition
 */

#define PWR_CSR_VOSRDY_SHIFT                    (14)
#define PWR_CSR_VOSRDY_MASK                     (0x1U << PWR_CSR_VOSRDY_SHIFT)
#define PWR_CSR_VOSRDY(x)                       (((uint32_t)(((uint32_t)(x)) << PWR_CSR_VOSRDY_SHIFT)) & PWR_CSR_VOSRDY_MASK)

