AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define PWR_CSR_SBF_SHIFT                       (1)
#define PWR_CSR_SBF_MASK                        (0x1U << PWR_CSR_SBF_SHIFT)
#define PWR_CSR_SBF(x)                          (((uint32_t)(((uint32_t)(x)) << PWR_CSR_SBF_SHIFT)) & PWR_CSR_SBF_MASK)

/*!
 * @brief PWR_CR2 Register Bit Definition
 */

#define PWR_CR2_EWUP5_SHIFT                     (5)
#define PWR_CR2_EWUP5_MASK                      (0x1U << PWR_CR2_EWUP5_SHIFT)
#define PWR_CR2_EWUP5(x)                        (((uint32_t)(((uint32_t)(x)) << PWR_CR2_EWUP5_SHIFT)) & PWR_CR2_EWUP5_MASK)

#define PWR_CR2_EWUP4_SHIFT                     (4)
#define PWR_CR2_EWUP4_MASK                      (0x1U << PWR_CR2_EWUP4_SHIFT)
#define PWR_CR2_EWUP4(x)                        (((uint32_t)(((uint32_t)(x)) << PWR_CR2_EWUP4_SHIFT)) & PWR_CR2_EWUP4_MASK)

#define PWR_CR2_EWUP3_SHIFT                     (3)
#define PWR_CR2_EWUP3_MASK                      (0x1U << PWR_CR2_EWUP3_SHIFT)
#define PWR_CR2_EWUP3(x)                        (((uint32_t)(((uint32_t)(x)) << PWR_CR2_EWUP3_SHIFT)) & PWR_CR2_EWUP3_MASK)

#define PWR_CR2_EWUP2_SHIFT                     (2)
#define PWR_CR2_EWUP2_MASK                      (0x1U << PWR_CR2_EWUP2_SHIFT)
#define PWR_CR2_EWUP2(x)                        (((uint32_t)(((uint32_t)(x)) << PWR_CR2_EWUP2_SHIFT)) & PWR_CR2_EWUP2_MASK)

#define PWR_CR2_EWUP1_SHIFT                     (1)
#define PWR_CR2_EWUP1_MASK                      (0x1U << PWR_CR2_EWUP1_SHIFT)
#define PWR_CR2_EWUP1(x)                        (((uint32_t)(((uint32_t)(x)) << PWR_CR2_EWUP1_SHIFT)) & PWR_CR2_EWUP1_MASK)

#define PWR_CR2_EWUP0_SHIFT                     (0)
#define PWR_CR2_EWUP0_MASK                      (0x1U << PWR_CR2_EWUP0_SHIFT)
#define PWR_CR2_EWUP0(x)                        (((uint32_t)(((uint32_t)(x)) << PWR_CR2_EWUP0_SHIFT)) & PWR_CR2_EWUP0_MASK)

/*!
 * @brief PWR_CR3 Register Bit Definition
 */

#define PWR_CR3_WP5_SHIFT                       (5)
#define PWR_CR3_WP5_MASK                        (0x1U << PWR_CR3_WP5_SHIFT)
#define PWR_CR3_WP5(x)                          (((uint32_t)(((uint32_t)(x)) << PWR_CR3_WP5_SHIFT)) & PWR_CR3_WP5_MASK)

#define PWR_CR3_WP4_SHIFT                       (4)
#define PWR_CR3_WP4_MASK                        (0x1U << PWR_CR3_WP4_SHIFT)
#define PWR_CR3_WP4(x)                          (((uint32_t)(((uint32_t)(x)) << PWR_CR3_WP4_SHIFT)) & PWR_CR3_WP4_MASK)

#define PWR_CR3_WP3_SHIFT                       (3)
#define PWR_CR3_WP3_MASK                        (0x1U << PWR_CR3_WP3_SHIFT)
#define PWR_CR3_WP3(x)                          (((uint32_t)(((uint32_t)(x)) << PWR_CR3_WP3_SHIFT)) & PWR_CR3_WP3_MASK)

#define PWR_CR3_WP2_SHIFT                       (2)
#define PWR_CR3_WP2_MASK                        (0x1U << PWR_CR3_WP2_SHIFT)
#define PWR_CR3_WP2(x)                          (((uint32_t)(((uint32_t)(x)) << PWR_CR3_WP2_SHIFT)) & PWR_CR3_WP2_MASK)

#define PWR_CR3_WP1_SHIFT                       (1)
#define PWR_CR3_WP1_MASK                        (0x1U << PWR_CR3_WP1_SHIFT)
#define PWR_CR3_WP1(x)                          (((uint32_t)(((uint32_t)(x)) << PWR_CR3_WP1_SHIFT)) & PWR_CR3_WP1_MASK)

#define PWR_CR3_WP0_SHIFT                       (0)
#define PWR_CR3_WP0_MASK                        (0x1U << PWR_CR3_WP0_SHIFT)
#define PWR_CR3_WP0(x)                          (((uint32_t)(((uint32_t)(x)) << PWR_CR3_WP0_SHIFT)) & PWR_CR3_WP0_MASK)

/*!
 * @brief PWR_CR4 Register Bit Definition
 */

#define PWR_CR4_FILTCNT0_SHIFT                  (8)
#define PWR_CR4_FILTCNT0_MASK                   (0xFFU << PWR_CR4_FILTCNT0_SHIFT)
#define PWR_CR4_FILTCNT0(x)                     (((uint32_t)(((uint32_t)(x)) << PWR_CR4_FILTCNT0_SHIFT)) & PWR_CR4_FILTCNT0_MASK)

#define PWR_CR4_FILTF0_SHIFT                    (4)
#define PWR_CR4_FILTF0_MASK                     (0x1U << PWR_CR4_FILTF0_SHIFT)
#define PWR_CR4_FILTF0(x)                       (((uint32_t)(((uint32_t)(x)) << PWR_CR4_FILTF0_SHIFT)) & PWR_CR4_FILTF0_MASK)

#define PWR_CR4_FILTE0_SHIFT                    (2)
#define PWR_CR4_FILTE0_MASK                     (0x3U << PWR_CR4_FILTE0_SHIFT)
#define PWR_CR4_FILTE0(x)                       (((uint32_t)(((uint32_t)(x)) << PWR_CR4_FILTE0_SHIFT)) & PWR_CR4_FILTE0_MASK)

#define PWR_CR4_FILTSEL0_SHIFT                  (0)
#define PWR_CR4_FILTSEL0_MASK                   (0x3U << PWR_CR4_FILTSEL0_SHIFT)
#define PWR_CR4_FILTSEL0(x)                     (((uint32_t)(((uint32_t)(x)) << PWR_CR4_FILTSEL0_SHIFT)) & PWR_CR4_FILTSEL0_MASK)

/*!
 * @brief PWR_CR5 Register Bit Definition
 */

#define PWR_CR5_FILTCNT1_SHIFT                  (8)
#define PWR_CR5_FILTCNT1_MASK                   (0xFFU << PWR_CR5_FILTCNT1_SHIFT)
#define PWR_CR5_FILTCNT1(x)                     (((uint32_t)(((uint32_t)(x)) << PWR_CR5_FILTCNT1_SHIFT)) & PWR_CR5_FILTCNT1_MASK)

#define PWR_CR5_FILTF1_SHIFT                    (4)
#define PWR_CR5_FILTF1_MASK                     (0x1U << PWR_CR5_FILTF1_SHIFT)
#define PWR_CR5_FILTF1(x)                       (((uint32_t)(((uint32_t)(x)) << PWR_CR5_FILTF1_SHIFT)) & PWR_CR5_FILTF1_MASK)

#define PWR_CR5_FILTE1_SHIFT                    (2)
#define PWR_CR5_FILTE1_MASK                     (0x3U << PWR_CR5_FILTE1_SHIFT)
#define PWR_CR5_FILTE1(x)                       (((uint32_t)(((uint32_t)(x)) << PWR_CR5_FILTE1_SHIFT)) & PWR_CR5_FILTE1_MASK)

#define PWR_CR5_FILTSEL1_SHIFT                  (0)
#define PWR_CR5_FILTSEL1_MASK                   (0x3U << PWR_CR5_FILTSEL1_SHIFT)
#define PWR_CR5_FILTSEL1(x)                     (((uint32_t)(((uint32_t)(x)) << PWR_CR5_FILTSEL1_SHIFT)) & PWR_CR5_FILTSEL1_MASK)

/*!
 * @brief PWR_CR6 Register Bit Definition
 */

#define PWR_CR6_STDBYFSWK_SHIFT                 (0)
#define PWR_CR6_STDBYFSWK_MASK                  (0x7U << PWR_CR6_STDBYFSWK_SHIFT)
#define PWR_CR6_STDBYFSWK(x)                    (((uint32_t)(((uint32_t)(x)) << PWR_CR6_STDBYFSWK_SHIFT)) & PWR_CR6_STDBYFSWK_MASK)

/*!
 * @brief PWR_SR Register Bit Definition
 */

#define PWR_SR_WUF5_SHIFT                       (5)
#define PWR_SR_WUF5_MASK                        (0x1U << PWR_SR_WUF5_SHIFT)
#define PWR_SR_WUF5(x)                          (((uint32_t)(((uint32_t)(x)) << PWR_SR_WUF5_SHIFT)) & PWR_SR_WUF5_MASK)

#define PWR_SR_WUF4_SHIFT                       (4)
#define PWR_SR_WUF4_MASK                        (0x1U << PWR_SR_WUF4_SHIFT)
#define PWR_SR_WUF4(x)                          (((uint32_t)(((uint32_t)(x)) << PWR_SR_WUF4_SHIFT)) & PWR_SR_WUF4_MASK)

#define PWR_SR_WUF3_SHIFT                       (3)
#define PWR_SR_WUF3_MASK                        (0x1U << PWR_SR_WUF3_SHIFT)
#define PWR_SR_WUF3(x)                          (((uint32_t)(((uint32_t)(x)) << PWR_SR_WUF3_SHIFT)) & PWR_SR_WUF3_MASK)

#define PWR_SR_WUF2_SHIFT                       (2)
#define PWR_SR_WUF2_MASK                        (0x1U << PWR_SR_WUF2_SHIFT)
#define PWR_SR_WUF2(x)                          (((uint32_t)(((uint32_t)(x)) << PWR_SR_WUF2_SHIFT)) & PWR_SR_WUF2_MASK)

#define PWR_SR_WUF1_SHIFT                       (1)
#define PWR_SR_WUF1_MASK                        (0x1U << PWR_SR_WUF1_SHIFT)
#define PWR_SR_WUF1(x)                          (((uint32_t)(((uint32_t)(x)) << PWR_SR_WUF1_SHIFT)) & PWR_SR_WUF1_MASK)

#define PWR_SR_WUF0_SHIFT                       (0)
#define PWR_SR_WUF0_MASK                        (0x1U << PWR_SR_WUF0_SHIFT)
#define PWR_SR_WUF0(x)                          (((uint32_t)(((uint32_t)(x)) << PWR_SR_WUF0_SHIFT)) & PWR_SR_WUF0_MASK)

/*!
 * @brief PWR_SCR Register Bit Definition
 */

#define PWR_SCR_CWUF5_SHIFT                     (5)
#define PWR_SCR_CWUF5_MASK                      (0x1U << PWR_SCR_CWUF5_SHIFT)
#define PWR_SCR_CWUF5(x)                        (((uint32_t)(((uint32_t)(x)) << PWR_SCR_CWUF5_SHIFT)) & PWR_SCR_CWUF5_MASK)

#define PWR_SCR_CWUF4_SHIFT                     (4)
#define PWR_SCR_CWUF4_MASK                      (0x1U << PWR_SCR_CWUF4_SHIFT)
#define PWR_SCR_CWUF4(x)                        (((uint32_t)(((uint32_t)(x)) << PWR_SCR_CWUF4_SHIFT)) & PWR_SCR_CWUF4_MASK)

#define PWR_SCR_CWUF3_SHIFT                     (3)
#define PWR_SCR_CWUF3_MASK                      (0x1U << PWR_SCR_CWUF3_SHIFT)
#define PWR_SCR_CWUF3(x)                        (((uint32_t)(((uint32_t)(x)) << PWR_SCR_CWUF3_SHIFT)) & PWR_SCR_CWUF3_MASK)

#define PWR_SCR_CWUF2_SHIFT                     (2)
#define PWR_SCR_CWUF2_MASK                      (0x1U << PWR_SCR_CWUF2_SHIFT)
#define PWR_SCR_CWUF2(x)                        (((uint32_t)(((uint32_t)(x)) << PWR_SCR_CWUF2_SHIFT)) & PWR_SCR_CWUF2_MASK)

#define PWR_SCR_CWUF1_SHIFT                     (1)
#define PWR_SCR_CWUF1_MASK                      (0x1U << PWR_SCR_CWUF1_SHIFT)
#define PWR_SCR_CWUF1(x)                        (((uint32_t)(((uint32_t)(x)) << PWR_SCR_CWUF1_SHIFT)) & PWR_SCR_CWUF1_MASK)

#define PWR_SCR_CWUF0_SHIFT                     (0)
#define PWR_SCR_CWUF0_MASK                      (0x1U << PWR_SCR_CWUF0_SHIFT)
#define PWR_SCR_CWUF0(x)                        (((uint32_t)(((uint32_t)(x)) << PWR_SCR_CWUF0_SHIFT)) & PWR_SCR_CWUF0_MASK)

/*!
 * @brief PWR_CFGR Register Bit Definition
 */

#define PWR_CFGR_LSICAL_SHIFT                   (5)
#define PWR_CFGR_LSICAL_MASK                    (0x1FU << PWR_CFGR_LSICAL_SHIFT)
#define PWR_CFGR_LSICAL(x)                      (((uint32_t)(((uint32_t)(x)) << PWR_CFGR_LSICAL_SHIFT)) & PWR_CFGR_LSICAL_MASK)

#define PWR_CFGR_LSICALSEL_SHIFT                (0)
#define PWR_CFGR_LSICALSEL_MASK                 (0x1FU << PWR_CFGR_LSICALSEL_SHIFT)
#define PWR_CFGR_LSICALSEL(x)                   (((uint32_t)(((uint32_t)(x)) << PWR_CFGR_LSICALSEL_SHIFT)) & PWR_CFGR_LSICALSEL_MASK)

/*!
 * @brief PWR_MEMCR Register Bit Definition
 */

#define PWR_MEMCR_CANRAMRETEN_SHIFT             (15)
#define PWR_MEMCR_CANRAMRETEN_MASK              (0x1U << PWR_MEMCR_CANRAMRETEN_SHIFT)
#define PWR_MEMCR_CANRAMRETEN(x)                (((uint32_t)(((uint32_t)(x)) << PWR_MEMCR_CANRAMRETEN_SHIFT)) & PWR_MEMCR_CANRAMRETEN_MASK)

#define PWR_MEMCR_CCRAMRETEN_SHIFT              (14)
#define PWR_MEMCR_CCRAMRETEN_MASK               (0x1U << PWR_MEMCR_CCRAMRETEN_SHIFT)
#define PWR_MEMCR_CCRAMRETEN(x)                 (((uint32_t)(((uint32_t)(x)) << PWR_MEMCR_CCRAMRETEN_SHIFT)) & PWR_MEMCR_CCRAMRETEN_MASK)

#define PWR_MEMCR_SRAMRETEN_SHIFT               (13)
#define PWR_MEMCR_SRAMRETEN_MASK                (0x1U << PWR_MEMCR_SRAMRETEN_SHIFT)
#define PWR_MEMCR_SRAMRETEN(x)                  (((uint32_t)(((uint32_t)(x)) << PWR_MEMCR_SRAMRETEN_SHIFT)) & PWR_MEMCR_SRAMRETEN_MASK)

#define PWR_MEMCR_FDPSTOPEN_SHIFT               (6)
#define PWR_MEMCR_FDPSTOPEN_MASK                (0x1U << PWR_MEMCR_FDPSTOPEN_SHIFT)
#define PWR_MEMCR_FDPSTOPEN(x)                  (((uint32_t)(((uint32_t)(x)) << PWR_MEMCR_FDPSTOPEN_SHIFT)) & PWR_MEMCR_FDPSTOPEN_MASK)

#define PWR_MEMCR_FFWUPEN_SHIFT                 (5)
#define PWR_MEMCR_FFWUPEN_MASK                  (0x1U << PWR_MEMCR_FFWUPEN_SHIFT)
#define PWR_MEMCR_FFWUPEN(x)                    (((uint32_t)(((uint32_t)(x)) << PWR_MEMCR_FFWUPEN_SHIFT)) & PWR_MEMCR_FFWUPEN_MASK)

#define PWR_MEMCR_MEMLOCK_SHIFT                 (0)
#define PWR_MEMCR_MEMLOCK_MASK                  (0x1FU << PWR_MEMCR_MEMLOCK_SHIFT)
#define PWR_MEMCR_MEMLOCK(x)                    (((uint32_t)(((uint32_t)(x)) << PWR_MEMCR_MEMLOCK_SHIFT)) & PWR_MEMCR_MEMLOCK_MASK)

/*!
 * @brief PWR_PWCFGR1 Register Bit Definition
 */

