AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define PWR_PWCFGR1_LDOWAIT_SHIFT               (5)
#define PWR_PWCFGR1_LDOWAIT_MASK                (0xFFU << PWR_PWCFGR1_LDOWAIT_SHIFT)
#define PWR_PWCFGR1_LDOWAIT(x)                  (((uint32_t)(((uint32_t)(x)) << PWR_PWCFGR1_LDOWAIT_SHIFT)) & PWR_PWCFGR1_LDOWAIT_MASK)

#define PWR_PWCFGR1_LDOWAITLOCK_SHIFT           (0)
#define PWR_PWCFGR1_LDOWAITLOCK_MASK            (0x1FU << PWR_PWCFGR1_LDOWAITLOCK_SHIFT)
#define PWR_PWCFGR1_LDOWAITLOCK(x)              (((uint32_t)(((uint32_t)(x)) << PWR_PWCFGR1_LDOWAITLOCK_SHIFT)) & PWR_PWCFGR1_LDOWAITLOCK_MASK)

/*!
 * @brief PWR_PWCFGR2 Register Bit Definition
 */

#define PWR_PWCFGR2_LDOWAITFWUP_SHIFT           (5)
#define PWR_PWCFGR2_LDOWAITFWUP_MASK            (0xFFU << PWR_PWCFGR2_LDOWAITFWUP_SHIFT)
#define PWR_PWCFGR2_LDOWAITFWUP(x)              (((uint32_t)(((uint32_t)(x)) << PWR_PWCFGR2_LDOWAITFWUP_SHIFT)) & PWR_PWCFGR2_LDOWAITFWUP_MASK)

#define PWR_PWCFGR2_LDOWAITFWUPLOCK_SHIFT       (0)
#define PWR_PWCFGR2_LDOWAITFWUPLOCK_MASK        (0x1FU << PWR_PWCFGR2_LDOWAITFWUPLOCK_SHIFT)
#define PWR_PWCFGR2_LDOWAITFWUPLOCK(x)          (((uint32_t)(((uint32_t)(x)) << PWR_PWCFGR2_LDOWAITFWUPLOCK_SHIFT)) & PWR_PWCFGR2_LDOWAITFWUPLOCK_MASK)

/*!
 * @}
 */ /* end of group PWR_Register_Masks */
/******************************************************************************
 *PWR Instance
*******************************************************************************/

#define PWR                  ((PWR_Type*)PWR_BASE)

/*!
 * @}
 */ /* end of group PWR_Peripheral_Access_Layer */





/*!
 * @addtogroup RCC_Peripheral_Access_Layer RCC Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * RCC Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CR;                                                           ///< Clock Control Register                       offset: 0x00
    __IO uint32_t CFGR;                                                         ///< Clock Configuration Register                 offset: 0x04
    __IO uint32_t CIR;                                                          ///< Clock Interrupt Register                     offset: 0x08
    __IO uint32_t Reserved0[2];                                                 ///< Reserved
    __IO uint32_t AHBRSTR;                                                      ///< AHB Peripheral Reset Register                offset: 0x14
    __IO uint32_t APB2RSTR;                                                     ///< APB2 Peripheral Reset Register               offset: 0x18
    __IO uint32_t APB1RSTR;                                                     ///< APB1 Peripheral Reset Register               offset: 0x1C
    __IO uint32_t Reserved1[2];                                                 ///< Reserved
    __IO uint32_t AHBENR;                                                       ///< AHB Peripheral Clock Enable Register         offset: 0x28
    __IO uint32_t APB2ENR;                                                      ///< APB2 Peripheral Clock Enable Register        offset: 0x2C
    __IO uint32_t APB1ENR;                                                      ///< APB1 Peripheral Clock Enable Register        offset: 0x30
    __IO uint32_t BDCR;                                                         ///< Backup Domain Control Register               offset: 0x34
    __IO uint32_t CSR;                                                          ///< Control Status Register                      offset: 0x38
    __IO uint32_t SYSCFG;                                                       ///< System Configuration Register                offset: 0x3C
    __IO uint32_t CFGR2;                                                        ///< Clock Configuration Register 2               offset: 0x40
    __IO uint32_t ICSCR;                                                        ///< Internal Clock Source Calibration Register   offset: 0x44
    __IO uint32_t PLL1CFGR;                                                     ///< PLL1 Configuration Register                  offset: 0x48
    __IO uint32_t PLL2CFGR;                                                     ///< PLL2 Configuration Register                  offset: 0x4C
    __IO uint32_t Reserved2[4];                                                 ///< Reserved
    __IO uint32_t ADC1CFGR;                                                     ///< ADC1 Configuration Register                  offset: 0x60
    __IO uint32_t ADC2CFGR;                                                     ///< ADC2 Configuration Register                  offset: 0x64
    __IO uint32_t Reserved3[2];                                                 ///< Reserved
    __IO uint32_t DACCFGR;                                                      ///< DAC Configuration Register                   offset: 0x70
    __IO uint32_t Reserved4[2];                                                 ///< Reserved
    __IO uint32_t TPIUCFGR;                                                     ///< TPIU Configuration Register                  offset: 0x7C
} RCC_Type;

/*******************************************************************************
 * RCC Type
 ******************************************************************************/

/*!
 * @addtogroup RCC_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief RCC_CR Register Bit Definition
 */

#define RCC_CR_PLL2RDY_SHIFT                    (29)
#define RCC_CR_PLL2RDY_MASK                     (0x1U << RCC_CR_PLL2RDY_SHIFT)
#define RCC_CR_PLL2RDY(x)                       (((uint32_t)(((uint32_t)(x)) << RCC_CR_PLL2RDY_SHIFT)) & RCC_CR_PLL2RDY_MASK)

#define RCC_CR_PLL2ON_SHIFT                     (28)
#define RCC_CR_PLL2ON_MASK                      (0x1U << RCC_CR_PLL2ON_SHIFT)
#define RCC_CR_PLL2ON(x)                        (((uint32_t)(((uint32_t)(x)) << RCC_CR_PLL2ON_SHIFT)) & RCC_CR_PLL2ON_MASK)

#define RCC_CR_PLL1RDY_SHIFT                    (25)
#define RCC_CR_PLL1RDY_MASK                     (0x1U << RCC_CR_PLL1RDY_SHIFT)
#define RCC_CR_PLL1RDY(x)                       (((uint32_t)(((uint32_t)(x)) << RCC_CR_PLL1RDY_SHIFT)) & RCC_CR_PLL1RDY_MASK)

#define RCC_CR_PLL1ON_SHIFT                     (24)
#define RCC_CR_PLL1ON_MASK                      (0x1U << RCC_CR_PLL1ON_SHIFT)
#define RCC_CR_PLL1ON(x)                        (((uint32_t)(((uint32_t)(x)) << RCC_CR_PLL1ON_SHIFT)) & RCC_CR_PLL1ON_MASK)

