AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define RCC_CIR_HSERDYIE_SHIFT                  (11)
#define RCC_CIR_HSERDYIE_MASK                   (0x1U << RCC_CIR_HSERDYIE_SHIFT)
#define RCC_CIR_HSERDYIE(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_CIR_HSERDYIE_SHIFT)) & RCC_CIR_HSERDYIE_MASK)

#define RCC_CIR_HSIRDYIE_SHIFT                  (10)
#define RCC_CIR_HSIRDYIE_MASK                   (0x1U << RCC_CIR_HSIRDYIE_SHIFT)
#define RCC_CIR_HSIRDYIE(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_CIR_HSIRDYIE_SHIFT)) & RCC_CIR_HSIRDYIE_MASK)

#define RCC_CIR_LSERDYIE_SHIFT                  (9)
#define RCC_CIR_LSERDYIE_MASK                   (0x1U << RCC_CIR_LSERDYIE_SHIFT)
#define RCC_CIR_LSERDYIE(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_CIR_LSERDYIE_SHIFT)) & RCC_CIR_LSERDYIE_MASK)

#define RCC_CIR_LSIRDYIE_SHIFT                  (8)
#define RCC_CIR_LSIRDYIE_MASK                   (0x1U << RCC_CIR_LSIRDYIE_SHIFT)
#define RCC_CIR_LSIRDYIE(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_CIR_LSIRDYIE_SHIFT)) & RCC_CIR_LSIRDYIE_MASK)

#define RCC_CIR_CSSF_SHIFT                      (7)
#define RCC_CIR_CSSF_MASK                       (0x1U << RCC_CIR_CSSF_SHIFT)
#define RCC_CIR_CSSF(x)                         (((uint32_t)(((uint32_t)(x)) << RCC_CIR_CSSF_SHIFT)) & RCC_CIR_CSSF_MASK)

#define RCC_CIR_PLL2RDYF_SHIFT                  (5)
#define RCC_CIR_PLL2RDYF_MASK                   (0x1U << RCC_CIR_PLL2RDYF_SHIFT)
#define RCC_CIR_PLL2RDYF(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_CIR_PLL2RDYF_SHIFT)) & RCC_CIR_PLL2RDYF_MASK)

#define RCC_CIR_PLL1RDYF_SHIFT                  (4)
#define RCC_CIR_PLL1RDYF_MASK                   (0x1U << RCC_CIR_PLL1RDYF_SHIFT)
#define RCC_CIR_PLL1RDYF(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_CIR_PLL1RDYF_SHIFT)) & RCC_CIR_PLL1RDYF_MASK)

#define RCC_CIR_HSERDYF_SHIFT                   (3)
#define RCC_CIR_HSERDYF_MASK                    (0x1U << RCC_CIR_HSERDYF_SHIFT)
#define RCC_CIR_HSERDYF(x)                      (((uint32_t)(((uint32_t)(x)) << RCC_CIR_HSERDYF_SHIFT)) & RCC_CIR_HSERDYF_MASK)

#define RCC_CIR_HSIRDYF_SHIFT                   (2)
#define RCC_CIR_HSIRDYF_MASK                    (0x1U << RCC_CIR_HSIRDYF_SHIFT)
#define RCC_CIR_HSIRDYF(x)                      (((uint32_t)(((uint32_t)(x)) << RCC_CIR_HSIRDYF_SHIFT)) & RCC_CIR_HSIRDYF_MASK)

#define RCC_CIR_LSERDYF_SHIFT                   (1)
#define RCC_CIR_LSERDYF_MASK                    (0x1U << RCC_CIR_LSERDYF_SHIFT)
#define RCC_CIR_LSERDYF(x)                      (((uint32_t)(((uint32_t)(x)) << RCC_CIR_LSERDYF_SHIFT)) & RCC_CIR_LSERDYF_MASK)

#define RCC_CIR_LSIRDYF_SHIFT                   (0)
#define RCC_CIR_LSIRDYF_MASK                    (0x1U << RCC_CIR_LSIRDYF_SHIFT)
#define RCC_CIR_LSIRDYF(x)                      (((uint32_t)(((uint32_t)(x)) << RCC_CIR_LSIRDYF_SHIFT)) & RCC_CIR_LSIRDYF_MASK)

/*!
 * @brief RCC_AHBRSTR Register Bit Definition
 */

#define RCC_AHBRSTR_USBFS_SHIFT                 (24)
#define RCC_AHBRSTR_USBFS_MASK                  (0x1U << RCC_AHBRSTR_USBFS_SHIFT)
#define RCC_AHBRSTR_USBFS(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_AHBRSTR_USBFS_SHIFT)) & RCC_AHBRSTR_USBFS_MASK)

#define RCC_AHBRSTR_DMA2_SHIFT                  (22)
#define RCC_AHBRSTR_DMA2_MASK                   (0x1U << RCC_AHBRSTR_DMA2_SHIFT)
#define RCC_AHBRSTR_DMA2(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_AHBRSTR_DMA2_SHIFT)) & RCC_AHBRSTR_DMA2_MASK)

#define RCC_AHBRSTR_DMA1_SHIFT                  (21)
#define RCC_AHBRSTR_DMA1_MASK                   (0x1U << RCC_AHBRSTR_DMA1_SHIFT)
#define RCC_AHBRSTR_DMA1(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_AHBRSTR_DMA1_SHIFT)) & RCC_AHBRSTR_DMA1_MASK)

#define RCC_AHBRSTR_CORDIC_SHIFT                (15)
#define RCC_AHBRSTR_CORDIC_MASK                 (0x1U << RCC_AHBRSTR_CORDIC_SHIFT)
#define RCC_AHBRSTR_CORDIC(x)                   (((uint32_t)(((uint32_t)(x)) << RCC_AHBRSTR_CORDIC_SHIFT)) & RCC_AHBRSTR_CORDIC_MASK)

#define RCC_AHBRSTR_CRC_SHIFT                   (12)
#define RCC_AHBRSTR_CRC_MASK                    (0x1U << RCC_AHBRSTR_CRC_SHIFT)
#define RCC_AHBRSTR_CRC(x)                      (((uint32_t)(((uint32_t)(x)) << RCC_AHBRSTR_CRC_SHIFT)) & RCC_AHBRSTR_CRC_MASK)

#define RCC_AHBRSTR_GPIOI_SHIFT                 (8)
#define RCC_AHBRSTR_GPIOI_MASK                  (0x1U << RCC_AHBRSTR_GPIOI_SHIFT)
#define RCC_AHBRSTR_GPIOI(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_AHBRSTR_GPIOI_SHIFT)) & RCC_AHBRSTR_GPIOI_MASK)

#define RCC_AHBRSTR_GPIOH_SHIFT                 (7)
#define RCC_AHBRSTR_GPIOH_MASK                  (0x1U << RCC_AHBRSTR_GPIOH_SHIFT)
#define RCC_AHBRSTR_GPIOH(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_AHBRSTR_GPIOH_SHIFT)) & RCC_AHBRSTR_GPIOH_MASK)

#define RCC_AHBRSTR_GPIOD_SHIFT                 (3)
#define RCC_AHBRSTR_GPIOD_MASK                  (0x1U << RCC_AHBRSTR_GPIOD_SHIFT)
#define RCC_AHBRSTR_GPIOD(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_AHBRSTR_GPIOD_SHIFT)) & RCC_AHBRSTR_GPIOD_MASK)

#define RCC_AHBRSTR_GPIOC_SHIFT                 (2)
#define RCC_AHBRSTR_GPIOC_MASK                  (0x1U << RCC_AHBRSTR_GPIOC_SHIFT)
#define RCC_AHBRSTR_GPIOC(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_AHBRSTR_GPIOC_SHIFT)) & RCC_AHBRSTR_GPIOC_MASK)

#define RCC_AHBRSTR_GPIOB_SHIFT                 (1)
#define RCC_AHBRSTR_GPIOB_MASK                  (0x1U << RCC_AHBRSTR_GPIOB_SHIFT)
#define RCC_AHBRSTR_GPIOB(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_AHBRSTR_GPIOB_SHIFT)) & RCC_AHBRSTR_GPIOB_MASK)

#define RCC_AHBRSTR_GPIOA_SHIFT                 (0)
#define RCC_AHBRSTR_GPIOA_MASK                  (0x1U << RCC_AHBRSTR_GPIOA_SHIFT)
#define RCC_AHBRSTR_GPIOA(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_AHBRSTR_GPIOA_SHIFT)) & RCC_AHBRSTR_GPIOA_MASK)

/*!
 * @brief RCC_APB2RSTR Register Bit Definition
 */

#define RCC_APB2RSTR_LPUART_SHIFT               (31)
#define RCC_APB2RSTR_LPUART_MASK                (0x1U << RCC_APB2RSTR_LPUART_SHIFT)
#define RCC_APB2RSTR_LPUART(x)                  (((uint32_t)(((uint32_t)(x)) << RCC_APB2RSTR_LPUART_SHIFT)) & RCC_APB2RSTR_LPUART_MASK)

