AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define RCC_APB1RSTR_WWDG_SHIFT                 (11)
#define RCC_APB1RSTR_WWDG_MASK                  (0x1U << RCC_APB1RSTR_WWDG_SHIFT)
#define RCC_APB1RSTR_WWDG(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_APB1RSTR_WWDG_SHIFT)) & RCC_APB1RSTR_WWDG_MASK)

#define RCC_APB1RSTR_I3C_SHIFT                  (8)
#define RCC_APB1RSTR_I3C_MASK                   (0x1U << RCC_APB1RSTR_I3C_SHIFT)
#define RCC_APB1RSTR_I3C(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_APB1RSTR_I3C_SHIFT)) & RCC_APB1RSTR_I3C_MASK)

#define RCC_APB1RSTR_TIM7_SHIFT                 (5)
#define RCC_APB1RSTR_TIM7_MASK                  (0x1U << RCC_APB1RSTR_TIM7_SHIFT)
#define RCC_APB1RSTR_TIM7(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_APB1RSTR_TIM7_SHIFT)) & RCC_APB1RSTR_TIM7_MASK)

#define RCC_APB1RSTR_TIM6_SHIFT                 (4)
#define RCC_APB1RSTR_TIM6_MASK                  (0x1U << RCC_APB1RSTR_TIM6_SHIFT)
#define RCC_APB1RSTR_TIM6(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_APB1RSTR_TIM6_SHIFT)) & RCC_APB1RSTR_TIM6_MASK)

#define RCC_APB1RSTR_TIM5_SHIFT                 (3)
#define RCC_APB1RSTR_TIM5_MASK                  (0x1U << RCC_APB1RSTR_TIM5_SHIFT)
#define RCC_APB1RSTR_TIM5(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_APB1RSTR_TIM5_SHIFT)) & RCC_APB1RSTR_TIM5_MASK)

#define RCC_APB1RSTR_TIM4_SHIFT                 (2)
#define RCC_APB1RSTR_TIM4_MASK                  (0x1U << RCC_APB1RSTR_TIM4_SHIFT)
#define RCC_APB1RSTR_TIM4(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_APB1RSTR_TIM4_SHIFT)) & RCC_APB1RSTR_TIM4_MASK)

#define RCC_APB1RSTR_TIM3_SHIFT                 (1)
#define RCC_APB1RSTR_TIM3_MASK                  (0x1U << RCC_APB1RSTR_TIM3_SHIFT)
#define RCC_APB1RSTR_TIM3(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_APB1RSTR_TIM3_SHIFT)) & RCC_APB1RSTR_TIM3_MASK)

#define RCC_APB1RSTR_TIM2_SHIFT                 (0)
#define RCC_APB1RSTR_TIM2_MASK                  (0x1U << RCC_APB1RSTR_TIM2_SHIFT)
#define RCC_APB1RSTR_TIM2(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_APB1RSTR_TIM2_SHIFT)) & RCC_APB1RSTR_TIM2_MASK)

/*!
 * @brief RCC_AHBENR Register Bit Definition
 */

#define RCC_AHBENR_USBFS_SHIFT                  (24)
#define RCC_AHBENR_USBFS_MASK                   (0x1U << RCC_AHBENR_USBFS_SHIFT)
#define RCC_AHBENR_USBFS(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_AHBENR_USBFS_SHIFT)) & RCC_AHBENR_USBFS_MASK)

#define RCC_AHBENR_DMA2_SHIFT                   (22)
#define RCC_AHBENR_DMA2_MASK                    (0x1U << RCC_AHBENR_DMA2_SHIFT)
#define RCC_AHBENR_DMA2(x)                      (((uint32_t)(((uint32_t)(x)) << RCC_AHBENR_DMA2_SHIFT)) & RCC_AHBENR_DMA2_MASK)

#define RCC_AHBENR_DMA1_SHIFT                   (21)
#define RCC_AHBENR_DMA1_MASK                    (0x1U << RCC_AHBENR_DMA1_SHIFT)
#define RCC_AHBENR_DMA1(x)                      (((uint32_t)(((uint32_t)(x)) << RCC_AHBENR_DMA1_SHIFT)) & RCC_AHBENR_DMA1_MASK)

#define RCC_AHBENR_CORDIC_SHIFT                 (15)
#define RCC_AHBENR_CORDIC_MASK                  (0x1U << RCC_AHBENR_CORDIC_SHIFT)
#define RCC_AHBENR_CORDIC(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_AHBENR_CORDIC_SHIFT)) & RCC_AHBENR_CORDIC_MASK)

#define RCC_AHBENR_SRAM_SHIFT                   (14)
#define RCC_AHBENR_SRAM_MASK                    (0x1U << RCC_AHBENR_SRAM_SHIFT)
#define RCC_AHBENR_SRAM(x)                      (((uint32_t)(((uint32_t)(x)) << RCC_AHBENR_SRAM_SHIFT)) & RCC_AHBENR_SRAM_MASK)

#define RCC_AHBENR_FLASH_SHIFT                  (13)
#define RCC_AHBENR_FLASH_MASK                   (0x1U << RCC_AHBENR_FLASH_SHIFT)
#define RCC_AHBENR_FLASH(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_AHBENR_FLASH_SHIFT)) & RCC_AHBENR_FLASH_MASK)

#define RCC_AHBENR_CRC_SHIFT                    (12)
#define RCC_AHBENR_CRC_MASK                     (0x1U << RCC_AHBENR_CRC_SHIFT)
#define RCC_AHBENR_CRC(x)                       (((uint32_t)(((uint32_t)(x)) << RCC_AHBENR_CRC_SHIFT)) & RCC_AHBENR_CRC_MASK)

#define RCC_AHBENR_GPIOI_SHIFT                  (8)
#define RCC_AHBENR_GPIOI_MASK                   (0x1U << RCC_AHBENR_GPIOI_SHIFT)
#define RCC_AHBENR_GPIOI(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_AHBENR_GPIOI_SHIFT)) & RCC_AHBENR_GPIOI_MASK)

#define RCC_AHBENR_GPIOH_SHIFT                  (7)
#define RCC_AHBENR_GPIOH_MASK                   (0x1U << RCC_AHBENR_GPIOH_SHIFT)
#define RCC_AHBENR_GPIOH(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_AHBENR_GPIOH_SHIFT)) & RCC_AHBENR_GPIOH_MASK)

#define RCC_AHBENR_GPIOD_SHIFT                  (3)
#define RCC_AHBENR_GPIOD_MASK                   (0x1U << RCC_AHBENR_GPIOD_SHIFT)
#define RCC_AHBENR_GPIOD(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_AHBENR_GPIOD_SHIFT)) & RCC_AHBENR_GPIOD_MASK)

#define RCC_AHBENR_GPIOC_SHIFT                  (2)
#define RCC_AHBENR_GPIOC_MASK                   (0x1U << RCC_AHBENR_GPIOC_SHIFT)
#define RCC_AHBENR_GPIOC(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_AHBENR_GPIOC_SHIFT)) & RCC_AHBENR_GPIOC_MASK)

#define RCC_AHBENR_GPIOB_SHIFT                  (1)
#define RCC_AHBENR_GPIOB_MASK                   (0x1U << RCC_AHBENR_GPIOB_SHIFT)
#define RCC_AHBENR_GPIOB(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_AHBENR_GPIOB_SHIFT)) & RCC_AHBENR_GPIOB_MASK)

#define RCC_AHBENR_GPIOA_SHIFT                  (0)
#define RCC_AHBENR_GPIOA_MASK                   (0x1U << RCC_AHBENR_GPIOA_SHIFT)
#define RCC_AHBENR_GPIOA(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_AHBENR_GPIOA_SHIFT)) & RCC_AHBENR_GPIOA_MASK)

/*!
 * @brief RCC_APB2ENR Register Bit Definition
 */

#define RCC_APB2ENR_LPUART_SHIFT                (31)
#define RCC_APB2ENR_LPUART_MASK                 (0x1U << RCC_APB2ENR_LPUART_SHIFT)
#define RCC_APB2ENR_LPUART(x)                   (((uint32_t)(((uint32_t)(x)) << RCC_APB2ENR_LPUART_SHIFT)) & RCC_APB2ENR_LPUART_MASK)

#define RCC_APB2ENR_LPTIM_SHIFT                 (30)
#define RCC_APB2ENR_LPTIM_MASK                  (0x1U << RCC_APB2ENR_LPTIM_SHIFT)
#define RCC_APB2ENR_LPTIM(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_APB2ENR_LPTIM_SHIFT)) & RCC_APB2ENR_LPTIM_MASK)

#define RCC_APB2ENR_MDS_SHIFT                   (28)
#define RCC_APB2ENR_MDS_MASK                    (0x1U << RCC_APB2ENR_MDS_SHIFT)
#define RCC_APB2ENR_MDS(x)                      (((uint32_t)(((uint32_t)(x)) << RCC_APB2ENR_MDS_SHIFT)) & RCC_APB2ENR_MDS_MASK)

#define RCC_APB2ENR_USART_SHIFT                 (20)
#define RCC_APB2ENR_USART_MASK                  (0x1U << RCC_APB2ENR_USART_SHIFT)
#define RCC_APB2ENR_USART(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_APB2ENR_USART_SHIFT)) & RCC_APB2ENR_USART_MASK)

#define RCC_APB2ENR_COMP_SHIFT                  (15)
#define RCC_APB2ENR_COMP_MASK                   (0x1U << RCC_APB2ENR_COMP_SHIFT)
#define RCC_APB2ENR_COMP(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_APB2ENR_COMP_SHIFT)) & RCC_APB2ENR_COMP_MASK)

#define RCC_APB2ENR_SYSCFG_SHIFT                (14)
#define RCC_APB2ENR_SYSCFG_MASK                 (0x1U << RCC_APB2ENR_SYSCFG_SHIFT)
#define RCC_APB2ENR_SYSCFG(x)                   (((uint32_t)(((uint32_t)(x)) << RCC_APB2ENR_SYSCFG_SHIFT)) & RCC_APB2ENR_SYSCFG_MASK)

#define RCC_APB2ENR_SPI1_SHIFT                  (12)
#define RCC_APB2ENR_SPI1_MASK                   (0x1U << RCC_APB2ENR_SPI1_SHIFT)
#define RCC_APB2ENR_SPI1(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_APB2ENR_SPI1_SHIFT)) & RCC_APB2ENR_SPI1_MASK)

#define RCC_APB2ENR_ADC2_SHIFT                  (9)
#define RCC_APB2ENR_ADC2_MASK                   (0x1U << RCC_APB2ENR_ADC2_SHIFT)
#define RCC_APB2ENR_ADC2(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_APB2ENR_ADC2_SHIFT)) & RCC_APB2ENR_ADC2_MASK)

#define RCC_APB2ENR_ADC1_SHIFT                  (8)
#define RCC_APB2ENR_ADC1_MASK                   (0x1U << RCC_APB2ENR_ADC1_SHIFT)
#define RCC_APB2ENR_ADC1(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_APB2ENR_ADC1_SHIFT)) & RCC_APB2ENR_ADC1_MASK)

#define RCC_APB2ENR_UART1_SHIFT                 (4)
#define RCC_APB2ENR_UART1_MASK                  (0x1U << RCC_APB2ENR_UART1_SHIFT)
#define RCC_APB2ENR_UART1(x)                    (((uint32_t)(((uint32_t)(x)) << RCC_APB2ENR_UART1_SHIFT)) & RCC_APB2ENR_UART1_MASK)

#define RCC_APB2ENR_TIM8_SHIFT                  (1)
#define RCC_APB2ENR_TIM8_MASK                   (0x1U << RCC_APB2ENR_TIM8_SHIFT)
#define RCC_APB2ENR_TIM8(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_APB2ENR_TIM8_SHIFT)) & RCC_APB2ENR_TIM8_MASK)

#define RCC_APB2ENR_TIM1_SHIFT                  (0)
#define RCC_APB2ENR_TIM1_MASK                   (0x1U << RCC_APB2ENR_TIM1_SHIFT)
#define RCC_APB2ENR_TIM1(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_APB2ENR_TIM1_SHIFT)) & RCC_APB2ENR_TIM1_MASK)

/*!
 * @brief RCC_APB1ENR Register Bit Definition
 */

#define RCC_APB1ENR_DAC_SHIFT                   (29)
#define RCC_APB1ENR_DAC_MASK                    (0x1U << RCC_APB1ENR_DAC_SHIFT)
#define RCC_APB1ENR_DAC(x)                      (((uint32_t)(((uint32_t)(x)) << RCC_APB1ENR_DAC_SHIFT)) & RCC_APB1ENR_DAC_MASK)

