AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define RCC_PLL2CFGR_PLL2XTPRE_SHIFT            (1)
#define RCC_PLL2CFGR_PLL2XTPRE_MASK             (0x1U << RCC_PLL2CFGR_PLL2XTPRE_SHIFT)
#define RCC_PLL2CFGR_PLL2XTPRE(x)               (((uint32_t)(((uint32_t)(x)) << RCC_PLL2CFGR_PLL2XTPRE_SHIFT)) & RCC_PLL2CFGR_PLL2XTPRE_MASK)

#define RCC_PLL2CFGR_PLL2SRC_SHIFT              (0)
#define RCC_PLL2CFGR_PLL2SRC_MASK               (0x1U << RCC_PLL2CFGR_PLL2SRC_SHIFT)
#define RCC_PLL2CFGR_PLL2SRC(x)                 (((uint32_t)(((uint32_t)(x)) << RCC_PLL2CFGR_PLL2SRC_SHIFT)) & RCC_PLL2CFGR_PLL2SRC_MASK)

/*!
 * @brief RCC_ADC1CFGR Register Bit Definition
 */

#define RCC_ADC1CFGR_PRECAL_SHIFT               (8)
#define RCC_ADC1CFGR_PRECAL_MASK                (0x1FFU << RCC_ADC1CFGR_PRECAL_SHIFT)
#define RCC_ADC1CFGR_PRECAL(x)                  (((uint32_t)(((uint32_t)(x)) << RCC_ADC1CFGR_PRECAL_SHIFT)) & RCC_ADC1CFGR_PRECAL_MASK)

#define RCC_ADC1CFGR_PRE_SHIFT                  (0)
#define RCC_ADC1CFGR_PRE_MASK                   (0xFU << RCC_ADC1CFGR_PRE_SHIFT)
#define RCC_ADC1CFGR_PRE(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_ADC1CFGR_PRE_SHIFT)) & RCC_ADC1CFGR_PRE_MASK)

/*!
 * @brief RCC_ADC2CFGR Register Bit Definition
 */

#define RCC_ADC2CFGR_PRECAL_SHIFT               (8)
#define RCC_ADC2CFGR_PRECAL_MASK                (0x1FFU << RCC_ADC2CFGR_PRECAL_SHIFT)
#define RCC_ADC2CFGR_PRECAL(x)                  (((uint32_t)(((uint32_t)(x)) << RCC_ADC2CFGR_PRECAL_SHIFT)) & RCC_ADC2CFGR_PRECAL_MASK)

#define RCC_ADC2CFGR_PRE_SHIFT                  (0)
#define RCC_ADC2CFGR_PRE_MASK                   (0xFU << RCC_ADC2CFGR_PRE_SHIFT)
#define RCC_ADC2CFGR_PRE(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_ADC2CFGR_PRE_SHIFT)) & RCC_ADC2CFGR_PRE_MASK)

/*!
 * @brief RCC_DACCFGR Register Bit Definition
 */

#define RCC_DACCFGR_PRE_SHIFT                   (0)
#define RCC_DACCFGR_PRE_MASK                    (0x7FU << RCC_DACCFGR_PRE_SHIFT)
#define RCC_DACCFGR_PRE(x)                      (((uint32_t)(((uint32_t)(x)) << RCC_DACCFGR_PRE_SHIFT)) & RCC_DACCFGR_PRE_MASK)

/*!
 * @brief RCC_TPIUCFGR Register Bit Definition
 */

#define RCC_TPIUCFGR_PRE_SHIFT                  (0)
#define RCC_TPIUCFGR_PRE_MASK                   (0x3U << RCC_TPIUCFGR_PRE_SHIFT)
#define RCC_TPIUCFGR_PRE(x)                     (((uint32_t)(((uint32_t)(x)) << RCC_TPIUCFGR_PRE_SHIFT)) & RCC_TPIUCFGR_PRE_MASK)

/*!
 * @}
 */ /* end of group RCC_Register_Masks */
/******************************************************************************
 *RCC Instance
*******************************************************************************/

#define RCC                  ((RCC_Type*)RCC_BASE)

/*!
 * @}
 */ /* end of group RCC_Peripheral_Access_Layer */



/*!
 * @addtogroup RTC_Peripheral_Access_Layer RTC Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * RTC Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CRH;                                                          ///< RTC control register high                    offset: 0x00
    __IO uint32_t CRL;                                                          ///< RTC control register low                     offset: 0x04
    __IO uint32_t PRLH;                                                         ///< RTC prescaler load register high             offset: 0x08
    __IO uint32_t PRLL;                                                         ///< RTC prescaler load register low              offset: 0x0C
    __IO uint32_t DIVH;                                                         ///< RTC prescaler divider register high          offset: 0x10
    __IO uint32_t DIVL;                                                         ///< RTC prescaler divider register low           offset: 0x14
    __IO uint32_t CNTH;                                                         ///< RTC counter register high                    offset: 0x18
    __IO uint32_t CNTL;                                                         ///< RTC counter register low                     offset: 0x1C
    __IO uint32_t ALRH;                                                         ///< RTC alarm register high                      offset: 0x20
    __IO uint32_t ALRL;                                                         ///< RTC alarm register low                       offset: 0x24
    __IO uint32_t MSRH;                                                         ///< RTC millisecond register high                offset: 0x28
    __IO uint32_t MSRL;                                                         ///< RTC millisecond register low                 offset: 0x2C
    __IO uint32_t Reserved0[3];                                                 ///< Reserved
    __IO uint32_t LSECFG;                                                       ///< RTC LSE configuration register               offset: 0x3C
} RTC_Type;

/*******************************************************************************
 * RTC Type
 ******************************************************************************/

/*!
 * @addtogroup RTC_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief RTC_CRH Register Bit Definition
 */

#define RTC_CRH_OWIE_SHIFT                      (2)
#define RTC_CRH_OWIE_MASK                       (0x1U << RTC_CRH_OWIE_SHIFT)
#define RTC_CRH_OWIE(x)                         (((uint32_t)(((uint32_t)(x)) << RTC_CRH_OWIE_SHIFT)) & RTC_CRH_OWIE_MASK)

#define RTC_CRH_ALRIE_SHIFT                     (1)
#define RTC_CRH_ALRIE_MASK                      (0x1U << RTC_CRH_ALRIE_SHIFT)
#define RTC_CRH_ALRIE(x)                        (((uint32_t)(((uint32_t)(x)) << RTC_CRH_ALRIE_SHIFT)) & RTC_CRH_ALRIE_MASK)

#define RTC_CRH_SECIE_SHIFT                     (0)
#define RTC_CRH_SECIE_MASK                      (0x1U << RTC_CRH_SECIE_SHIFT)
#define RTC_CRH_SECIE(x)                        (((uint32_t)(((uint32_t)(x)) << RTC_CRH_SECIE_SHIFT)) & RTC_CRH_SECIE_MASK)

/*!
 * @brief RTC_CRL Register Bit Definition
 */

#define RTC_CRL_ALPEN_SHIFT                     (6)
#define RTC_CRL_ALPEN_MASK                      (0x1U << RTC_CRL_ALPEN_SHIFT)
#define RTC_CRL_ALPEN(x)                        (((uint32_t)(((uint32_t)(x)) << RTC_CRL_ALPEN_SHIFT)) & RTC_CRL_ALPEN_MASK)

#define RTC_CRL_RTOFF_SHIFT                     (5)
#define RTC_CRL_RTOFF_MASK                      (0x1U << RTC_CRL_RTOFF_SHIFT)
#define RTC_CRL_RTOFF(x)                        (((uint32_t)(((uint32_t)(x)) << RTC_CRL_RTOFF_SHIFT)) & RTC_CRL_RTOFF_MASK)

#define RTC_CRL_CNF_SHIFT                       (4)
#define RTC_CRL_CNF_MASK                        (0x1U << RTC_CRL_CNF_SHIFT)
#define RTC_CRL_CNF(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_CRL_CNF_SHIFT)) & RTC_CRL_CNF_MASK)

#define RTC_CRL_RSF_SHIFT                       (3)
#define RTC_CRL_RSF_MASK                        (0x1U << RTC_CRL_RSF_SHIFT)
#define RTC_CRL_RSF(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_CRL_RSF_SHIFT)) & RTC_CRL_RSF_MASK)

#define RTC_CRL_OWF_SHIFT                       (2)
#define RTC_CRL_OWF_MASK                        (0x1U << RTC_CRL_OWF_SHIFT)
#define RTC_CRL_OWF(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_CRL_OWF_SHIFT)) & RTC_CRL_OWF_MASK)

