AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define SPI_I2S_RXDNR_RXDNR_SHIFT               (0)
#define SPI_I2S_RXDNR_RXDNR_MASK                (0xFFFFU << SPI_I2S_RXDNR_RXDNR_SHIFT)
#define SPI_I2S_RXDNR_RXDNR(x)                  (((uint32_t)(((uint32_t)(x)) << SPI_I2S_RXDNR_RXDNR_SHIFT)) & SPI_I2S_RXDNR_RXDNR_MASK)

/*!
 * @brief SPI_I2S_NSSR Register Bit Definition
 */

#define SPI_I2S_NSSR_NSS_SHIFT                  (0)
#define SPI_I2S_NSSR_NSS_MASK                   (0x1U << SPI_I2S_NSSR_NSS_SHIFT)
#define SPI_I2S_NSSR_NSS(x)                     (((uint32_t)(((uint32_t)(x)) << SPI_I2S_NSSR_NSS_SHIFT)) & SPI_I2S_NSSR_NSS_MASK)

/*!
 * @brief SPI_I2S_EXTCTL Register Bit Definition
 */

#define SPI_I2S_EXTCTL_EXTLEN_SHIFT             (0)
#define SPI_I2S_EXTCTL_EXTLEN_MASK              (0x1FU << SPI_I2S_EXTCTL_EXTLEN_SHIFT)
#define SPI_I2S_EXTCTL_EXTLEN(x)                (((uint32_t)(((uint32_t)(x)) << SPI_I2S_EXTCTL_EXTLEN_SHIFT)) & SPI_I2S_EXTCTL_EXTLEN_MASK)

/*!
 * @brief SPI_I2S_I2SCFGR Register Bit Definition
 */

#define SPI_I2S_I2SCFGR_I2SDIV_SHIFT            (16)
#define SPI_I2S_I2SCFGR_I2SDIV_MASK             (0x1FFU << SPI_I2S_I2SCFGR_I2SDIV_SHIFT)
#define SPI_I2S_I2SCFGR_I2SDIV(x)               (((uint32_t)(((uint32_t)(x)) << SPI_I2S_I2SCFGR_I2SDIV_SHIFT)) & SPI_I2S_I2SCFGR_I2SDIV_MASK)

#define SPI_I2S_I2SCFGR_HFDSEL_SHIFT            (13)
#define SPI_I2S_I2SCFGR_HFDSEL_MASK             (0x01U << SPI_I2S_I2SCFGR_HFDSEL_SHIFT)
#define SPI_I2S_I2SCFGR_HFDSEL(x)               (((uint32_t)(((uint32_t)(x)) << SPI_I2S_I2SCFGR_HFDSEL_SHIFT)) & SPI_I2S_I2SCFGR_HFDSEL_MASK)

#define SPI_I2S_I2SCFGR_MCKSEL_SHIFT            (12)
#define SPI_I2S_I2SCFGR_MCKSEL_MASK             (0x1U << SPI_I2S_I2SCFGR_MCKSEL_SHIFT)
#define SPI_I2S_I2SCFGR_MCKSEL(x)               (((uint32_t)(((uint32_t)(x)) << SPI_I2S_I2SCFGR_MCKSEL_SHIFT)) & SPI_I2S_I2SCFGR_MCKSEL_MASK)

#define SPI_I2S_I2SCFGR_MCKOE_SHIFT             (11)
#define SPI_I2S_I2SCFGR_MCKOE_MASK              (0x1U << SPI_I2S_I2SCFGR_MCKOE_SHIFT)
#define SPI_I2S_I2SCFGR_MCKOE(x)                (((uint32_t)(((uint32_t)(x)) << SPI_I2S_I2SCFGR_MCKOE_SHIFT)) & SPI_I2S_I2SCFGR_MCKOE_MASK)

#define SPI_I2S_I2SCFGR_SPII2S_SHIFT            (10)
#define SPI_I2S_I2SCFGR_SPII2S_MASK             (0x1U << SPI_I2S_I2SCFGR_SPII2S_SHIFT)
#define SPI_I2S_I2SCFGR_SPII2S(x)               (((uint32_t)(((uint32_t)(x)) << SPI_I2S_I2SCFGR_SPII2S_SHIFT)) & SPI_I2S_I2SCFGR_SPII2S_MASK)

#define SPI_I2S_I2SCFGR_PCMSYN_SHIFT            (6)
#define SPI_I2S_I2SCFGR_PCMSYN_MASK             (0x1U << SPI_I2S_I2SCFGR_PCMSYN_SHIFT)
#define SPI_I2S_I2SCFGR_PCMSYN(x)               (((uint32_t)(((uint32_t)(x)) << SPI_I2S_I2SCFGR_PCMSYN_SHIFT)) & SPI_I2S_I2SCFGR_PCMSYN_MASK)

#define SPI_I2S_I2SCFGR_I2SSTD_SHIFT            (4)
#define SPI_I2S_I2SCFGR_I2SSTD_MASK             (0x3U << SPI_I2S_I2SCFGR_I2SSTD_SHIFT)
#define SPI_I2S_I2SCFGR_I2SSTD(x)               (((uint32_t)(((uint32_t)(x)) << SPI_I2S_I2SCFGR_I2SSTD_SHIFT)) & SPI_I2S_I2SCFGR_I2SSTD_MASK)

#define SPI_I2S_I2SCFGR_DATLEN_SHIFT            (1)
#define SPI_I2S_I2SCFGR_DATLEN_MASK             (0x3U << SPI_I2S_I2SCFGR_DATLEN_SHIFT)
#define SPI_I2S_I2SCFGR_DATLEN(x)               (((uint32_t)(((uint32_t)(x)) << SPI_I2S_I2SCFGR_DATLEN_SHIFT)) & SPI_I2S_I2SCFGR_DATLEN_MASK)

#define SPI_I2S_I2SCFGR_CHLEN_SHIFT             (0)
#define SPI_I2S_I2SCFGR_CHLEN_MASK              (0x1U << SPI_I2S_I2SCFGR_CHLEN_SHIFT)
#define SPI_I2S_I2SCFGR_CHLEN(x)                (((uint32_t)(((uint32_t)(x)) << SPI_I2S_I2SCFGR_CHLEN_SHIFT)) & SPI_I2S_I2SCFGR_CHLEN_MASK)

/*!
 * @}
 */ /* end of group SPI_I2S_Register_Masks */
/******************************************************************************
 *SPI_I2S Instance
*******************************************************************************/

#define SPI1                 ((SPI_Type*)SPI1_BASE)

#define SPI2                 ((SPI_Type*)SPI2_BASE)

#define SPI3                 ((SPI_Type*)SPI3_BASE)

/*!
 * @}
 */ /* end of group SPI_Peripheral_Access_Layer */

/*!
 * @addtogroup SRAM_Peripheral_Access_Layer SRAM Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * SRAM Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CFGR;                                                         ///< SRAM configuration register                  offset: 0x0
    __IO uint32_t Reserved0[15];                                                ///< Reserved
    __IO uint32_t ECCCR;                                                        ///< ECC control register                         offset: 0x40
    __IO uint32_t ECCEINR0;                                                     ///< ECC error injection regulate 0 register      offset: 0x44
    __IO uint32_t ECCEINR1;                                                     ///< ECC error injection regulate 1 register      offset: 0x48
    __IO uint32_t ECCSR;                                                        ///< ECC status register                          offset: 0x4C
    __IO uint32_t ECCEADRR;                                                     ///< ECC error address register                   offset: 0x50
    __IO uint32_t Reserved1[11];                                                ///< Reserved
    __IO uint32_t ECCESYNR;                                                     ///< ECC error syndrome register                  offset: 0x80
    __IO uint32_t ECCEDATAR;                                                    ///< ECC error data register                      offset: 0x84
} SRAM_Type;

/*******************************************************************************
 * SRAM Type
 ******************************************************************************/

/*!
 * @addtogroup SRAM_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief SRAM_CFGR Register Bit Definition
 */

#define SRAM_CFGR_WRWT_SHIFT                    (3)
#define SRAM_CFGR_WRWT_MASK                     (0x7U << SRAM_CFGR_WRWT_SHIFT)
#define SRAM_CFGR_WRWT(x)                       (((uint32_t)(((uint32_t)(x)) << SRAM_CFGR_WRWT_SHIFT)) & SRAM_CFGR_WRWT_MASK)

#define SRAM_CFGR_RDLAT_SHIFT                   (0)
#define SRAM_CFGR_RDLAT_MASK                    (0x7U << SRAM_CFGR_RDLAT_SHIFT)
#define SRAM_CFGR_RDLAT(x)                      (((uint32_t)(((uint32_t)(x)) << SRAM_CFGR_RDLAT_SHIFT)) & SRAM_CFGR_RDLAT_MASK)

/*!
 * @brief SRAM_ECCCR Register Bit Definition
 */

#define SRAM_ECCCR_ECCRBDBEIE_SHIFT             (4)
#define SRAM_ECCCR_ECCRBDBEIE_MASK              (0x1U << SRAM_ECCCR_ECCRBDBEIE_SHIFT)
#define SRAM_ECCCR_ECCRBDBEIE(x)                (((uint32_t)(((uint32_t)(x)) << SRAM_ECCCR_ECCRBDBEIE_SHIFT)) & SRAM_ECCCR_ECCRBDBEIE_MASK)

#define SRAM_ECCCR_ECCDBEIE_SHIFT               (3)
#define SRAM_ECCCR_ECCDBEIE_MASK                (0x1U << SRAM_ECCCR_ECCDBEIE_SHIFT)
#define SRAM_ECCCR_ECCDBEIE(x)                  (((uint32_t)(((uint32_t)(x)) << SRAM_ECCCR_ECCDBEIE_SHIFT)) & SRAM_ECCCR_ECCDBEIE_MASK)

