AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define SRAM_ECCCR_ECCSNEIE_SHIFT               (2)
#define SRAM_ECCCR_ECCSNEIE_MASK                (0x1U << SRAM_ECCCR_ECCSNEIE_SHIFT)
#define SRAM_ECCCR_ECCSNEIE(x)                  (((uint32_t)(((uint32_t)(x)) << SRAM_ECCCR_ECCSNEIE_SHIFT)) & SRAM_ECCCR_ECCSNEIE_MASK)

#define SRAM_ECCCR_ECCEUPEN_SHIFT               (1)
#define SRAM_ECCCR_ECCEUPEN_MASK                (0x1U << SRAM_ECCCR_ECCEUPEN_SHIFT)
#define SRAM_ECCCR_ECCEUPEN(x)                  (((uint32_t)(((uint32_t)(x)) << SRAM_ECCCR_ECCEUPEN_SHIFT)) & SRAM_ECCCR_ECCEUPEN_MASK)

#define SRAM_ECCCR_ECCSECEN_SHIFT               (0)
#define SRAM_ECCCR_ECCSECEN_MASK                (0x1U << SRAM_ECCCR_ECCSECEN_SHIFT)
#define SRAM_ECCCR_ECCSECEN(x)                  (((uint32_t)(((uint32_t)(x)) << SRAM_ECCCR_ECCSECEN_SHIFT)) & SRAM_ECCCR_ECCSECEN_MASK)

/*!
 * @brief SRAM_ECCEINR0 Register Bit Definition
 */

#define SRAM_ECCEINR0_ECCEIENL_SHIFT            (0)
#define SRAM_ECCEINR0_ECCEIENL_MASK             (0xFFFFFFFFU << SRAM_ECCEINR0_ECCEIENL_SHIFT)
#define SRAM_ECCEINR0_ECCEIENL(x)               (((uint32_t)(((uint32_t)(x)) << SRAM_ECCEINR0_ECCEIENL_SHIFT)) & SRAM_ECCEINR0_ECCEIENL_MASK)

/*!
 * @brief SRAM_ECCEINR1 Register Bit Definition
 */

#define SRAM_ECCEINR1_ECCEIENH_SHIFT            (0)
#define SRAM_ECCEINR1_ECCEIENH_MASK             (0x7FU << SRAM_ECCEINR1_ECCEIENH_SHIFT)
#define SRAM_ECCEINR1_ECCEIENH(x)               (((uint32_t)(((uint32_t)(x)) << SRAM_ECCEINR1_ECCEIENH_SHIFT)) & SRAM_ECCEINR1_ECCEIENH_MASK)

/*!
 * @brief SRAM_ECCSR Register Bit Definition
 */

#define SRAM_ECCSR_ECCRBDBEF_SHIFT              (2)
#define SRAM_ECCSR_ECCRBDBEF_MASK               (0x1U << SRAM_ECCSR_ECCRBDBEF_SHIFT)
#define SRAM_ECCSR_ECCRBDBEF(x)                 (((uint32_t)(((uint32_t)(x)) << SRAM_ECCSR_ECCRBDBEF_SHIFT)) & SRAM_ECCSR_ECCRBDBEF_MASK)

#define SRAM_ECCSR_ECCDBEF_SHIFT                (1)
#define SRAM_ECCSR_ECCDBEF_MASK                 (0x1U << SRAM_ECCSR_ECCDBEF_SHIFT)
#define SRAM_ECCSR_ECCDBEF(x)                   (((uint32_t)(((uint32_t)(x)) << SRAM_ECCSR_ECCDBEF_SHIFT)) & SRAM_ECCSR_ECCDBEF_MASK)

#define SRAM_ECCSR_ECCSNEF_SHIFT                (0)
#define SRAM_ECCSR_ECCSNEF_MASK                 (0x1U << SRAM_ECCSR_ECCSNEF_SHIFT)
#define SRAM_ECCSR_ECCSNEF(x)                   (((uint32_t)(((uint32_t)(x)) << SRAM_ECCSR_ECCSNEF_SHIFT)) & SRAM_ECCSR_ECCSNEF_MASK)

/*!
 * @brief SRAM_ECCEADRR Register Bit Definition
 */

#define SRAM_ECCEADRR_ECCEADR_SHIFT             (0)
#define SRAM_ECCEADRR_ECCEADR_MASK              (0xFFFFFFFFU << SRAM_ECCEADRR_ECCEADR_SHIFT)
#define SRAM_ECCEADRR_ECCEADR(x)                (((uint32_t)(((uint32_t)(x)) << SRAM_ECCEADRR_ECCEADR_SHIFT)) & SRAM_ECCEADRR_ECCEADR_MASK)

/*!
 * @brief SRAM_ECCESYNR Register Bit Definition
 */

#define SRAM_ECCESYNR_ECCESYN_SHIFT             (0)
#define SRAM_ECCESYNR_ECCESYN_MASK              (0x7FU << SRAM_ECCESYNR_ECCESYN_SHIFT)
#define SRAM_ECCESYNR_ECCESYN(x)                (((uint32_t)(((uint32_t)(x)) << SRAM_ECCESYNR_ECCESYN_SHIFT)) & SRAM_ECCESYNR_ECCESYN_MASK)

/*!
 * @brief SRAM_ECCEDATAR Register Bit Definition
 */

#define SRAM_ECCEDATAR_ECCEDATA_SHIFT           (0)
#define SRAM_ECCEDATAR_ECCEDATA_MASK            (0xFFFFFFFFU << SRAM_ECCEDATAR_ECCEDATA_SHIFT)
#define SRAM_ECCEDATAR_ECCEDATA(x)              (((uint32_t)(((uint32_t)(x)) << SRAM_ECCEDATAR_ECCEDATA_SHIFT)) & SRAM_ECCEDATAR_ECCEDATA_MASK)

/*!
 * @}
 */ /* end of group SRAM_Register_Masks */
/******************************************************************************
 *SRAM Instance
*******************************************************************************/

#define SRAM                 ((SRAM_Type*)SRAM_BASE)

/*!
 * @}
 */ /* end of group SRAM_Peripheral_Access_Layer */


/*!
 * @addtogroup SYSCFG_Peripheral_Access_Layer SYSCFG Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * SYSCFG Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CFGR1;                                                        ///< SYSCFG configuration register 1              offset: 0x00
    __IO uint32_t Reserved0[1];                                                 ///< Reserved
    __IO uint32_t EXTICR1;                                                      ///< SYSCFG external interrupt configuration register 1offset: 0x08
    __IO uint32_t EXTICR2;                                                      ///< SYSCFG external interrupt configuration register 2offset: 0x0C
    __IO uint32_t EXTICR3;                                                      ///< SYSCFG external interrupt configuration register 3offset: 0x10
    __IO uint32_t EXTICR4;                                                      ///< SYSCFG external interrupt configuration register 4offset: 0x14
    __IO uint32_t CFGR2;                                                        ///< SYSCFG configuration register 2              offset: 0x18
    __IO uint32_t PDETCSR;                                                      ///< SYSCFG power detection configuration status registeroffset: 0x1C
    __IO uint32_t VOSDLY;                                                       ///< SYSCFG voltage debugger output delay registeroffset: 0x20
    __IO uint32_t DMARMP;                                                       ///< SYSCFG DMA remap register                    offset: 0x24
    __IO uint32_t BUSPRI;                                                       ///< SYSCFG bus priority configuration register   offset: 0x28
} SYSCFG_Type;

/*******************************************************************************
 * SYSCFG Type
 ******************************************************************************/

/*!
 * @addtogroup SYSCFG_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief SYSCFG_CFGR1 Register Bit Definition
 */

#define SYSCFG_CFGR1_CAN1STOP_SHIFT             (18)
#define SYSCFG_CFGR1_CAN1STOP_MASK              (0x1U << SYSCFG_CFGR1_CAN1STOP_SHIFT)
#define SYSCFG_CFGR1_CAN1STOP(x)                (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR1_CAN1STOP_SHIFT)) & SYSCFG_CFGR1_CAN1STOP_MASK)

#define SYSCFG_CFGR1_CAN1TEST_SHIFT             (17)
#define SYSCFG_CFGR1_CAN1TEST_MASK              (0x1U << SYSCFG_CFGR1_CAN1TEST_SHIFT)
#define SYSCFG_CFGR1_CAN1TEST(x)                (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR1_CAN1TEST_SHIFT)) & SYSCFG_CFGR1_CAN1TEST_MASK)

#define SYSCFG_CFGR1_CAN1SPV_SHIFT              (16)
#define SYSCFG_CFGR1_CAN1SPV_MASK               (0x1U << SYSCFG_CFGR1_CAN1SPV_SHIFT)
#define SYSCFG_CFGR1_CAN1SPV(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR1_CAN1SPV_SHIFT)) & SYSCFG_CFGR1_CAN1SPV_MASK)

/*!
 * @brief SYSCFG_EXTICR1 Register Bit Definition
 */

#define SYSCFG_EXTICR1_EXTI3_SHIFT              (12)
#define SYSCFG_EXTICR1_EXTI3_MASK               (0xFU << SYSCFG_EXTICR1_EXTI3_SHIFT)
#define SYSCFG_EXTICR1_EXTI3(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR1_EXTI3_SHIFT)) & SYSCFG_EXTICR1_EXTI3_MASK)

