AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define SYSCFG_EXTICR1_EXTI2_SHIFT              (8)
#define SYSCFG_EXTICR1_EXTI2_MASK               (0xFU << SYSCFG_EXTICR1_EXTI2_SHIFT)
#define SYSCFG_EXTICR1_EXTI2(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR1_EXTI2_SHIFT)) & SYSCFG_EXTICR1_EXTI2_MASK)

#define SYSCFG_EXTICR1_EXTI1_SHIFT              (4)
#define SYSCFG_EXTICR1_EXTI1_MASK               (0xFU << SYSCFG_EXTICR1_EXTI1_SHIFT)
#define SYSCFG_EXTICR1_EXTI1(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR1_EXTI1_SHIFT)) & SYSCFG_EXTICR1_EXTI1_MASK)

#define SYSCFG_EXTICR1_EXTI0_SHIFT              (0)
#define SYSCFG_EXTICR1_EXTI0_MASK               (0xFU << SYSCFG_EXTICR1_EXTI0_SHIFT)
#define SYSCFG_EXTICR1_EXTI0(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR1_EXTI0_SHIFT)) & SYSCFG_EXTICR1_EXTI0_MASK)

/*!
 * @brief SYSCFG_EXTICR2 Register Bit Definition
 */

#define SYSCFG_EXTICR2_EXTI7_SHIFT              (12)
#define SYSCFG_EXTICR2_EXTI7_MASK               (0xFU << SYSCFG_EXTICR2_EXTI7_SHIFT)
#define SYSCFG_EXTICR2_EXTI7(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR2_EXTI7_SHIFT)) & SYSCFG_EXTICR2_EXTI7_MASK)

#define SYSCFG_EXTICR2_EXTI6_SHIFT              (8)
#define SYSCFG_EXTICR2_EXTI6_MASK               (0xFU << SYSCFG_EXTICR2_EXTI6_SHIFT)
#define SYSCFG_EXTICR2_EXTI6(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR2_EXTI6_SHIFT)) & SYSCFG_EXTICR2_EXTI6_MASK)

#define SYSCFG_EXTICR2_EXTI5_SHIFT              (4)
#define SYSCFG_EXTICR2_EXTI5_MASK               (0xFU << SYSCFG_EXTICR2_EXTI5_SHIFT)
#define SYSCFG_EXTICR2_EXTI5(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR2_EXTI5_SHIFT)) & SYSCFG_EXTICR2_EXTI5_MASK)

#define SYSCFG_EXTICR2_EXTI4_SHIFT              (0)
#define SYSCFG_EXTICR2_EXTI4_MASK               (0xFU << SYSCFG_EXTICR2_EXTI4_SHIFT)
#define SYSCFG_EXTICR2_EXTI4(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR2_EXTI4_SHIFT)) & SYSCFG_EXTICR2_EXTI4_MASK)

/*!
 * @brief SYSCFG_EXTICR3 Register Bit Definition
 */

#define SYSCFG_EXTICR3_EXTI11_SHIFT             (12)
#define SYSCFG_EXTICR3_EXTI11_MASK              (0xFU << SYSCFG_EXTICR3_EXTI11_SHIFT)
#define SYSCFG_EXTICR3_EXTI11(x)                (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR3_EXTI11_SHIFT)) & SYSCFG_EXTICR3_EXTI11_MASK)

#define SYSCFG_EXTICR3_EXTI10_SHIFT             (8)
#define SYSCFG_EXTICR3_EXTI10_MASK              (0xFU << SYSCFG_EXTICR3_EXTI10_SHIFT)
#define SYSCFG_EXTICR3_EXTI10(x)                (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR3_EXTI10_SHIFT)) & SYSCFG_EXTICR3_EXTI10_MASK)

#define SYSCFG_EXTICR3_EXTI9_SHIFT              (4)
#define SYSCFG_EXTICR3_EXTI9_MASK               (0xFU << SYSCFG_EXTICR3_EXTI9_SHIFT)
#define SYSCFG_EXTICR3_EXTI9(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR3_EXTI9_SHIFT)) & SYSCFG_EXTICR3_EXTI9_MASK)

#define SYSCFG_EXTICR3_EXTI8_SHIFT              (0)
#define SYSCFG_EXTICR3_EXTI8_MASK               (0xFU << SYSCFG_EXTICR3_EXTI8_SHIFT)
#define SYSCFG_EXTICR3_EXTI8(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR3_EXTI8_SHIFT)) & SYSCFG_EXTICR3_EXTI8_MASK)

/*!
 * @brief SYSCFG_EXTICR4 Register Bit Definition
 */

#define SYSCFG_EXTICR4_EXTI15_SHIFT             (12)
#define SYSCFG_EXTICR4_EXTI15_MASK              (0xFU << SYSCFG_EXTICR4_EXTI15_SHIFT)
#define SYSCFG_EXTICR4_EXTI15(x)                (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR4_EXTI15_SHIFT)) & SYSCFG_EXTICR4_EXTI15_MASK)

#define SYSCFG_EXTICR4_EXTI14_SHIFT             (8)
#define SYSCFG_EXTICR4_EXTI14_MASK              (0xFU << SYSCFG_EXTICR4_EXTI14_SHIFT)
#define SYSCFG_EXTICR4_EXTI14(x)                (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR4_EXTI14_SHIFT)) & SYSCFG_EXTICR4_EXTI14_MASK)

#define SYSCFG_EXTICR4_EXTI13_SHIFT             (4)
#define SYSCFG_EXTICR4_EXTI13_MASK              (0xFU << SYSCFG_EXTICR4_EXTI13_SHIFT)
#define SYSCFG_EXTICR4_EXTI13(x)                (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR4_EXTI13_SHIFT)) & SYSCFG_EXTICR4_EXTI13_MASK)

#define SYSCFG_EXTICR4_EXTI12_SHIFT             (0)
#define SYSCFG_EXTICR4_EXTI12_MASK              (0xFU << SYSCFG_EXTICR4_EXTI12_SHIFT)
#define SYSCFG_EXTICR4_EXTI12(x)                (((uint32_t)(((uint32_t)(x)) << SYSCFG_EXTICR4_EXTI12_SHIFT)) & SYSCFG_EXTICR4_EXTI12_MASK)

/*!
 * @brief SYSCFG_CFGR2 Register Bit Definition
 */

#define SYSCFG_CFGR2_PB11FMP_SHIFT              (25)
#define SYSCFG_CFGR2_PB11FMP_MASK               (0x1U << SYSCFG_CFGR2_PB11FMP_SHIFT)
#define SYSCFG_CFGR2_PB11FMP(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR2_PB11FMP_SHIFT)) & SYSCFG_CFGR2_PB11FMP_MASK)

#define SYSCFG_CFGR2_PB10FMP_SHIFT              (24)
#define SYSCFG_CFGR2_PB10FMP_MASK               (0x1U << SYSCFG_CFGR2_PB10FMP_SHIFT)
#define SYSCFG_CFGR2_PB10FMP(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR2_PB10FMP_SHIFT)) & SYSCFG_CFGR2_PB10FMP_MASK)

#define SYSCFG_CFGR2_I2C2MODESEL_SHIFT          (17)
#define SYSCFG_CFGR2_I2C2MODESEL_MASK           (0x1U << SYSCFG_CFGR2_I2C2MODESEL_SHIFT)
#define SYSCFG_CFGR2_I2C2MODESEL(x)             (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR2_I2C2MODESEL_SHIFT)) & SYSCFG_CFGR2_I2C2MODESEL_MASK)

#define SYSCFG_CFGR2_I2C1MODESEL_SHIFT          (16)
#define SYSCFG_CFGR2_I2C1MODESEL_MASK           (0x1U << SYSCFG_CFGR2_I2C1MODESEL_SHIFT)
#define SYSCFG_CFGR2_I2C1MODESEL(x)             (((uint32_t)(((uint32_t)(x)) << SYSCFG_CFGR2_I2C1MODESEL_SHIFT)) & SYSCFG_CFGR2_I2C1MODESEL_MASK)

/*!
 * @brief SYSCFG_PDETCSR Register Bit Definition
 */

#define SYSCFG_PDETCSR_PVDO_SHIFT               (5)
#define SYSCFG_PDETCSR_PVDO_MASK                (0x1U << SYSCFG_PDETCSR_PVDO_SHIFT)
#define SYSCFG_PDETCSR_PVDO(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCFG_PDETCSR_PVDO_SHIFT)) & SYSCFG_PDETCSR_PVDO_MASK)

#define SYSCFG_PDETCSR_PLS_SHIFT                (1)
#define SYSCFG_PDETCSR_PLS_MASK                 (0xFU << SYSCFG_PDETCSR_PLS_SHIFT)
#define SYSCFG_PDETCSR_PLS(x)                   (((uint32_t)(((uint32_t)(x)) << SYSCFG_PDETCSR_PLS_SHIFT)) & SYSCFG_PDETCSR_PLS_MASK)

