AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define SYSCFG_PDETCSR_PVDE_SHIFT               (0)
#define SYSCFG_PDETCSR_PVDE_MASK                (0x1U << SYSCFG_PDETCSR_PVDE_SHIFT)
#define SYSCFG_PDETCSR_PVDE(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCFG_PDETCSR_PVDE_SHIFT)) & SYSCFG_PDETCSR_PVDE_MASK)

/*!
 * @brief SYSCFG_VOSDLY Register Bit Definition
 */

#define SYSCFG_VOSDLY_VOSDLYCNT_SHIFT           (0)
#define SYSCFG_VOSDLY_VOSDLYCNT_MASK            (0x3FFU << SYSCFG_VOSDLY_VOSDLYCNT_SHIFT)
#define SYSCFG_VOSDLY_VOSDLYCNT(x)              (((uint32_t)(((uint32_t)(x)) << SYSCFG_VOSDLY_VOSDLYCNT_SHIFT)) & SYSCFG_VOSDLY_VOSDLYCNT_MASK)

/*!
 * @brief SYSCFG_DMARMP Register Bit Definition
 */

#define SYSCFG_DMARMP_ADC2RMP_SHIFT             (31)
#define SYSCFG_DMARMP_ADC2RMP_MASK              (0x1U << SYSCFG_DMARMP_ADC2RMP_SHIFT)
#define SYSCFG_DMARMP_ADC2RMP(x)                (((uint32_t)(((uint32_t)(x)) << SYSCFG_DMARMP_ADC2RMP_SHIFT)) & SYSCFG_DMARMP_ADC2RMP_MASK)

#define SYSCFG_DMARMP_ADC1RMP_SHIFT             (30)
#define SYSCFG_DMARMP_ADC1RMP_MASK              (0x1U << SYSCFG_DMARMP_ADC1RMP_SHIFT)
#define SYSCFG_DMARMP_ADC1RMP(x)                (((uint32_t)(((uint32_t)(x)) << SYSCFG_DMARMP_ADC1RMP_SHIFT)) & SYSCFG_DMARMP_ADC1RMP_MASK)

#define SYSCFG_DMARMP_DACCH1RMP_SHIFT           (28)
#define SYSCFG_DMARMP_DACCH1RMP_MASK            (0x1U << SYSCFG_DMARMP_DACCH1RMP_SHIFT)
#define SYSCFG_DMARMP_DACCH1RMP(x)              (((uint32_t)(((uint32_t)(x)) << SYSCFG_DMARMP_DACCH1RMP_SHIFT)) & SYSCFG_DMARMP_DACCH1RMP_MASK)

#define SYSCFG_DMARMP_I3C1TXRMP_SHIFT           (25)
#define SYSCFG_DMARMP_I3C1TXRMP_MASK            (0x1U << SYSCFG_DMARMP_I3C1TXRMP_SHIFT)
#define SYSCFG_DMARMP_I3C1TXRMP(x)              (((uint32_t)(((uint32_t)(x)) << SYSCFG_DMARMP_I3C1TXRMP_SHIFT)) & SYSCFG_DMARMP_I3C1TXRMP_MASK)

#define SYSCFG_DMARMP_I3C1RXRMP_SHIFT           (24)
#define SYSCFG_DMARMP_I3C1RXRMP_MASK            (0x1U << SYSCFG_DMARMP_I3C1RXRMP_SHIFT)
#define SYSCFG_DMARMP_I3C1RXRMP(x)              (((uint32_t)(((uint32_t)(x)) << SYSCFG_DMARMP_I3C1RXRMP_SHIFT)) & SYSCFG_DMARMP_I3C1RXRMP_MASK)

#define SYSCFG_DMARMP_UART4TXRMP_SHIFT          (17)
#define SYSCFG_DMARMP_UART4TXRMP_MASK           (0x1U << SYSCFG_DMARMP_UART4TXRMP_SHIFT)
#define SYSCFG_DMARMP_UART4TXRMP(x)             (((uint32_t)(((uint32_t)(x)) << SYSCFG_DMARMP_UART4TXRMP_SHIFT)) & SYSCFG_DMARMP_UART4TXRMP_MASK)

#define SYSCFG_DMARMP_UART4RXRMP_SHIFT          (16)
#define SYSCFG_DMARMP_UART4RXRMP_MASK           (0x1U << SYSCFG_DMARMP_UART4RXRMP_SHIFT)
#define SYSCFG_DMARMP_UART4RXRMP(x)             (((uint32_t)(((uint32_t)(x)) << SYSCFG_DMARMP_UART4RXRMP_SHIFT)) & SYSCFG_DMARMP_UART4RXRMP_MASK)

#define SYSCFG_DMARMP_TIM8COMRMP_SHIFT          (15)
#define SYSCFG_DMARMP_TIM8COMRMP_MASK           (0x1U << SYSCFG_DMARMP_TIM8COMRMP_SHIFT)
#define SYSCFG_DMARMP_TIM8COMRMP(x)             (((uint32_t)(((uint32_t)(x)) << SYSCFG_DMARMP_TIM8COMRMP_SHIFT)) & SYSCFG_DMARMP_TIM8COMRMP_MASK)

#define SYSCFG_DMARMP_TIM8UPRMP_SHIFT           (14)
#define SYSCFG_DMARMP_TIM8UPRMP_MASK            (0x1U << SYSCFG_DMARMP_TIM8UPRMP_SHIFT)
#define SYSCFG_DMARMP_TIM8UPRMP(x)              (((uint32_t)(((uint32_t)(x)) << SYSCFG_DMARMP_TIM8UPRMP_SHIFT)) & SYSCFG_DMARMP_TIM8UPRMP_MASK)

#define SYSCFG_DMARMP_TIM8TRIGRMP_SHIFT         (13)
#define SYSCFG_DMARMP_TIM8TRIGRMP_MASK          (0x1U << SYSCFG_DMARMP_TIM8TRIGRMP_SHIFT)
#define SYSCFG_DMARMP_TIM8TRIGRMP(x)            (((uint32_t)(((uint32_t)(x)) << SYSCFG_DMARMP_TIM8TRIGRMP_SHIFT)) & SYSCFG_DMARMP_TIM8TRIGRMP_MASK)

#define SYSCFG_DMARMP_TIM7UPRMP_SHIFT           (12)
#define SYSCFG_DMARMP_TIM7UPRMP_MASK            (0x1U << SYSCFG_DMARMP_TIM7UPRMP_SHIFT)
#define SYSCFG_DMARMP_TIM7UPRMP(x)              (((uint32_t)(((uint32_t)(x)) << SYSCFG_DMARMP_TIM7UPRMP_SHIFT)) & SYSCFG_DMARMP_TIM7UPRMP_MASK)

#define SYSCFG_DMARMP_TIM6UPRMP_SHIFT           (10)
#define SYSCFG_DMARMP_TIM6UPRMP_MASK            (0x1U << SYSCFG_DMARMP_TIM6UPRMP_SHIFT)
#define SYSCFG_DMARMP_TIM6UPRMP(x)              (((uint32_t)(((uint32_t)(x)) << SYSCFG_DMARMP_TIM6UPRMP_SHIFT)) & SYSCFG_DMARMP_TIM6UPRMP_MASK)

#define SYSCFG_DMARMP_TIM5UPRMP_SHIFT           (8)
#define SYSCFG_DMARMP_TIM5UPRMP_MASK            (0x1U << SYSCFG_DMARMP_TIM5UPRMP_SHIFT)
#define SYSCFG_DMARMP_TIM5UPRMP(x)              (((uint32_t)(((uint32_t)(x)) << SYSCFG_DMARMP_TIM5UPRMP_SHIFT)) & SYSCFG_DMARMP_TIM5UPRMP_MASK)

#define SYSCFG_DMARMP_TIM2CC4RMP_SHIFT          (5)
#define SYSCFG_DMARMP_TIM2CC4RMP_MASK           (0x1U << SYSCFG_DMARMP_TIM2CC4RMP_SHIFT)
#define SYSCFG_DMARMP_TIM2CC4RMP(x)             (((uint32_t)(((uint32_t)(x)) << SYSCFG_DMARMP_TIM2CC4RMP_SHIFT)) & SYSCFG_DMARMP_TIM2CC4RMP_MASK)

#define SYSCFG_DMARMP_TIM2CC3RMP_SHIFT          (4)
#define SYSCFG_DMARMP_TIM2CC3RMP_MASK           (0x1U << SYSCFG_DMARMP_TIM2CC3RMP_SHIFT)
#define SYSCFG_DMARMP_TIM2CC3RMP(x)             (((uint32_t)(((uint32_t)(x)) << SYSCFG_DMARMP_TIM2CC3RMP_SHIFT)) & SYSCFG_DMARMP_TIM2CC3RMP_MASK)

#define SYSCFG_DMARMP_TIM2UPRMP_SHIFT           (2)
#define SYSCFG_DMARMP_TIM2UPRMP_MASK            (0x3U << SYSCFG_DMARMP_TIM2UPRMP_SHIFT)
#define SYSCFG_DMARMP_TIM2UPRMP(x)              (((uint32_t)(((uint32_t)(x)) << SYSCFG_DMARMP_TIM2UPRMP_SHIFT)) & SYSCFG_DMARMP_TIM2UPRMP_MASK)

#define SYSCFG_DMARMP_TIM1COMRMP_SHIFT          (1)
#define SYSCFG_DMARMP_TIM1COMRMP_MASK           (0x1U << SYSCFG_DMARMP_TIM1COMRMP_SHIFT)
#define SYSCFG_DMARMP_TIM1COMRMP(x)             (((uint32_t)(((uint32_t)(x)) << SYSCFG_DMARMP_TIM1COMRMP_SHIFT)) & SYSCFG_DMARMP_TIM1COMRMP_MASK)

#define SYSCFG_DMARMP_TIM1TRIGRMP_SHIFT         (0)
#define SYSCFG_DMARMP_TIM1TRIGRMP_MASK          (0x1U << SYSCFG_DMARMP_TIM1TRIGRMP_SHIFT)
#define SYSCFG_DMARMP_TIM1TRIGRMP(x)            (((uint32_t)(((uint32_t)(x)) << SYSCFG_DMARMP_TIM1TRIGRMP_SHIFT)) & SYSCFG_DMARMP_TIM1TRIGRMP_MASK)

/*!
 * @brief SYSCFG_BUS_PRI Register Bit Definition
 */

#define SYSCFG_BUSPRI_PRIM5_SHIFT               (12)
#define SYSCFG_BUSPRI_PRIM5_MASK                (0x7U << SYSCFG_BUSPRI_PRIM5_SHIFT)
#define SYSCFG_BUSPRI_PRIM5(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCFG_BUSPRI_PRIM5_SHIFT)) & SYSCFG_BUSPRI_PRIM5_MASK)

