AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define SYSCFG_BUSPRI_PRIM4_SHIFT               (9)
#define SYSCFG_BUSPRI_PRIM4_MASK                (0x7U << SYSCFG_BUSPRI_PRIM4_SHIFT)
#define SYSCFG_BUSPRI_PRIM4(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCFG_BUSPRI_PRIM4_SHIFT)) & SYSCFG_BUSPRI_PRIM4_MASK)

#define SYSCFG_BUSPRI_PRIM3_SHIFT               (6)
#define SYSCFG_BUSPRI_PRIM3_MASK                (0x7U << SYSCFG_BUSPRI_PRIM3_SHIFT)
#define SYSCFG_BUSPRI_PRIM3(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCFG_BUSPRI_PRIM3_SHIFT)) & SYSCFG_BUSPRI_PRIM3_MASK)

#define SYSCFG_BUSPRI_PRIM2_SHIFT               (3)
#define SYSCFG_BUSPRI_PRIM2_MASK                (0x7U << SYSCFG_BUSPRI_PRIM2_SHIFT)
#define SYSCFG_BUSPRI_PRIM2(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCFG_BUSPRI_PRIM2_SHIFT)) & SYSCFG_BUSPRI_PRIM2_MASK)

#define SYSCFG_BUSPRI_PRIM1_SHIFT               (0)
#define SYSCFG_BUSPRI_PRIM1_MASK                (0x7U << SYSCFG_BUSPRI_PRIM1_SHIFT)
#define SYSCFG_BUSPRI_PRIM1(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCFG_BUSPRI_PRIM1_SHIFT)) & SYSCFG_BUSPRI_PRIM1_MASK)

/*!
 * @}
 */ /* end of group SYSCFG_Register_Masks */
/******************************************************************************
 *SYSCFG Instance
*******************************************************************************/

#define SYSCFG               ((SYSCFG_Type*)SYSCFG_BASE)

/*!
 * @}
 */ /* end of group SYSCFG_Peripheral_Access_Layer */



/*!
 * @addtogroup TIM1_Peripheral_Access_Layer TIM1 Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * TIM1 Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CR1;                                                          ///< Control Register 1                           offset: 0x00
    __IO uint32_t CR2;                                                          ///< Control Register 2                           offset: 0x04
    __IO uint32_t SMCR;                                                         ///< Slave Mode Control Register                  offset: 0x08
    __IO uint32_t DIER;                                                         ///< DMA/Interrupt Enable Register (DMA is only suitable for the chip with built in DMA)offset: 0x0C
    __IO uint32_t SR;                                                           ///< Status Register                              offset: 0x10
    __IO uint32_t EGR;                                                          ///< Event Generation Register                    offset: 0x14
    __IO uint32_t CCMR1;                                                        ///< Capture/Compare Mode Register 1              offset: 0x18
    __IO uint32_t CCMR2;                                                        ///< Capture/Compare Mode Register 2              offset: 0x1C
    __IO uint32_t CCER;                                                         ///< Capture/Compare Enable Register              offset: 0x20
    __IO uint32_t CNT;                                                          ///< Counter                                      offset: 0x24
    __IO uint32_t PSC;                                                          ///< Prescaler                                    offset: 0x28
    __IO uint32_t ARR;                                                          ///< Auto Reload Register                         offset: 0x2C
    __IO uint32_t RCR;                                                          ///< Repeat Count Register                        offset: 0x30
    __IO uint32_t CCR1;                                                         ///< Capture/Compare Register 1                   offset: 0x34
    __IO uint32_t CCR2;                                                         ///< Capture/Compare Register 2                   offset: 0x38
    __IO uint32_t CCR3;                                                         ///< Capture/Compare Register 3                   offset: 0x3C
    __IO uint32_t CCR4;                                                         ///< Capture/Compare Register 4                   offset: 0x40
    __IO uint32_t BDTR;                                                         ///< Break And Dead-Time Register                 offset: 0x44
    __IO uint32_t DCR;                                                          ///< DMA Control Register (only suitable for the chip with built in DMA)offset: 0x48
    __IO uint32_t DMAR;                                                         ///< DMA Address Register Of Continuous Mode (only suitable for the chip with built in DMA)offset: 0x4C
    __IO uint32_t Reserved0[1];                                                 ///< Reserved
    __IO uint32_t CCMR3;                                                        ///< Capture/Compare Mode Register 3              offset: 0x54
    __IO uint32_t CCR5;                                                         ///< Capture/Compare Register 5                   offset: 0x58
    __IO uint32_t PDER;                                                         ///< PWM Phase Shift/DMA Repeat Update Request Enable Registeroffset: 0x5C
    __IO uint32_t CCRXFALL[5];                                                  ///< PWM Phase Shift Count Down Capture/Compare Registeroffset: 0x60
    __IO uint32_t BKINF;                                                        ///< Break Input Filter Register                  offset: 0x74
} TIM1_Type;

/*******************************************************************************
 * TIM1 Type
 ******************************************************************************/

/*!
 * @addtogroup TIM1_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief TIM1_CR1 Register Bit Definition
 */

#define TIM1_CR1_CKD_SHIFT                      (8)
#define TIM1_CR1_CKD_MASK                       (0x3U << TIM1_CR1_CKD_SHIFT)
#define TIM1_CR1_CKD(x)                         (((uint32_t)(((uint32_t)(x)) << TIM1_CR1_CKD_SHIFT)) & TIM1_CR1_CKD_MASK)

#define TIM1_CR1_ARPE_SHIFT                     (7)
#define TIM1_CR1_ARPE_MASK                      (0x1U << TIM1_CR1_ARPE_SHIFT)
#define TIM1_CR1_ARPE(x)                        (((uint32_t)(((uint32_t)(x)) << TIM1_CR1_ARPE_SHIFT)) & TIM1_CR1_ARPE_MASK)

#define TIM1_CR1_CMS_SHIFT                      (5)
#define TIM1_CR1_CMS_MASK                       (0x3U << TIM1_CR1_CMS_SHIFT)
#define TIM1_CR1_CMS(x)                         (((uint32_t)(((uint32_t)(x)) << TIM1_CR1_CMS_SHIFT)) & TIM1_CR1_CMS_MASK)

#define TIM1_CR1_DIR_SHIFT                      (4)
#define TIM1_CR1_DIR_MASK                       (0x1U << TIM1_CR1_DIR_SHIFT)
#define TIM1_CR1_DIR(x)                         (((uint32_t)(((uint32_t)(x)) << TIM1_CR1_DIR_SHIFT)) & TIM1_CR1_DIR_MASK)

#define TIM1_CR1_OPM_SHIFT                      (3)
#define TIM1_CR1_OPM_MASK                       (0x1U << TIM1_CR1_OPM_SHIFT)
#define TIM1_CR1_OPM(x)                         (((uint32_t)(((uint32_t)(x)) << TIM1_CR1_OPM_SHIFT)) & TIM1_CR1_OPM_MASK)

