AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define TIM1_CCMR3_OC5PE_SHIFT                  (3)
#define TIM1_CCMR3_OC5PE_MASK                   (0x1U << TIM1_CCMR3_OC5PE_SHIFT)
#define TIM1_CCMR3_OC5PE(x)                     (((uint32_t)(((uint32_t)(x)) << TIM1_CCMR3_OC5PE_SHIFT)) & TIM1_CCMR3_OC5PE_MASK)

/*!
 * @brief TIM1_CCR5 Register Bit Definition
 */

#define TIM1_CCR5_CCR5_SHIFT                    (0)
#define TIM1_CCR5_CCR5_MASK                     (0xFFFFU << TIM1_CCR5_CCR5_SHIFT)
#define TIM1_CCR5_CCR5(x)                       (((uint32_t)(((uint32_t)(x)) << TIM1_CCR5_CCR5_SHIFT)) & TIM1_CCR5_CCR5_MASK)

/*!
 * @brief TIM1_PDER Register Bit Definition
 */

#define TIM1_PDER_CCR5SHIFTEN_SHIFT             (5)
#define TIM1_PDER_CCR5SHIFTEN_MASK              (0x1U << TIM1_PDER_CCR5SHIFTEN_SHIFT)
#define TIM1_PDER_CCR5SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM1_PDER_CCR5SHIFTEN_SHIFT)) & TIM1_PDER_CCR5SHIFTEN_MASK)

#define TIM1_PDER_CCR4SHIFTEN_SHIFT             (4)
#define TIM1_PDER_CCR4SHIFTEN_MASK              (0x1U << TIM1_PDER_CCR4SHIFTEN_SHIFT)
#define TIM1_PDER_CCR4SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM1_PDER_CCR4SHIFTEN_SHIFT)) & TIM1_PDER_CCR4SHIFTEN_MASK)

#define TIM1_PDER_CCR3SHIFTEN_SHIFT             (3)
#define TIM1_PDER_CCR3SHIFTEN_MASK              (0x1U << TIM1_PDER_CCR3SHIFTEN_SHIFT)
#define TIM1_PDER_CCR3SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM1_PDER_CCR3SHIFTEN_SHIFT)) & TIM1_PDER_CCR3SHIFTEN_MASK)

#define TIM1_PDER_CCR2SHIFTEN_SHIFT             (2)
#define TIM1_PDER_CCR2SHIFTEN_MASK              (0x1U << TIM1_PDER_CCR2SHIFTEN_SHIFT)
#define TIM1_PDER_CCR2SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM1_PDER_CCR2SHIFTEN_SHIFT)) & TIM1_PDER_CCR2SHIFTEN_MASK)

#define TIM1_PDER_CCR1SHIFTEN_SHIFT             (1)
#define TIM1_PDER_CCR1SHIFTEN_MASK              (0x1U << TIM1_PDER_CCR1SHIFTEN_SHIFT)
#define TIM1_PDER_CCR1SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM1_PDER_CCR1SHIFTEN_SHIFT)) & TIM1_PDER_CCR1SHIFTEN_MASK)

#define TIM1_PDER_CCDREPE_SHIFT                 (0)
#define TIM1_PDER_CCDREPE_MASK                  (0x1U << TIM1_PDER_CCDREPE_SHIFT)
#define TIM1_PDER_CCDREPE(x)                    (((uint32_t)(((uint32_t)(x)) << TIM1_PDER_CCDREPE_SHIFT)) & TIM1_PDER_CCDREPE_MASK)

/*!
 * @brief TIM1_CCRxFALL Register Bit Definition
 */

#define TIM1_CCRxFALL_CCRXFALL_SHIFT            (0)
#define TIM1_CCRxFALL_CCRXFALL_MASK             (0xFFFFU << TIM1_CCRxFALL_CCRXFALL_SHIFT)
#define TIM1_CCRxFALL_CCRXFALL(x)               (((uint32_t)(((uint32_t)(x)) << TIM1_CCRxFALL_CCRXFALL_SHIFT)) & TIM1_CCRxFALL_CCRXFALL_MASK)

/*!
 * @brief TIM1_BKINF Register Bit Definition
 */

#define TIM1_BKINF_COMPBKINSEL_SHIFT            (13)
#define TIM1_BKINF_COMPBKINSEL_MASK             (0x3U << TIM1_BKINF_COMPBKINSEL_SHIFT)
#define TIM1_BKINF_COMPBKINSEL(x)               (((uint32_t)(((uint32_t)(x)) << TIM1_BKINF_COMPBKINSEL_SHIFT)) & TIM1_BKINF_COMPBKINSEL_MASK)

#define TIM1_BKINF_IOBKINSEL_SHIFT              (6)
#define TIM1_BKINF_IOBKINSEL_MASK               (0x7U << TIM1_BKINF_IOBKINSEL_SHIFT)
#define TIM1_BKINF_IOBKINSEL(x)                 (((uint32_t)(((uint32_t)(x)) << TIM1_BKINF_IOBKINSEL_SHIFT)) & TIM1_BKINF_IOBKINSEL_MASK)

#define TIM1_BKINF_CSSBKINSEL_SHIFT             (5)
#define TIM1_BKINF_CSSBKINSEL_MASK              (0x1U << TIM1_BKINF_CSSBKINSEL_SHIFT)
#define TIM1_BKINF_CSSBKINSEL(x)                (((uint32_t)(((uint32_t)(x)) << TIM1_BKINF_CSSBKINSEL_SHIFT)) & TIM1_BKINF_CSSBKINSEL_MASK)

#define TIM1_BKINF_BKINF_SHIFT                  (1)
#define TIM1_BKINF_BKINF_MASK                   (0xFU << TIM1_BKINF_BKINF_SHIFT)
#define TIM1_BKINF_BKINF(x)                     (((uint32_t)(((uint32_t)(x)) << TIM1_BKINF_BKINF_SHIFT)) & TIM1_BKINF_BKINF_MASK)

#define TIM1_BKINF_BKINFE_SHIFT                 (0)
#define TIM1_BKINF_BKINFE_MASK                  (0x1U << TIM1_BKINF_BKINFE_SHIFT)
#define TIM1_BKINF_BKINFE(x)                    (((uint32_t)(((uint32_t)(x)) << TIM1_BKINF_BKINFE_SHIFT)) & TIM1_BKINF_BKINFE_MASK)

/*!
 * @}
 */ /* end of group TIM1_Register_Masks */
/******************************************************************************
 *TIM1 Instance
*******************************************************************************/

#define TIM1                 ((TIM1_Type*)TIM1_BASE)

#define TIM8                 ((TIM1_Type*)TIM8_BASE)

/*!
 * @}
 */ /* end of group TIM1_Peripheral_Access_Layer */



/*!
 * @addtogroup TIM2_Peripheral_Access_Layer TIM2 Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * TIM2 Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CR1;                                                          ///< Control Register 1                           offset: 0x00
    __IO uint32_t CR2;                                                          ///< Control Register 2                           offset: 0x04
    __IO uint32_t SMCR;                                                         ///< Slave Mode Control Register                  offset: 0x08
    __IO uint32_t DIER;                                                         ///< DMA/Interrupt Enable Register (DMA is only suitable for the chip with built in DMA)offset: 0x0C
    __IO uint32_t SR;                                                           ///< Status Register                              offset: 0x10
    __IO uint32_t EGR;                                                          ///< Event Generation Register                    offset: 0x14
    __IO uint32_t CCMR1;                                                        ///< Capture/Compare Mode Register 1              offset: 0x18
    __IO uint32_t CCMR2;                                                        ///< Capture/Compare Mode Register 2              offset: 0x1C
    __IO uint32_t CCER;                                                         ///< Capture/Compare Enable Register              offset: 0x20
    __IO uint32_t CNT;                                                          ///< Counter                                      offset: 0x24
    __IO uint32_t PSC;                                                          ///< Prescaler                                    offset: 0x28
    __IO uint32_t ARR;                                                          ///< Auto Reload Register                         offset: 0x2C
    __IO uint32_t Reserved0[1];                                                 ///< Reserved
    __IO uint32_t CCR1;                                                         ///< Capture/Compare Register 1                   offset: 0x34
    __IO uint32_t CCR2;                                                         ///< Capture/Compare Register 2                   offset: 0x38
    __IO uint32_t CCR3;                                                         ///< Capture/Compare Register 3                   offset: 0x3C
    __IO uint32_t CCR4;                                                         ///< Capture/Compare Register 4                   offset: 0x40
    __IO uint32_t Reserved1[1];                                                 ///< Reserved
    __IO uint32_t DCR;                                                          ///< DMA Control Register (only suitable for the chip with built in DMA)offset: 0x48
    __IO uint32_t DMAR;                                                         ///< DMA Address Register Of Continuous Mode (only suitable for the chip with built in DMA)offset: 0x4C
    __IO uint32_t OR;                                                           ///< Input Option Register                        offset: 0x50
} TIM2_Type;

