AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define TIM2_CCMR1INPUT_IC1F_SHIFT              (4)
#define TIM2_CCMR1INPUT_IC1F_MASK               (0xFU << TIM2_CCMR1INPUT_IC1F_SHIFT)
#define TIM2_CCMR1INPUT_IC1F(x)                 (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1INPUT_IC1F_SHIFT)) & TIM2_CCMR1INPUT_IC1F_MASK)

#define TIM2_CCMR1INPUT_IC1PSC_SHIFT            (2)
#define TIM2_CCMR1INPUT_IC1PSC_MASK             (0x3U << TIM2_CCMR1INPUT_IC1PSC_SHIFT)
#define TIM2_CCMR1INPUT_IC1PSC(x)               (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1INPUT_IC1PSC_SHIFT)) & TIM2_CCMR1INPUT_IC1PSC_MASK)

#define TIM2_CCMR1INPUT_CC1S_SHIFT              (0)
#define TIM2_CCMR1INPUT_CC1S_MASK               (0x3U << TIM2_CCMR1INPUT_CC1S_SHIFT)
#define TIM2_CCMR1INPUT_CC1S(x)                 (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR1INPUT_CC1S_SHIFT)) & TIM2_CCMR1INPUT_CC1S_MASK)

/*!
 * @brief TIM2_CCMR2_OUTPUT Register Bit Definition
 */

#define TIM2_CCMR2OUTPUT_OC4CE_SHIFT            (15)
#define TIM2_CCMR2OUTPUT_OC4CE_MASK             (0x1U << TIM2_CCMR2OUTPUT_OC4CE_SHIFT)
#define TIM2_CCMR2OUTPUT_OC4CE(x)               (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2OUTPUT_OC4CE_SHIFT)) & TIM2_CCMR2OUTPUT_OC4CE_MASK)

#define TIM2_CCMR2OUTPUT_OC4M_SHIFT             (12)
#define TIM2_CCMR2OUTPUT_OC4M_MASK              (0x7U << TIM2_CCMR2OUTPUT_OC4M_SHIFT)
#define TIM2_CCMR2OUTPUT_OC4M(x)                (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2OUTPUT_OC4M_SHIFT)) & TIM2_CCMR2OUTPUT_OC4M_MASK)

#define TIM2_CCMR2OUTPUT_OC4PE_SHIFT            (11)
#define TIM2_CCMR2OUTPUT_OC4PE_MASK             (0x1U << TIM2_CCMR2OUTPUT_OC4PE_SHIFT)
#define TIM2_CCMR2OUTPUT_OC4PE(x)               (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2OUTPUT_OC4PE_SHIFT)) & TIM2_CCMR2OUTPUT_OC4PE_MASK)

#define TIM2_CCMR2OUTPUT_OC4FE_SHIFT            (10)
#define TIM2_CCMR2OUTPUT_OC4FE_MASK             (0x1U << TIM2_CCMR2OUTPUT_OC4FE_SHIFT)
#define TIM2_CCMR2OUTPUT_OC4FE(x)               (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2OUTPUT_OC4FE_SHIFT)) & TIM2_CCMR2OUTPUT_OC4FE_MASK)

#define TIM2_CCMR2OUTPUT_CC4S_SHIFT             (8)
#define TIM2_CCMR2OUTPUT_CC4S_MASK              (0x3U << TIM2_CCMR2OUTPUT_CC4S_SHIFT)
#define TIM2_CCMR2OUTPUT_CC4S(x)                (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2OUTPUT_CC4S_SHIFT)) & TIM2_CCMR2OUTPUT_CC4S_MASK)

#define TIM2_CCMR2OUTPUT_OC3CE_SHIFT            (7)
#define TIM2_CCMR2OUTPUT_OC3CE_MASK             (0x1U << TIM2_CCMR2OUTPUT_OC3CE_SHIFT)
#define TIM2_CCMR2OUTPUT_OC3CE(x)               (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2OUTPUT_OC3CE_SHIFT)) & TIM2_CCMR2OUTPUT_OC3CE_MASK)

#define TIM2_CCMR2OUTPUT_OC3M_SHIFT             (4)
#define TIM2_CCMR2OUTPUT_OC3M_MASK              (0x7U << TIM2_CCMR2OUTPUT_OC3M_SHIFT)
#define TIM2_CCMR2OUTPUT_OC3M(x)                (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2OUTPUT_OC3M_SHIFT)) & TIM2_CCMR2OUTPUT_OC3M_MASK)

#define TIM2_CCMR2OUTPUT_OC3PE_SHIFT            (3)
#define TIM2_CCMR2OUTPUT_OC3PE_MASK             (0x1U << TIM2_CCMR2OUTPUT_OC3PE_SHIFT)
#define TIM2_CCMR2OUTPUT_OC3PE(x)               (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2OUTPUT_OC3PE_SHIFT)) & TIM2_CCMR2OUTPUT_OC3PE_MASK)

#define TIM2_CCMR2OUTPUT_OC3FE_SHIFT            (2)
#define TIM2_CCMR2OUTPUT_OC3FE_MASK             (0x1U << TIM2_CCMR2OUTPUT_OC3FE_SHIFT)
#define TIM2_CCMR2OUTPUT_OC3FE(x)               (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2OUTPUT_OC3FE_SHIFT)) & TIM2_CCMR2OUTPUT_OC3FE_MASK)

#define TIM2_CCMR2OUTPUT_CC3S_SHIFT             (0)
#define TIM2_CCMR2OUTPUT_CC3S_MASK              (0x3U << TIM2_CCMR2OUTPUT_CC3S_SHIFT)
#define TIM2_CCMR2OUTPUT_CC3S(x)                (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2OUTPUT_CC3S_SHIFT)) & TIM2_CCMR2OUTPUT_CC3S_MASK)

/*!
 * @brief TIM2_CCMR2_INPUT Register Bit Definition
 */

#define TIM2_CCMR2INPUT_IC4F_SHIFT              (12)
#define TIM2_CCMR2INPUT_IC4F_MASK               (0xFU << TIM2_CCMR2INPUT_IC4F_SHIFT)
#define TIM2_CCMR2INPUT_IC4F(x)                 (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2INPUT_IC4F_SHIFT)) & TIM2_CCMR2INPUT_IC4F_MASK)

#define TIM2_CCMR2INPUT_IC4PSC_SHIFT            (10)
#define TIM2_CCMR2INPUT_IC4PSC_MASK             (0x3U << TIM2_CCMR2INPUT_IC4PSC_SHIFT)
#define TIM2_CCMR2INPUT_IC4PSC(x)               (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2INPUT_IC4PSC_SHIFT)) & TIM2_CCMR2INPUT_IC4PSC_MASK)

#define TIM2_CCMR2INPUT_CC4S_SHIFT              (8)
#define TIM2_CCMR2INPUT_CC4S_MASK               (0x3U << TIM2_CCMR2INPUT_CC4S_SHIFT)
#define TIM2_CCMR2INPUT_CC4S(x)                 (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2INPUT_CC4S_SHIFT)) & TIM2_CCMR2INPUT_CC4S_MASK)

#define TIM2_CCMR2INPUT_IC3F_SHIFT              (4)
#define TIM2_CCMR2INPUT_IC3F_MASK               (0xFU << TIM2_CCMR2INPUT_IC3F_SHIFT)
#define TIM2_CCMR2INPUT_IC3F(x)                 (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2INPUT_IC3F_SHIFT)) & TIM2_CCMR2INPUT_IC3F_MASK)

#define TIM2_CCMR2INPUT_IC3PSC_SHIFT            (2)
#define TIM2_CCMR2INPUT_IC3PSC_MASK             (0x3U << TIM2_CCMR2INPUT_IC3PSC_SHIFT)
#define TIM2_CCMR2INPUT_IC3PSC(x)               (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2INPUT_IC3PSC_SHIFT)) & TIM2_CCMR2INPUT_IC3PSC_MASK)

#define TIM2_CCMR2INPUT_CC3S_SHIFT              (0)
#define TIM2_CCMR2INPUT_CC3S_MASK               (0x3U << TIM2_CCMR2INPUT_CC3S_SHIFT)
#define TIM2_CCMR2INPUT_CC3S(x)                 (((uint32_t)(((uint32_t)(x)) << TIM2_CCMR2INPUT_CC3S_SHIFT)) & TIM2_CCMR2INPUT_CC3S_MASK)

/*!
 * @brief TIM2_CCER Register Bit Definition
 */

#define TIM2_CCER_CC4NP_SHIFT                   (15)
#define TIM2_CCER_CC4NP_MASK                    (0x1U << TIM2_CCER_CC4NP_SHIFT)
#define TIM2_CCER_CC4NP(x)                      (((uint32_t)(((uint32_t)(x)) << TIM2_CCER_CC4NP_SHIFT)) & TIM2_CCER_CC4NP_MASK)

#define TIM2_CCER_CC4P_SHIFT                    (13)
#define TIM2_CCER_CC4P_MASK                     (0x1U << TIM2_CCER_CC4P_SHIFT)
#define TIM2_CCER_CC4P(x)                       (((uint32_t)(((uint32_t)(x)) << TIM2_CCER_CC4P_SHIFT)) & TIM2_CCER_CC4P_MASK)

