AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define TIM3_CCMR2OUTPUT_CC4S_SHIFT             (8)
#define TIM3_CCMR2OUTPUT_CC4S_MASK              (0x3U << TIM3_CCMR2OUTPUT_CC4S_SHIFT)
#define TIM3_CCMR2OUTPUT_CC4S(x)                (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2OUTPUT_CC4S_SHIFT)) & TIM3_CCMR2OUTPUT_CC4S_MASK)

#define TIM3_CCMR2OUTPUT_OC3CE_SHIFT            (7)
#define TIM3_CCMR2OUTPUT_OC3CE_MASK             (0x1U << TIM3_CCMR2OUTPUT_OC3CE_SHIFT)
#define TIM3_CCMR2OUTPUT_OC3CE(x)               (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2OUTPUT_OC3CE_SHIFT)) & TIM3_CCMR2OUTPUT_OC3CE_MASK)

#define TIM3_CCMR2OUTPUT_OC3M_SHIFT             (4)
#define TIM3_CCMR2OUTPUT_OC3M_MASK              (0x7U << TIM3_CCMR2OUTPUT_OC3M_SHIFT)
#define TIM3_CCMR2OUTPUT_OC3M(x)                (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2OUTPUT_OC3M_SHIFT)) & TIM3_CCMR2OUTPUT_OC3M_MASK)

#define TIM3_CCMR2OUTPUT_OC3PE_SHIFT            (3)
#define TIM3_CCMR2OUTPUT_OC3PE_MASK             (0x1U << TIM3_CCMR2OUTPUT_OC3PE_SHIFT)
#define TIM3_CCMR2OUTPUT_OC3PE(x)               (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2OUTPUT_OC3PE_SHIFT)) & TIM3_CCMR2OUTPUT_OC3PE_MASK)

#define TIM3_CCMR2OUTPUT_OC3FE_SHIFT            (2)
#define TIM3_CCMR2OUTPUT_OC3FE_MASK             (0x1U << TIM3_CCMR2OUTPUT_OC3FE_SHIFT)
#define TIM3_CCMR2OUTPUT_OC3FE(x)               (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2OUTPUT_OC3FE_SHIFT)) & TIM3_CCMR2OUTPUT_OC3FE_MASK)

#define TIM3_CCMR2OUTPUT_CC3S_SHIFT             (0)
#define TIM3_CCMR2OUTPUT_CC3S_MASK              (0x3U << TIM3_CCMR2OUTPUT_CC3S_SHIFT)
#define TIM3_CCMR2OUTPUT_CC3S(x)                (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2OUTPUT_CC3S_SHIFT)) & TIM3_CCMR2OUTPUT_CC3S_MASK)

/*!
 * @brief TIM3_CCMR2_INPUT Register Bit Definition
 */

#define TIM3_CCMR2INPUT_IC4F_SHIFT              (12)
#define TIM3_CCMR2INPUT_IC4F_MASK               (0xFU << TIM3_CCMR2INPUT_IC4F_SHIFT)
#define TIM3_CCMR2INPUT_IC4F(x)                 (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2INPUT_IC4F_SHIFT)) & TIM3_CCMR2INPUT_IC4F_MASK)

#define TIM3_CCMR2INPUT_IC4PSC_SHIFT            (10)
#define TIM3_CCMR2INPUT_IC4PSC_MASK             (0x3U << TIM3_CCMR2INPUT_IC4PSC_SHIFT)
#define TIM3_CCMR2INPUT_IC4PSC(x)               (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2INPUT_IC4PSC_SHIFT)) & TIM3_CCMR2INPUT_IC4PSC_MASK)

#define TIM3_CCMR2INPUT_CC4S_SHIFT              (8)
#define TIM3_CCMR2INPUT_CC4S_MASK               (0x3U << TIM3_CCMR2INPUT_CC4S_SHIFT)
#define TIM3_CCMR2INPUT_CC4S(x)                 (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2INPUT_CC4S_SHIFT)) & TIM3_CCMR2INPUT_CC4S_MASK)

#define TIM3_CCMR2INPUT_IC3F_SHIFT              (4)
#define TIM3_CCMR2INPUT_IC3F_MASK               (0xFU << TIM3_CCMR2INPUT_IC3F_SHIFT)
#define TIM3_CCMR2INPUT_IC3F(x)                 (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2INPUT_IC3F_SHIFT)) & TIM3_CCMR2INPUT_IC3F_MASK)

#define TIM3_CCMR2INPUT_IC3PSC_SHIFT            (2)
#define TIM3_CCMR2INPUT_IC3PSC_MASK             (0x3U << TIM3_CCMR2INPUT_IC3PSC_SHIFT)
#define TIM3_CCMR2INPUT_IC3PSC(x)               (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2INPUT_IC3PSC_SHIFT)) & TIM3_CCMR2INPUT_IC3PSC_MASK)

#define TIM3_CCMR2INPUT_CC3S_SHIFT              (0)
#define TIM3_CCMR2INPUT_CC3S_MASK               (0x3U << TIM3_CCMR2INPUT_CC3S_SHIFT)
#define TIM3_CCMR2INPUT_CC3S(x)                 (((uint32_t)(((uint32_t)(x)) << TIM3_CCMR2INPUT_CC3S_SHIFT)) & TIM3_CCMR2INPUT_CC3S_MASK)

/*!
 * @brief TIM3_CCER Register Bit Definition
 */

#define TIM3_CCER_CC4NP_SHIFT                   (15)
#define TIM3_CCER_CC4NP_MASK                    (0x1U << TIM3_CCER_CC4NP_SHIFT)
#define TIM3_CCER_CC4NP(x)                      (((uint32_t)(((uint32_t)(x)) << TIM3_CCER_CC4NP_SHIFT)) & TIM3_CCER_CC4NP_MASK)

#define TIM3_CCER_CC4P_SHIFT                    (13)
#define TIM3_CCER_CC4P_MASK                     (0x1U << TIM3_CCER_CC4P_SHIFT)
#define TIM3_CCER_CC4P(x)                       (((uint32_t)(((uint32_t)(x)) << TIM3_CCER_CC4P_SHIFT)) & TIM3_CCER_CC4P_MASK)

#define TIM3_CCER_CC4E_SHIFT                    (12)
#define TIM3_CCER_CC4E_MASK                     (0x1U << TIM3_CCER_CC4E_SHIFT)
#define TIM3_CCER_CC4E(x)                       (((uint32_t)(((uint32_t)(x)) << TIM3_CCER_CC4E_SHIFT)) & TIM3_CCER_CC4E_MASK)

#define TIM3_CCER_CC3NP_SHIFT                   (11)
#define TIM3_CCER_CC3NP_MASK                    (0x1U << TIM3_CCER_CC3NP_SHIFT)
#define TIM3_CCER_CC3NP(x)                      (((uint32_t)(((uint32_t)(x)) << TIM3_CCER_CC3NP_SHIFT)) & TIM3_CCER_CC3NP_MASK)

#define TIM3_CCER_CC3P_SHIFT                    (9)
#define TIM3_CCER_CC3P_MASK                     (0x1U << TIM3_CCER_CC3P_SHIFT)
#define TIM3_CCER_CC3P(x)                       (((uint32_t)(((uint32_t)(x)) << TIM3_CCER_CC3P_SHIFT)) & TIM3_CCER_CC3P_MASK)

#define TIM3_CCER_CC3E_SHIFT                    (8)
#define TIM3_CCER_CC3E_MASK                     (0x1U << TIM3_CCER_CC3E_SHIFT)
#define TIM3_CCER_CC3E(x)                       (((uint32_t)(((uint32_t)(x)) << TIM3_CCER_CC3E_SHIFT)) & TIM3_CCER_CC3E_MASK)

#define TIM3_CCER_CC2NP_SHIFT                   (7)
#define TIM3_CCER_CC2NP_MASK                    (0x1U << TIM3_CCER_CC2NP_SHIFT)
#define TIM3_CCER_CC2NP(x)                      (((uint32_t)(((uint32_t)(x)) << TIM3_CCER_CC2NP_SHIFT)) & TIM3_CCER_CC2NP_MASK)

#define TIM3_CCER_CC2P_SHIFT                    (5)
#define TIM3_CCER_CC2P_MASK                     (0x1U << TIM3_CCER_CC2P_SHIFT)
#define TIM3_CCER_CC2P(x)                       (((uint32_t)(((uint32_t)(x)) << TIM3_CCER_CC2P_SHIFT)) & TIM3_CCER_CC2P_MASK)

#define TIM3_CCER_CC2E_SHIFT                    (4)
#define TIM3_CCER_CC2E_MASK                     (0x1U << TIM3_CCER_CC2E_SHIFT)
#define TIM3_CCER_CC2E(x)                       (((uint32_t)(((uint32_t)(x)) << TIM3_CCER_CC2E_SHIFT)) & TIM3_CCER_CC2E_MASK)

#define TIM3_CCER_CC1NP_SHIFT                   (3)
#define TIM3_CCER_CC1NP_MASK                    (0x1U << TIM3_CCER_CC1NP_SHIFT)
#define TIM3_CCER_CC1NP(x)                      (((uint32_t)(((uint32_t)(x)) << TIM3_CCER_CC1NP_SHIFT)) & TIM3_CCER_CC1NP_MASK)

#define TIM3_CCER_CC1P_SHIFT                    (1)
#define TIM3_CCER_CC1P_MASK                     (0x1U << TIM3_CCER_CC1P_SHIFT)
#define TIM3_CCER_CC1P(x)                       (((uint32_t)(((uint32_t)(x)) << TIM3_CCER_CC1P_SHIFT)) & TIM3_CCER_CC1P_MASK)

#define TIM3_CCER_CC1E_SHIFT                    (0)
#define TIM3_CCER_CC1E_MASK                     (0x1U << TIM3_CCER_CC1E_SHIFT)
#define TIM3_CCER_CC1E(x)                       (((uint32_t)(((uint32_t)(x)) << TIM3_CCER_CC1E_SHIFT)) & TIM3_CCER_CC1E_MASK)

/*!
 * @brief TIM3_CNT Register Bit Definition
 */

#define TIM3_CNT_CNT_SHIFT                      (0)
#define TIM3_CNT_CNT_MASK                       (0xFFFFU << TIM3_CNT_CNT_SHIFT)
#define TIM3_CNT_CNT(x)                         (((uint32_t)(((uint32_t)(x)) << TIM3_CNT_CNT_SHIFT)) & TIM3_CNT_CNT_MASK)

/*!
 * @brief TIM3_PSC Register Bit Definition
 */

