AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define UART3                ((UART_Type*)UART3_BASE)

#define UART4                ((UART_Type*)UART4_BASE)

/*!
 * @}
 */ /* end of group UART_Peripheral_Access_Layer */



/*!
 * @addtogroup USART_Peripheral_Access_Layer USART Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * USART Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t SR;                                                           ///< Status register                              offset: 0x00
    __IO uint32_t DR;                                                           ///< Data register                                offset: 0x04
    __IO uint32_t BRR;                                                          ///< Baud rate register                           offset: 0x08
    __IO uint32_t CR1;                                                          ///< Control register 1                           offset: 0x0C
    __IO uint32_t CR2;                                                          ///< Control register 2                           offset: 0x10
    __IO uint32_t CR3;                                                          ///< Control register 3                           offset: 0x14
    __IO uint32_t GTPR;                                                         ///< Guard time and prescaler register            offset: 0x18
    __IO uint32_t WAD;                                                          ///< Wakeup address register                      offset: 0x1C
} USART_Type;

/*******************************************************************************
 * USART Type
 ******************************************************************************/

/*!
 * @addtogroup USART_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief USART_SR Register Bit Definition
 */

#define USART_SR_BE_SHIFT                       (12)
#define USART_SR_BE_MASK                        (0x1U << USART_SR_BE_SHIFT)
#define USART_SR_BE(x)                          (((uint32_t)(((uint32_t)(x)) << USART_SR_BE_SHIFT)) & USART_SR_BE_MASK)

#define USART_SR_MPRID_SHIFT                    (11)
#define USART_SR_MPRID_MASK                     (0x1U << USART_SR_MPRID_SHIFT)
#define USART_SR_MPRID(x)                       (((uint32_t)(((uint32_t)(x)) << USART_SR_MPRID_SHIFT)) & USART_SR_MPRID_MASK)

#define USART_SR_ATBRRC_SHIFT                   (10)
#define USART_SR_ATBRRC_MASK                    (0x1U << USART_SR_ATBRRC_SHIFT)
#define USART_SR_ATBRRC(x)                      (((uint32_t)(((uint32_t)(x)) << USART_SR_ATBRRC_SHIFT)) & USART_SR_ATBRRC_MASK)

#define USART_SR_CTS_SHIFT                      (9)
#define USART_SR_CTS_MASK                       (0x1U << USART_SR_CTS_SHIFT)
#define USART_SR_CTS(x)                         (((uint32_t)(((uint32_t)(x)) << USART_SR_CTS_SHIFT)) & USART_SR_CTS_MASK)

#define USART_SR_LBD_SHIFT                      (8)
#define USART_SR_LBD_MASK                       (0x1U << USART_SR_LBD_SHIFT)
#define USART_SR_LBD(x)                         (((uint32_t)(((uint32_t)(x)) << USART_SR_LBD_SHIFT)) & USART_SR_LBD_MASK)

#define USART_SR_TXE_SHIFT                      (7)
#define USART_SR_TXE_MASK                       (0x1U << USART_SR_TXE_SHIFT)
#define USART_SR_TXE(x)                         (((uint32_t)(((uint32_t)(x)) << USART_SR_TXE_SHIFT)) & USART_SR_TXE_MASK)

#define USART_SR_TC_SHIFT                       (6)
#define USART_SR_TC_MASK                        (0x1U << USART_SR_TC_SHIFT)
#define USART_SR_TC(x)                          (((uint32_t)(((uint32_t)(x)) << USART_SR_TC_SHIFT)) & USART_SR_TC_MASK)

#define USART_SR_RXNE_SHIFT                     (5)
#define USART_SR_RXNE_MASK                      (0x1U << USART_SR_RXNE_SHIFT)
#define USART_SR_RXNE(x)                        (((uint32_t)(((uint32_t)(x)) << USART_SR_RXNE_SHIFT)) & USART_SR_RXNE_MASK)

#define USART_SR_IDLE_SHIFT                     (4)
#define USART_SR_IDLE_MASK                      (0x1U << USART_SR_IDLE_SHIFT)
#define USART_SR_IDLE(x)                        (((uint32_t)(((uint32_t)(x)) << USART_SR_IDLE_SHIFT)) & USART_SR_IDLE_MASK)

#define USART_SR_ORE_SHIFT                      (3)
#define USART_SR_ORE_MASK                       (0x1U << USART_SR_ORE_SHIFT)
#define USART_SR_ORE(x)                         (((uint32_t)(((uint32_t)(x)) << USART_SR_ORE_SHIFT)) & USART_SR_ORE_MASK)

#define USART_SR_NF_SHIFT                       (2)
#define USART_SR_NF_MASK                        (0x1U << USART_SR_NF_SHIFT)
#define USART_SR_NF(x)                          (((uint32_t)(((uint32_t)(x)) << USART_SR_NF_SHIFT)) & USART_SR_NF_MASK)

#define USART_SR_FE_SHIFT                       (1)
#define USART_SR_FE_MASK                        (0x1U << USART_SR_FE_SHIFT)
#define USART_SR_FE(x)                          (((uint32_t)(((uint32_t)(x)) << USART_SR_FE_SHIFT)) & USART_SR_FE_MASK)

#define USART_SR_PE_SHIFT                       (0)
#define USART_SR_PE_MASK                        (0x1U << USART_SR_PE_SHIFT)
#define USART_SR_PE(x)                          (((uint32_t)(((uint32_t)(x)) << USART_SR_PE_SHIFT)) & USART_SR_PE_MASK)

/*!
 * @brief USART_DR Register Bit Definition
 */

#define USART_DR_MPID_SHIFT                     (9)
#define USART_DR_MPID_MASK                      (0x1U << USART_DR_MPID_SHIFT)
#define USART_DR_MPID(x)                        (((uint32_t)(((uint32_t)(x)) << USART_DR_MPID_SHIFT)) & USART_DR_MPID_MASK)

#define USART_DR_DR_SHIFT                       (0)
#define USART_DR_DR_MASK                        (0x1FFU << USART_DR_DR_SHIFT)
#define USART_DR_DR(x)                          (((uint32_t)(((uint32_t)(x)) << USART_DR_DR_SHIFT)) & USART_DR_DR_MASK)

/*!
 * @brief USART_BRR Register Bit Definition
 */

#define USART_BRR_MFD_SHIFT                     (4)
#define USART_BRR_MFD_MASK                      (0xFFFFU << USART_BRR_MFD_SHIFT)
#define USART_BRR_MFD(x)                        (((uint32_t)(((uint32_t)(x)) << USART_BRR_MFD_SHIFT)) & USART_BRR_MFD_MASK)

#define USART_BRR_FFD_SHIFT                     (0)
#define USART_BRR_FFD_MASK                      (0xFU << USART_BRR_FFD_SHIFT)
#define USART_BRR_FFD(x)                        (((uint32_t)(((uint32_t)(x)) << USART_BRR_FFD_SHIFT)) & USART_BRR_FFD_MASK)

/*!
 * @brief USART_CR1 Register Bit Definition
 */

#define USART_CR1_SAS_SHIFT                     (17)
#define USART_CR1_SAS_MASK                      (0x1U << USART_CR1_SAS_SHIFT)
#define USART_CR1_SAS(x)                        (((uint32_t)(((uint32_t)(x)) << USART_CR1_SAS_SHIFT)) & USART_CR1_SAS_MASK)

