AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define USART_CR1_MLS_SHIFT                     (16)
#define USART_CR1_MLS_MASK                      (0x1U << USART_CR1_MLS_SHIFT)
#define USART_CR1_MLS(x)                        (((uint32_t)(((uint32_t)(x)) << USART_CR1_MLS_SHIFT)) & USART_CR1_MLS_MASK)

#define USART_CR1_OVER8_SHIFT                   (15)
#define USART_CR1_OVER8_MASK                    (0x1U << USART_CR1_OVER8_SHIFT)
#define USART_CR1_OVER8(x)                      (((uint32_t)(((uint32_t)(x)) << USART_CR1_OVER8_SHIFT)) & USART_CR1_OVER8_MASK)

#define USART_CR1_MPE_SHIFT                     (14)
#define USART_CR1_MPE_MASK                      (0x1U << USART_CR1_MPE_SHIFT)
#define USART_CR1_MPE(x)                        (((uint32_t)(((uint32_t)(x)) << USART_CR1_MPE_SHIFT)) & USART_CR1_MPE_MASK)

#define USART_CR1_UE_SHIFT                      (13)
#define USART_CR1_UE_MASK                       (0x1U << USART_CR1_UE_SHIFT)
#define USART_CR1_UE(x)                         (((uint32_t)(((uint32_t)(x)) << USART_CR1_UE_SHIFT)) & USART_CR1_UE_MASK)

#define USART_CR1_DL_SHIFT                      (12)
#define USART_CR1_DL_MASK                       (0x1U << USART_CR1_DL_SHIFT)
#define USART_CR1_DL(x)                         (((uint32_t)(((uint32_t)(x)) << USART_CR1_DL_SHIFT)) & USART_CR1_DL_MASK)

#define USART_CR1_WAKE_SHIFT                    (11)
#define USART_CR1_WAKE_MASK                     (0x1U << USART_CR1_WAKE_SHIFT)
#define USART_CR1_WAKE(x)                       (((uint32_t)(((uint32_t)(x)) << USART_CR1_WAKE_SHIFT)) & USART_CR1_WAKE_MASK)

#define USART_CR1_PCE_SHIFT                     (10)
#define USART_CR1_PCE_MASK                      (0x1U << USART_CR1_PCE_SHIFT)
#define USART_CR1_PCE(x)                        (((uint32_t)(((uint32_t)(x)) << USART_CR1_PCE_SHIFT)) & USART_CR1_PCE_MASK)

#define USART_CR1_PS_SHIFT                      (9)
#define USART_CR1_PS_MASK                       (0x1U << USART_CR1_PS_SHIFT)
#define USART_CR1_PS(x)                         (((uint32_t)(((uint32_t)(x)) << USART_CR1_PS_SHIFT)) & USART_CR1_PS_MASK)

#define USART_CR1_PEIEN_SHIFT                   (8)
#define USART_CR1_PEIEN_MASK                    (0x1U << USART_CR1_PEIEN_SHIFT)
#define USART_CR1_PEIEN(x)                      (((uint32_t)(((uint32_t)(x)) << USART_CR1_PEIEN_SHIFT)) & USART_CR1_PEIEN_MASK)

#define USART_CR1_TXEIEN_SHIFT                  (7)
#define USART_CR1_TXEIEN_MASK                   (0x1U << USART_CR1_TXEIEN_SHIFT)
#define USART_CR1_TXEIEN(x)                     (((uint32_t)(((uint32_t)(x)) << USART_CR1_TXEIEN_SHIFT)) & USART_CR1_TXEIEN_MASK)

#define USART_CR1_TCIEN_SHIFT                   (6)
#define USART_CR1_TCIEN_MASK                    (0x1U << USART_CR1_TCIEN_SHIFT)
#define USART_CR1_TCIEN(x)                      (((uint32_t)(((uint32_t)(x)) << USART_CR1_TCIEN_SHIFT)) & USART_CR1_TCIEN_MASK)

#define USART_CR1_RXNEIEN_SHIFT                 (5)
#define USART_CR1_RXNEIEN_MASK                  (0x1U << USART_CR1_RXNEIEN_SHIFT)
#define USART_CR1_RXNEIEN(x)                    (((uint32_t)(((uint32_t)(x)) << USART_CR1_RXNEIEN_SHIFT)) & USART_CR1_RXNEIEN_MASK)

#define USART_CR1_IDLEIEN_SHIFT                 (4)
#define USART_CR1_IDLEIEN_MASK                  (0x1U << USART_CR1_IDLEIEN_SHIFT)
#define USART_CR1_IDLEIEN(x)                    (((uint32_t)(((uint32_t)(x)) << USART_CR1_IDLEIEN_SHIFT)) & USART_CR1_IDLEIEN_MASK)

#define USART_CR1_TE_SHIFT                      (3)
#define USART_CR1_TE_MASK                       (0x1U << USART_CR1_TE_SHIFT)
#define USART_CR1_TE(x)                         (((uint32_t)(((uint32_t)(x)) << USART_CR1_TE_SHIFT)) & USART_CR1_TE_MASK)

#define USART_CR1_RE_SHIFT                      (2)
#define USART_CR1_RE_MASK                       (0x1U << USART_CR1_RE_SHIFT)
#define USART_CR1_RE(x)                         (((uint32_t)(((uint32_t)(x)) << USART_CR1_RE_SHIFT)) & USART_CR1_RE_MASK)

#define USART_CR1_RWU_SHIFT                     (1)
#define USART_CR1_RWU_MASK                      (0x1U << USART_CR1_RWU_SHIFT)
#define USART_CR1_RWU(x)                        (((uint32_t)(((uint32_t)(x)) << USART_CR1_RWU_SHIFT)) & USART_CR1_RWU_MASK)

#define USART_CR1_SBK_SHIFT                     (0)
#define USART_CR1_SBK_MASK                      (0x1U << USART_CR1_SBK_SHIFT)
#define USART_CR1_SBK(x)                        (((uint32_t)(((uint32_t)(x)) << USART_CR1_SBK_SHIFT)) & USART_CR1_SBK_MASK)

/*!
 * @brief USART_CR2 Register Bit Definition
 */

#define USART_CR2_SWAP_SHIFT                    (15)
#define USART_CR2_SWAP_MASK                     (0x1U << USART_CR2_SWAP_SHIFT)
#define USART_CR2_SWAP(x)                       (((uint32_t)(((uint32_t)(x)) << USART_CR2_SWAP_SHIFT)) & USART_CR2_SWAP_MASK)

#define USART_CR2_LINEN_SHIFT                   (14)
#define USART_CR2_LINEN_MASK                    (0x1U << USART_CR2_LINEN_SHIFT)
#define USART_CR2_LINEN(x)                      (((uint32_t)(((uint32_t)(x)) << USART_CR2_LINEN_SHIFT)) & USART_CR2_LINEN_MASK)

#define USART_CR2_STOP_SHIFT                    (12)
#define USART_CR2_STOP_MASK                     (0x3U << USART_CR2_STOP_SHIFT)
#define USART_CR2_STOP(x)                       (((uint32_t)(((uint32_t)(x)) << USART_CR2_STOP_SHIFT)) & USART_CR2_STOP_MASK)

#define USART_CR2_CLKEN_SHIFT                   (11)
#define USART_CR2_CLKEN_MASK                    (0x1U << USART_CR2_CLKEN_SHIFT)
#define USART_CR2_CLKEN(x)                      (((uint32_t)(((uint32_t)(x)) << USART_CR2_CLKEN_SHIFT)) & USART_CR2_CLKEN_MASK)

#define USART_CR2_CPOL_SHIFT                    (10)
#define USART_CR2_CPOL_MASK                     (0x1U << USART_CR2_CPOL_SHIFT)
#define USART_CR2_CPOL(x)                       (((uint32_t)(((uint32_t)(x)) << USART_CR2_CPOL_SHIFT)) & USART_CR2_CPOL_MASK)

#define USART_CR2_CPHA_SHIFT                    (9)
#define USART_CR2_CPHA_MASK                     (0x1U << USART_CR2_CPHA_SHIFT)
#define USART_CR2_CPHA(x)                       (((uint32_t)(((uint32_t)(x)) << USART_CR2_CPHA_SHIFT)) & USART_CR2_CPHA_MASK)

#define USART_CR2_LBDIEN_SHIFT                  (6)
#define USART_CR2_LBDIEN_MASK                   (0x1U << USART_CR2_LBDIEN_SHIFT)
#define USART_CR2_LBDIEN(x)                     (((uint32_t)(((uint32_t)(x)) << USART_CR2_LBDIEN_SHIFT)) & USART_CR2_LBDIEN_MASK)

#define USART_CR2_LBDL_SHIFT                    (5)
#define USART_CR2_LBDL_MASK                     (0x1U << USART_CR2_LBDL_SHIFT)
#define USART_CR2_LBDL(x)                       (((uint32_t)(((uint32_t)(x)) << USART_CR2_LBDL_SHIFT)) & USART_CR2_LBDL_MASK)

