AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
#define USART_CR2_ATBRRCIEN_SHIFT               (4)
#define USART_CR2_ATBRRCIEN_MASK                (0x1U << USART_CR2_ATBRRCIEN_SHIFT)
#define USART_CR2_ATBRRCIEN(x)                  (((uint32_t)(((uint32_t)(x)) << USART_CR2_ATBRRCIEN_SHIFT)) & USART_CR2_ATBRRCIEN_MASK)

#define USART_CR2_ATBRRE_SHIFT                  (3)
#define USART_CR2_ATBRRE_MASK                   (0x1U << USART_CR2_ATBRRE_SHIFT)
#define USART_CR2_ATBRRE(x)                     (((uint32_t)(((uint32_t)(x)) << USART_CR2_ATBRRE_SHIFT)) & USART_CR2_ATBRRE_MASK)

#define USART_CR2_BEIEN_SHIFT                   (1)
#define USART_CR2_BEIEN_MASK                    (0x1U << USART_CR2_BEIEN_SHIFT)
#define USART_CR2_BEIEN(x)                      (((uint32_t)(((uint32_t)(x)) << USART_CR2_BEIEN_SHIFT)) & USART_CR2_BEIEN_MASK)

#define USART_CR2_BEEN_SHIFT                    (0)
#define USART_CR2_BEEN_MASK                     (0x1U << USART_CR2_BEEN_SHIFT)
#define USART_CR2_BEEN(x)                       (((uint32_t)(((uint32_t)(x)) << USART_CR2_BEEN_SHIFT)) & USART_CR2_BEEN_MASK)

/*!
 * @brief USART_CR3 Register Bit Definition
 */

#define USART_CR3_TXTOG_SHIFT                   (29)
#define USART_CR3_TXTOG_MASK                    (0x1U << USART_CR3_TXTOG_SHIFT)
#define USART_CR3_TXTOG(x)                      (((uint32_t)(((uint32_t)(x)) << USART_CR3_TXTOG_SHIFT)) & USART_CR3_TXTOG_MASK)

#define USART_CR3_RXTOG_SHIFT                   (28)
#define USART_CR3_RXTOG_MASK                    (0x1U << USART_CR3_RXTOG_SHIFT)
#define USART_CR3_RXTOG(x)                      (((uint32_t)(((uint32_t)(x)) << USART_CR3_RXTOG_SHIFT)) & USART_CR3_RXTOG_MASK)

#define USART_CR3_CKINE_SHIFT                   (16)
#define USART_CR3_CKINE_MASK                    (0x1U << USART_CR3_CKINE_SHIFT)
#define USART_CR3_CKINE(x)                      (((uint32_t)(((uint32_t)(x)) << USART_CR3_CKINE_SHIFT)) & USART_CR3_CKINE_MASK)

#define USART_CR3_SOVER_SHIFT                   (12)
#define USART_CR3_SOVER_MASK                    (0x7U << USART_CR3_SOVER_SHIFT)
#define USART_CR3_SOVER(x)                      (((uint32_t)(((uint32_t)(x)) << USART_CR3_SOVER_SHIFT)) & USART_CR3_SOVER_MASK)

#define USART_CR3_ONEBIT_SHIFT                  (11)
#define USART_CR3_ONEBIT_MASK                   (0x1U << USART_CR3_ONEBIT_SHIFT)
#define USART_CR3_ONEBIT(x)                     (((uint32_t)(((uint32_t)(x)) << USART_CR3_ONEBIT_SHIFT)) & USART_CR3_ONEBIT_MASK)

#define USART_CR3_CTSIEN_SHIFT                  (10)
#define USART_CR3_CTSIEN_MASK                   (0x1U << USART_CR3_CTSIEN_SHIFT)
#define USART_CR3_CTSIEN(x)                     (((uint32_t)(((uint32_t)(x)) << USART_CR3_CTSIEN_SHIFT)) & USART_CR3_CTSIEN_MASK)

#define USART_CR3_CTSE_SHIFT                    (9)
#define USART_CR3_CTSE_MASK                     (0x1U << USART_CR3_CTSE_SHIFT)
#define USART_CR3_CTSE(x)                       (((uint32_t)(((uint32_t)(x)) << USART_CR3_CTSE_SHIFT)) & USART_CR3_CTSE_MASK)

#define USART_CR3_RTSE_SHIFT                    (8)
#define USART_CR3_RTSE_MASK                     (0x1U << USART_CR3_RTSE_SHIFT)
#define USART_CR3_RTSE(x)                       (((uint32_t)(((uint32_t)(x)) << USART_CR3_RTSE_SHIFT)) & USART_CR3_RTSE_MASK)

#define USART_CR3_DMAMODE_SHIFT                 (6)
#define USART_CR3_DMAMODE_MASK                  (0x1U << USART_CR3_DMAMODE_SHIFT)
#define USART_CR3_DMAMODE(x)                    (((uint32_t)(((uint32_t)(x)) << USART_CR3_DMAMODE_SHIFT)) & USART_CR3_DMAMODE_MASK)

#define USART_CR3_SCEN_SHIFT                    (5)
#define USART_CR3_SCEN_MASK                     (0x1U << USART_CR3_SCEN_SHIFT)
#define USART_CR3_SCEN(x)                       (((uint32_t)(((uint32_t)(x)) << USART_CR3_SCEN_SHIFT)) & USART_CR3_SCEN_MASK)

#define USART_CR3_NACK_SHIFT                    (4)
#define USART_CR3_NACK_MASK                     (0x1U << USART_CR3_NACK_SHIFT)
#define USART_CR3_NACK(x)                       (((uint32_t)(((uint32_t)(x)) << USART_CR3_NACK_SHIFT)) & USART_CR3_NACK_MASK)

#define USART_CR3_HDSEL_SHIFT                   (3)
#define USART_CR3_HDSEL_MASK                    (0x1U << USART_CR3_HDSEL_SHIFT)
#define USART_CR3_HDSEL(x)                      (((uint32_t)(((uint32_t)(x)) << USART_CR3_HDSEL_SHIFT)) & USART_CR3_HDSEL_MASK)

#define USART_CR3_IRLP_SHIFT                    (2)
#define USART_CR3_IRLP_MASK                     (0x1U << USART_CR3_IRLP_SHIFT)
#define USART_CR3_IRLP(x)                       (((uint32_t)(((uint32_t)(x)) << USART_CR3_IRLP_SHIFT)) & USART_CR3_IRLP_MASK)

#define USART_CR3_IRDAEN_SHIFT                  (1)
#define USART_CR3_IRDAEN_MASK                   (0x1U << USART_CR3_IRDAEN_SHIFT)
#define USART_CR3_IRDAEN(x)                     (((uint32_t)(((uint32_t)(x)) << USART_CR3_IRDAEN_SHIFT)) & USART_CR3_IRDAEN_MASK)

#define USART_CR3_ERRIEN_SHIFT                  (0)
#define USART_CR3_ERRIEN_MASK                   (0x1U << USART_CR3_ERRIEN_SHIFT)
#define USART_CR3_ERRIEN(x)                     (((uint32_t)(((uint32_t)(x)) << USART_CR3_ERRIEN_SHIFT)) & USART_CR3_ERRIEN_MASK)

/*!
 * @brief USART_GTPR Register Bit Definition
 */

#define USART_GTPR_GCNT_SHIFT                   (8)
#define USART_GTPR_GCNT_MASK                    (0xFFU << USART_GTPR_GCNT_SHIFT)
#define USART_GTPR_GCNT(x)                      (((uint32_t)(((uint32_t)(x)) << USART_GTPR_GCNT_SHIFT)) & USART_GTPR_GCNT_MASK)

#define USART_GTPR_PSC_SHIFT                    (0)
#define USART_GTPR_PSC_MASK                     (0xFFU << USART_GTPR_PSC_SHIFT)
#define USART_GTPR_PSC(x)                       (((uint32_t)(((uint32_t)(x)) << USART_GTPR_PSC_SHIFT)) & USART_GTPR_PSC_MASK)

/*!
 * @brief USART_WADR Register Bit Definition
 */

#define USART_WADR_WADM_SHIFT                   (8)
#define USART_WADR_WADM_MASK                    (0xFFU << USART_WADR_WADM_SHIFT)
#define USART_WADR_WADM(x)                      (((uint32_t)(((uint32_t)(x)) << USART_WADR_WADM_SHIFT)) & USART_WADR_WADM_MASK)

#define USART_WADR_WPAD_SHIFT                   (1)
#define USART_WADR_WPAD_MASK                    (0x7FU << USART_WADR_WPAD_SHIFT)
#define USART_WADR_WPAD(x)                      (((uint32_t)(((uint32_t)(x)) << USART_WADR_WPAD_SHIFT)) & USART_WADR_WPAD_MASK)

/*!
 * @}
 */ /* end of group USART_Register_Masks */
/******************************************************************************
 *USART Instance
*******************************************************************************/

#define USART                ((USART_Type*)USART_BASE)

/*!
 * @}
 */ /* end of group USART_Peripheral_Access_Layer */



/*!
 * @addtogroup USB_Peripheral_Access_Layer USB Peripheral Access Layer
 *  @{
 */

