AllenMaa/mm32f5330_canable/code/mm32f5330_canable_mdk/device/mm32f5333d.h
/*******************************************************************************
 * USB Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t Reserved0[4];                                                 ///< Reserved
    __IO uint32_t FSOTGISTAT;                                                   ///< OTG Interrupt Status Register                offset: 0x10
    __IO uint32_t FSOTGICTRL;                                                   ///< OTG Interrupt Control Register               offset: 0x14
    __IO uint32_t FSOTGSTAT;                                                    ///< OTG Status Register                          offset: 0x18
    __IO uint32_t FSOTGCTRL;                                                    ///< OTG Control Register                         offset: 0x1C
    __IO uint32_t Reserved1[24];                                                ///< Reserved
    __IO uint32_t FSINTSTAT;                                                    ///< Interrupt Status Register                    offset: 0x80
    __IO uint32_t FSINTENB;                                                     ///< Interrupt Enable Register                    offset: 0x84
    __IO uint32_t FSERRSTAT;                                                    ///< Error Interrupt Status Register              offset: 0x88
    __IO uint32_t FSERRENB;                                                     ///< Error Interrupt Enable Register              offset: 0x8C
    __IO uint32_t FSSTAT;                                                       ///< Status Register                              offset: 0x90
    __IO uint32_t FSCTL;                                                        ///< Control Register                             offset: 0x94
    __IO uint32_t FSADDR;                                                       ///< Address Register                             offset: 0x98
    __IO uint32_t FSBDTPAGE1;                                                   ///< BDT Page Register 1                          offset: 0x9C
    __IO uint32_t FSFRMNUML;                                                    ///< Low Frame Number Register                    offset: 0xA0
    __IO uint32_t FSFRMNUMH;                                                    ///< High Frame Number Register                   offset: 0xA4
    __IO uint32_t FSTOKEN;                                                      ///< Token Register                               offset: 0xA8
    __IO uint32_t FSSOFTHLD;                                                    ///< SOF Threshold Register                       offset: 0xAC
    __IO uint32_t FSBDTPAGE2;                                                   ///< BDT Page Register 2                          offset: 0xB0
    __IO uint32_t FSBDTPAGE3;                                                   ///< BDT Page Register 3                          offset: 0xB4
    __IO uint32_t Reserved2[2];                                                 ///< Reserved
    __IO uint32_t FSEPCTL[16];                                                  ///< Endpoint Control Register 0~15               offset: 0xC0
    __IO uint32_t FSUSBCTRL;                                                    ///< USB Control Register                         offset: 0x100
} USB_Type;

/*******************************************************************************
 * USB Type
 ******************************************************************************/

/*!
 * @addtogroup USB_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief USB_FS_OTGISTAT Register Bit Definition
 */

#define USB_FSOTGISTAT_IDCHG_SHIFT              (7)
#define USB_FSOTGISTAT_IDCHG_MASK               (0x1U << USB_FSOTGISTAT_IDCHG_SHIFT)
#define USB_FSOTGISTAT_IDCHG(x)                 (((uint32_t)(((uint32_t)(x)) << USB_FSOTGISTAT_IDCHG_SHIFT)) & USB_FSOTGISTAT_IDCHG_MASK)

/*!
 * @brief USB_FS_OTGICTR Register Bit Definition
 */

#define USB_FSOTGICTR_IDEN_SHIFT                (7)
#define USB_FSOTGICTR_IDEN_MASK                 (0x1U << USB_FSOTGICTR_IDEN_SHIFT)
#define USB_FSOTGICTR_IDEN(x)                   (((uint32_t)(((uint32_t)(x)) << USB_FSOTGICTR_IDEN_SHIFT)) & USB_FSOTGICTR_IDEN_MASK)

/*!
 * @brief USB_FS_OTGSTAT Register Bit Definition
 */

#define USB_FSOTGSTAT_ID_SHIFT                  (7)
#define USB_FSOTGSTAT_ID_MASK                   (0x1U << USB_FSOTGSTAT_ID_SHIFT)
#define USB_FSOTGSTAT_ID(x)                     (((uint32_t)(((uint32_t)(x)) << USB_FSOTGSTAT_ID_SHIFT)) & USB_FSOTGSTAT_ID_MASK)

/*!
 * @brief USB_FS_OTGCTRL Register Bit Definition
 */

#define USB_FSOTGCTRL_VBUSON_SHIFT              (3)
#define USB_FSOTGCTRL_VBUSON_MASK               (0x1U << USB_FSOTGCTRL_VBUSON_SHIFT)
#define USB_FSOTGCTRL_VBUSON(x)                 (((uint32_t)(((uint32_t)(x)) << USB_FSOTGCTRL_VBUSON_SHIFT)) & USB_FSOTGCTRL_VBUSON_MASK)

/*!
 * @brief USB_FS_INTSTAT Register Bit Definition
 */

#define USB_FSINTSTAT_STALL_SHIFT               (7)
#define USB_FSINTSTAT_STALL_MASK                (0x1U << USB_FSINTSTAT_STALL_SHIFT)
#define USB_FSINTSTAT_STALL(x)                  (((uint32_t)(((uint32_t)(x)) << USB_FSINTSTAT_STALL_SHIFT)) & USB_FSINTSTAT_STALL_MASK)

#define USB_FSINTSTAT_ATTACH_SHIFT              (6)
#define USB_FSINTSTAT_ATTACH_MASK               (0x1U << USB_FSINTSTAT_ATTACH_SHIFT)
#define USB_FSINTSTAT_ATTACH(x)                 (((uint32_t)(((uint32_t)(x)) << USB_FSINTSTAT_ATTACH_SHIFT)) & USB_FSINTSTAT_ATTACH_MASK)

#define USB_FSINTSTAT_RESUME_SHIFT              (5)
#define USB_FSINTSTAT_RESUME_MASK               (0x1U << USB_FSINTSTAT_RESUME_SHIFT)
#define USB_FSINTSTAT_RESUME(x)                 (((uint32_t)(((uint32_t)(x)) << USB_FSINTSTAT_RESUME_SHIFT)) & USB_FSINTSTAT_RESUME_MASK)

#define USB_FSINTSTAT_SLEEP_SHIFT               (4)
#define USB_FSINTSTAT_SLEEP_MASK                (0x1U << USB_FSINTSTAT_SLEEP_SHIFT)
#define USB_FSINTSTAT_SLEEP(x)                  (((uint32_t)(((uint32_t)(x)) << USB_FSINTSTAT_SLEEP_SHIFT)) & USB_FSINTSTAT_SLEEP_MASK)

#define USB_FSINTSTAT_TOKDNE_SHIFT              (3)
#define USB_FSINTSTAT_TOKDNE_MASK               (0x1U << USB_FSINTSTAT_TOKDNE_SHIFT)
#define USB_FSINTSTAT_TOKDNE(x)                 (((uint32_t)(((uint32_t)(x)) << USB_FSINTSTAT_TOKDNE_SHIFT)) & USB_FSINTSTAT_TOKDNE_MASK)

#define USB_FSINTSTAT_SOFTOK_SHIFT              (2)
#define USB_FSINTSTAT_SOFTOK_MASK               (0x1U << USB_FSINTSTAT_SOFTOK_SHIFT)
#define USB_FSINTSTAT_SOFTOK(x)                 (((uint32_t)(((uint32_t)(x)) << USB_FSINTSTAT_SOFTOK_SHIFT)) & USB_FSINTSTAT_SOFTOK_MASK)

#define USB_FSINTSTAT_ERROR_SHIFT               (1)
#define USB_FSINTSTAT_ERROR_MASK                (0x1U << USB_FSINTSTAT_ERROR_SHIFT)
#define USB_FSINTSTAT_ERROR(x)                  (((uint32_t)(((uint32_t)(x)) << USB_FSINTSTAT_ERROR_SHIFT)) & USB_FSINTSTAT_ERROR_MASK)

